// #################################################################################
// Generated by Symbol Type Viewer 32Bit/64Bit - Version 1.0.0.6 beta
// http://www.syseclabs.com
// Coding by Lionel d'Hauenens
// #################################################################################
// Image         : 64bit
// ImageName     : Z:\shared\idb\ntoskrnl.exe
// LoadedPdbName : C:\symbols\ntkrnlmp.pdb\F8E2A8B5C9B74BF4A6E4A48F180099942\ntkrnlmp.pdb

#ifdef __cplusplus
extern "C" {
#endif

//////////////////
//   C Define   //
//////////////////

#define VOID void
#define STDCALL __stdcall
#define FASTCALL __fastcall
#define CDECL __cdecl
#define THISCALL __thiscall
#define NEAR 
#define FAR 
//---------------------------------------------------------------------

//////////////////
// C Basic Type //
//////////////////

typedef signed char INT8;
typedef signed char CHAR;
typedef signed short INT16;
typedef signed int INT32;
typedef signed int BOOL;
typedef signed __int64 INT64;
typedef signed __int64 LONG64;
typedef signed long LONG32;
typedef unsigned char UINT8;
typedef unsigned char BYTE;
typedef unsigned short UINT16;
typedef unsigned short WCHAR;
typedef unsigned int UINT32;
typedef unsigned __int64 UINT64;
typedef unsigned __int64 ULONG64;
typedef unsigned long ULONG32;
typedef float FLOAT32;
typedef double FLOAT64;
typedef struct {unsigned short W[5];} FLOAT80;
typedef struct { __int64 LowPart;__int64 HighPart;} FLOAT128;
typedef double DATE;
typedef signed long HRESULT;
typedef union { struct {unsigned long Lo; long Hi;}; __int64 int64;} CURRENCY;

typedef union _LARGE_INTEGER   // 4 elements, 0x8 bytes (sizeof) 
          {                                                                
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              };                                                           
              struct                     // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         ULONG32      LowPart;                                    
/*0x004*/         LONG32       HighPart;                                   
              }u;                                                          
/*0x000*/     INT64        QuadPart;                                       
          }LARGE_INTEGER, *PLARGE_INTEGER;                                  
          
//---------------------------------------------------------------------

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Enum types

typedef enum ___200912220B393200AD8CC51151E96761C_RecordType  // 2 elements, 0x4 bytes
{
    KTMOH_CommitTransaction_Result   = 1 /*0x1*/,
    KTMOH_RollbackTransaction_Result = 2 /*0x2*/
}__200912220B393200AD8CC51151E96761C_RecordType, *P__200912220B393200AD8CC51151E96761C_RecordType;

typedef enum _ALTERNATIVE_ARCHITECTURE_TYPE  // 3 elements, 0x4 bytes
{
    StandardDesign  = 0 /*0x0*/,
    NEC98x86        = 1 /*0x1*/,
    EndAlternatives = 2 /*0x2*/
}ALTERNATIVE_ARCHITECTURE_TYPE, *PALTERNATIVE_ARCHITECTURE_TYPE;

typedef enum _ARBITER_ACTION  // 10 elements, 0x4 bytes
{
    ArbiterActionTestAllocation          = 0 /*0x0*/,
    ArbiterActionRetestAllocation        = 1 /*0x1*/,
    ArbiterActionCommitAllocation        = 2 /*0x2*/,
    ArbiterActionRollbackAllocation      = 3 /*0x3*/,
    ArbiterActionQueryAllocatedResources = 4 /*0x4*/,
    ArbiterActionWriteReservedResources  = 5 /*0x5*/,
    ArbiterActionQueryConflict           = 6 /*0x6*/,
    ArbiterActionQueryArbitrate          = 7 /*0x7*/,
    ArbiterActionAddReserved             = 8 /*0x8*/,
    ArbiterActionBootAllocation          = 9 /*0x9*/
}ARBITER_ACTION, *PARBITER_ACTION;

typedef enum _ARBITER_REQUEST_SOURCE  // 6 elements, 0x4 bytes
{
    ArbiterRequestUndefined      = -1 /*0xFF*/,
    ArbiterRequestLegacyReported = 0 /*0x0*/,
    ArbiterRequestHalReported    = 1 /*0x1*/,
    ArbiterRequestLegacyAssigned = 2 /*0x2*/,
    ArbiterRequestPnpDetected    = 3 /*0x3*/,
    ArbiterRequestPnpEnumerated  = 4 /*0x4*/
}ARBITER_REQUEST_SOURCE, *PARBITER_REQUEST_SOURCE;

typedef enum _ARBITER_RESULT  // 4 elements, 0x4 bytes
{
    ArbiterResultUndefined        = -1 /*0xFF*/,
    ArbiterResultSuccess          = 0 /*0x0*/,
    ArbiterResultExternalConflict = 1 /*0x1*/,
    ArbiterResultNullRequest      = 2 /*0x2*/
}ARBITER_RESULT, *PARBITER_RESULT;

typedef enum _BLOB_ID  // 11 elements, 0x4 bytes
{
    BLOB_TYPE_UNKNOWN          = 0 /*0x0*/,
    BLOB_TYPE_CONNECTION_INFO  = 1 /*0x1*/,
    BLOB_TYPE_MESSAGE          = 2 /*0x2*/,
    BLOB_TYPE_SECURITY_CONTEXT = 3 /*0x3*/,
    BLOB_TYPE_SECTION          = 4 /*0x4*/,
    BLOB_TYPE_REGION           = 5 /*0x5*/,
    BLOB_TYPE_VIEW             = 6 /*0x6*/,
    BLOB_TYPE_RESERVE          = 7 /*0x7*/,
    BLOB_TYPE_DIRECT_TRANSFER  = 8 /*0x8*/,
    BLOB_TYPE_HANDLE_DATA      = 9 /*0x9*/,
    BLOB_TYPE_MAX_ID           = 10 /*0xA*/
}BLOB_ID, *PBLOB_ID;

typedef enum _BUS_QUERY_ID_TYPE  // 6 elements, 0x4 bytes
{
    BusQueryDeviceID           = 0 /*0x0*/,
    BusQueryHardwareIDs        = 1 /*0x1*/,
    BusQueryCompatibleIDs      = 2 /*0x2*/,
    BusQueryInstanceID         = 3 /*0x3*/,
    BusQueryDeviceSerialNumber = 4 /*0x4*/,
    BusQueryContainerID        = 5 /*0x5*/
}BUS_QUERY_ID_TYPE, *PBUS_QUERY_ID_TYPE;

typedef enum _CM_LOAD_FAILURE_TYPE  // 20 elements, 0x4 bytes
{
    _None                               = 0 /*0x0*/,
    _CmInitializeHive                   = 1 /*0x1*/,
    _HvInitializeHive                   = 2 /*0x2*/,
    _HvpBuildMap                        = 3 /*0x3*/,
    _HvpBuildMapAndCopy                 = 4 /*0x4*/,
    _HvpInitMap                         = 5 /*0x5*/,
    _HvLoadHive                         = 6 /*0x6*/,
    _HvpReadFileImageAndBuildMap        = 7 /*0x7*/,
    _HvpRecoverData                     = 8 /*0x8*/,
    _HvpRecoverWholeHive                = 9 /*0x9*/,
    _HvpMapFileImageAndBuildMap         = 10 /*0xA*/,
    _CmpValidateHiveSecurityDescriptors = 11 /*0xB*/,
    _HvpEnlistBinInMap                  = 12 /*0xC*/,
    _CmCheckRegistry                    = 13 /*0xD*/,
    _CmRegistryIO                       = 14 /*0xE*/,
    _CmCheckRegistry2                   = 15 /*0xF*/,
    _CmpCheckKey                        = 16 /*0x10*/,
    _CmpCheckValueList                  = 17 /*0x11*/,
    _HvCheckHive                        = 18 /*0x12*/,
    _HvCheckBin                         = 19 /*0x13*/
}CM_LOAD_FAILURE_TYPE, *PCM_LOAD_FAILURE_TYPE;

typedef enum _CM_SHARE_DISPOSITION  // 4 elements, 0x4 bytes
{
    CmResourceShareUndetermined    = 0 /*0x0*/,
    CmResourceShareDeviceExclusive = 1 /*0x1*/,
    CmResourceShareDriverExclusive = 2 /*0x2*/,
    CmResourceShareShared          = 3 /*0x3*/
}CM_SHARE_DISPOSITION, *PCM_SHARE_DISPOSITION;

typedef enum _CONFIGURATION_CLASS  // 8 elements, 0x4 bytes
{
    SystemClass     = 0 /*0x0*/,
    ProcessorClass  = 1 /*0x1*/,
    CacheClass      = 2 /*0x2*/,
    AdapterClass    = 3 /*0x3*/,
    ControllerClass = 4 /*0x4*/,
    PeripheralClass = 5 /*0x5*/,
    MemoryClass     = 6 /*0x6*/,
    MaximumClass    = 7 /*0x7*/
}CONFIGURATION_CLASS, *PCONFIGURATION_CLASS;

typedef enum _CONFIGURATION_TYPE  // 42 elements, 0x4 bytes
{
    ArcSystem               = 0 /*0x0*/,
    CentralProcessor        = 1 /*0x1*/,
    FloatingPointProcessor  = 2 /*0x2*/,
    PrimaryIcache           = 3 /*0x3*/,
    PrimaryDcache           = 4 /*0x4*/,
    SecondaryIcache         = 5 /*0x5*/,
    SecondaryDcache         = 6 /*0x6*/,
    SecondaryCache          = 7 /*0x7*/,
    EisaAdapter             = 8 /*0x8*/,
    TcAdapter               = 9 /*0x9*/,
    ScsiAdapter             = 10 /*0xA*/,
    DtiAdapter              = 11 /*0xB*/,
    MultiFunctionAdapter    = 12 /*0xC*/,
    DiskController          = 13 /*0xD*/,
    TapeController          = 14 /*0xE*/,
    CdromController         = 15 /*0xF*/,
    WormController          = 16 /*0x10*/,
    SerialController        = 17 /*0x11*/,
    NetworkController       = 18 /*0x12*/,
    DisplayController       = 19 /*0x13*/,
    ParallelController      = 20 /*0x14*/,
    PointerController       = 21 /*0x15*/,
    KeyboardController      = 22 /*0x16*/,
    AudioController         = 23 /*0x17*/,
    OtherController         = 24 /*0x18*/,
    DiskPeripheral          = 25 /*0x19*/,
    FloppyDiskPeripheral    = 26 /*0x1A*/,
    TapePeripheral          = 27 /*0x1B*/,
    ModemPeripheral         = 28 /*0x1C*/,
    MonitorPeripheral       = 29 /*0x1D*/,
    PrinterPeripheral       = 30 /*0x1E*/,
    PointerPeripheral       = 31 /*0x1F*/,
    KeyboardPeripheral      = 32 /*0x20*/,
    TerminalPeripheral      = 33 /*0x21*/,
    OtherPeripheral         = 34 /*0x22*/,
    LinePeripheral          = 35 /*0x23*/,
    NetworkPeripheral       = 36 /*0x24*/,
    SystemMemory            = 37 /*0x25*/,
    DockingInformation      = 38 /*0x26*/,
    RealModeIrqRoutingTable = 39 /*0x27*/,
    RealModePCIEnumeration  = 40 /*0x28*/,
    MaximumType             = 41 /*0x29*/
}CONFIGURATION_TYPE, *PCONFIGURATION_TYPE;

typedef enum _CREATE_FILE_TYPE  // 3 elements, 0x4 bytes
{
    CreateFileTypeNone      = 0 /*0x0*/,
    CreateFileTypeNamedPipe = 1 /*0x1*/,
    CreateFileTypeMailslot  = 2 /*0x2*/
}CREATE_FILE_TYPE, *PCREATE_FILE_TYPE;

typedef enum _DEVICE_POWER_STATE  // 6 elements, 0x4 bytes
{
    PowerDeviceUnspecified = 0 /*0x0*/,
    PowerDeviceD0          = 1 /*0x1*/,
    PowerDeviceD1          = 2 /*0x2*/,
    PowerDeviceD2          = 3 /*0x3*/,
    PowerDeviceD3          = 4 /*0x4*/,
    PowerDeviceMaximum     = 5 /*0x5*/
}DEVICE_POWER_STATE, *PDEVICE_POWER_STATE;

typedef enum _DEVICE_RELATION_TYPE  // 7 elements, 0x4 bytes
{
    BusRelations         = 0 /*0x0*/,
    EjectionRelations    = 1 /*0x1*/,
    PowerRelations       = 2 /*0x2*/,
    RemovalRelations     = 3 /*0x3*/,
    TargetDeviceRelation = 4 /*0x4*/,
    SingleBusRelations   = 5 /*0x5*/,
    TransportRelations   = 6 /*0x6*/
}DEVICE_RELATION_TYPE, *PDEVICE_RELATION_TYPE;

typedef enum _DEVICE_TEXT_TYPE  // 2 elements, 0x4 bytes
{
    DeviceTextDescription         = 0 /*0x0*/,
    DeviceTextLocationInformation = 1 /*0x1*/
}DEVICE_TEXT_TYPE, *PDEVICE_TEXT_TYPE;

typedef enum _DEVICE_USAGE_NOTIFICATION_TYPE  // 4 elements, 0x4 bytes
{
    DeviceUsageTypeUndefined   = 0 /*0x0*/,
    DeviceUsageTypePaging      = 1 /*0x1*/,
    DeviceUsageTypeHibernation = 2 /*0x2*/,
    DeviceUsageTypeDumpFile    = 3 /*0x3*/
}DEVICE_USAGE_NOTIFICATION_TYPE, *PDEVICE_USAGE_NOTIFICATION_TYPE;

typedef enum _DPFLTR_TYPE  // 147 elements, 0x4 bytes
{
    DPFLTR_SYSTEM_ID         = 0 /*0x0*/,
    DPFLTR_SMSS_ID           = 1 /*0x1*/,
    DPFLTR_SETUP_ID          = 2 /*0x2*/,
    DPFLTR_NTFS_ID           = 3 /*0x3*/,
    DPFLTR_FSTUB_ID          = 4 /*0x4*/,
    DPFLTR_CRASHDUMP_ID      = 5 /*0x5*/,
    DPFLTR_CDAUDIO_ID        = 6 /*0x6*/,
    DPFLTR_CDROM_ID          = 7 /*0x7*/,
    DPFLTR_CLASSPNP_ID       = 8 /*0x8*/,
    DPFLTR_DISK_ID           = 9 /*0x9*/,
    DPFLTR_REDBOOK_ID        = 10 /*0xA*/,
    DPFLTR_STORPROP_ID       = 11 /*0xB*/,
    DPFLTR_SCSIPORT_ID       = 12 /*0xC*/,
    DPFLTR_SCSIMINIPORT_ID   = 13 /*0xD*/,
    DPFLTR_CONFIG_ID         = 14 /*0xE*/,
    DPFLTR_I8042PRT_ID       = 15 /*0xF*/,
    DPFLTR_SERMOUSE_ID       = 16 /*0x10*/,
    DPFLTR_LSERMOUS_ID       = 17 /*0x11*/,
    DPFLTR_KBDHID_ID         = 18 /*0x12*/,
    DPFLTR_MOUHID_ID         = 19 /*0x13*/,
    DPFLTR_KBDCLASS_ID       = 20 /*0x14*/,
    DPFLTR_MOUCLASS_ID       = 21 /*0x15*/,
    DPFLTR_TWOTRACK_ID       = 22 /*0x16*/,
    DPFLTR_WMILIB_ID         = 23 /*0x17*/,
    DPFLTR_ACPI_ID           = 24 /*0x18*/,
    DPFLTR_AMLI_ID           = 25 /*0x19*/,
    DPFLTR_HALIA64_ID        = 26 /*0x1A*/,
    DPFLTR_VIDEO_ID          = 27 /*0x1B*/,
    DPFLTR_SVCHOST_ID        = 28 /*0x1C*/,
    DPFLTR_VIDEOPRT_ID       = 29 /*0x1D*/,
    DPFLTR_TCPIP_ID          = 30 /*0x1E*/,
    DPFLTR_DMSYNTH_ID        = 31 /*0x1F*/,
    DPFLTR_NTOSPNP_ID        = 32 /*0x20*/,
    DPFLTR_FASTFAT_ID        = 33 /*0x21*/,
    DPFLTR_SAMSS_ID          = 34 /*0x22*/,
    DPFLTR_PNPMGR_ID         = 35 /*0x23*/,
    DPFLTR_NETAPI_ID         = 36 /*0x24*/,
    DPFLTR_SCSERVER_ID       = 37 /*0x25*/,
    DPFLTR_SCCLIENT_ID       = 38 /*0x26*/,
    DPFLTR_SERIAL_ID         = 39 /*0x27*/,
    DPFLTR_SERENUM_ID        = 40 /*0x28*/,
    DPFLTR_UHCD_ID           = 41 /*0x29*/,
    DPFLTR_RPCPROXY_ID       = 42 /*0x2A*/,
    DPFLTR_AUTOCHK_ID        = 43 /*0x2B*/,
    DPFLTR_DCOMSS_ID         = 44 /*0x2C*/,
    DPFLTR_UNIMODEM_ID       = 45 /*0x2D*/,
    DPFLTR_SIS_ID            = 46 /*0x2E*/,
    DPFLTR_FLTMGR_ID         = 47 /*0x2F*/,
    DPFLTR_WMICORE_ID        = 48 /*0x30*/,
    DPFLTR_BURNENG_ID        = 49 /*0x31*/,
    DPFLTR_IMAPI_ID          = 50 /*0x32*/,
    DPFLTR_SXS_ID            = 51 /*0x33*/,
    DPFLTR_FUSION_ID         = 52 /*0x34*/,
    DPFLTR_IDLETASK_ID       = 53 /*0x35*/,
    DPFLTR_SOFTPCI_ID        = 54 /*0x36*/,
    DPFLTR_TAPE_ID           = 55 /*0x37*/,
    DPFLTR_MCHGR_ID          = 56 /*0x38*/,
    DPFLTR_IDEP_ID           = 57 /*0x39*/,
    DPFLTR_PCIIDE_ID         = 58 /*0x3A*/,
    DPFLTR_FLOPPY_ID         = 59 /*0x3B*/,
    DPFLTR_FDC_ID            = 60 /*0x3C*/,
    DPFLTR_TERMSRV_ID        = 61 /*0x3D*/,
    DPFLTR_W32TIME_ID        = 62 /*0x3E*/,
    DPFLTR_PREFETCHER_ID     = 63 /*0x3F*/,
    DPFLTR_RSFILTER_ID       = 64 /*0x40*/,
    DPFLTR_FCPORT_ID         = 65 /*0x41*/,
    DPFLTR_PCI_ID            = 66 /*0x42*/,
    DPFLTR_DMIO_ID           = 67 /*0x43*/,
    DPFLTR_DMCONFIG_ID       = 68 /*0x44*/,
    DPFLTR_DMADMIN_ID        = 69 /*0x45*/,
    DPFLTR_WSOCKTRANSPORT_ID = 70 /*0x46*/,
    DPFLTR_VSS_ID            = 71 /*0x47*/,
    DPFLTR_PNPMEM_ID         = 72 /*0x48*/,
    DPFLTR_PROCESSOR_ID      = 73 /*0x49*/,
    DPFLTR_DMSERVER_ID       = 74 /*0x4A*/,
    DPFLTR_SR_ID             = 75 /*0x4B*/,
    DPFLTR_INFINIBAND_ID     = 76 /*0x4C*/,
    DPFLTR_IHVDRIVER_ID      = 77 /*0x4D*/,
    DPFLTR_IHVVIDEO_ID       = 78 /*0x4E*/,
    DPFLTR_IHVAUDIO_ID       = 79 /*0x4F*/,
    DPFLTR_IHVNETWORK_ID     = 80 /*0x50*/,
    DPFLTR_IHVSTREAMING_ID   = 81 /*0x51*/,
    DPFLTR_IHVBUS_ID         = 82 /*0x52*/,
    DPFLTR_HPS_ID            = 83 /*0x53*/,
    DPFLTR_RTLTHREADPOOL_ID  = 84 /*0x54*/,
    DPFLTR_LDR_ID            = 85 /*0x55*/,
    DPFLTR_TCPIP6_ID         = 86 /*0x56*/,
    DPFLTR_ISAPNP_ID         = 87 /*0x57*/,
    DPFLTR_SHPC_ID           = 88 /*0x58*/,
    DPFLTR_STORPORT_ID       = 89 /*0x59*/,
    DPFLTR_STORMINIPORT_ID   = 90 /*0x5A*/,
    DPFLTR_PRINTSPOOLER_ID   = 91 /*0x5B*/,
    DPFLTR_VSSDYNDISK_ID     = 92 /*0x5C*/,
    DPFLTR_VERIFIER_ID       = 93 /*0x5D*/,
    DPFLTR_VDS_ID            = 94 /*0x5E*/,
    DPFLTR_VDSBAS_ID         = 95 /*0x5F*/,
    DPFLTR_VDSDYN_ID         = 96 /*0x60*/,
    DPFLTR_VDSDYNDR_ID       = 97 /*0x61*/,
    DPFLTR_VDSLDR_ID         = 98 /*0x62*/,
    DPFLTR_VDSUTIL_ID        = 99 /*0x63*/,
    DPFLTR_DFRGIFC_ID        = 100 /*0x64*/,
    DPFLTR_DEFAULT_ID        = 101 /*0x65*/,
    DPFLTR_MM_ID             = 102 /*0x66*/,
    DPFLTR_DFSC_ID           = 103 /*0x67*/,
    DPFLTR_WOW64_ID          = 104 /*0x68*/,
    DPFLTR_ALPC_ID           = 105 /*0x69*/,
    DPFLTR_WDI_ID            = 106 /*0x6A*/,
    DPFLTR_PERFLIB_ID        = 107 /*0x6B*/,
    DPFLTR_KTM_ID            = 108 /*0x6C*/,
    DPFLTR_IOSTRESS_ID       = 109 /*0x6D*/,
    DPFLTR_HEAP_ID           = 110 /*0x6E*/,
    DPFLTR_WHEA_ID           = 111 /*0x6F*/,
    DPFLTR_USERGDI_ID        = 112 /*0x70*/,
    DPFLTR_MMCSS_ID          = 113 /*0x71*/,
    DPFLTR_TPM_ID            = 114 /*0x72*/,
    DPFLTR_THREADORDER_ID    = 115 /*0x73*/,
    DPFLTR_ENVIRON_ID        = 116 /*0x74*/,
    DPFLTR_EMS_ID            = 117 /*0x75*/,
    DPFLTR_WDT_ID            = 118 /*0x76*/,
    DPFLTR_FVEVOL_ID         = 119 /*0x77*/,
    DPFLTR_NDIS_ID           = 120 /*0x78*/,
    DPFLTR_NVCTRACE_ID       = 121 /*0x79*/,
    DPFLTR_LUAFV_ID          = 122 /*0x7A*/,
    DPFLTR_APPCOMPAT_ID      = 123 /*0x7B*/,
    DPFLTR_USBSTOR_ID        = 124 /*0x7C*/,
    DPFLTR_SBP2PORT_ID       = 125 /*0x7D*/,
    DPFLTR_COVERAGE_ID       = 126 /*0x7E*/,
    DPFLTR_CACHEMGR_ID       = 127 /*0x7F*/,
    DPFLTR_MOUNTMGR_ID       = 128 /*0x80*/,
    DPFLTR_CFR_ID            = 129 /*0x81*/,
    DPFLTR_TXF_ID            = 130 /*0x82*/,
    DPFLTR_KSECDD_ID         = 131 /*0x83*/,
    DPFLTR_FLTREGRESS_ID     = 132 /*0x84*/,
    DPFLTR_MPIO_ID           = 133 /*0x85*/,
    DPFLTR_MSDSM_ID          = 134 /*0x86*/,
    DPFLTR_UDFS_ID           = 135 /*0x87*/,
    DPFLTR_PSHED_ID          = 136 /*0x88*/,
    DPFLTR_STORVSP_ID        = 137 /*0x89*/,
    DPFLTR_LSASS_ID          = 138 /*0x8A*/,
    DPFLTR_SSPICLI_ID        = 139 /*0x8B*/,
    DPFLTR_CNG_ID            = 140 /*0x8C*/,
    DPFLTR_EXFAT_ID          = 141 /*0x8D*/,
    DPFLTR_FILETRACE_ID      = 142 /*0x8E*/,
    DPFLTR_XSAVE_ID          = 143 /*0x8F*/,
    DPFLTR_SE_ID             = 144 /*0x90*/,
    DPFLTR_DRIVEEXTENDER_ID  = 145 /*0x91*/,
    DPFLTR_ENDOFTABLE_ID     = 146 /*0x92*/
}DPFLTR_TYPE, *PDPFLTR_TYPE;

typedef enum _ETW_BUFFER_STATE  // 5 elements, 0x4 bytes
{
    EtwBufferStateFree           = 0 /*0x0*/,
    EtwBufferStateGeneralLogging = 1 /*0x1*/,
    EtwBufferStateCSwitch        = 2 /*0x2*/,
    EtwBufferStateFlush          = 3 /*0x3*/,
    EtwBufferStateMaximum        = 4 /*0x4*/
}ETW_BUFFER_STATE, *PETW_BUFFER_STATE;

typedef enum _ETW_GUID_TYPE  // 3 elements, 0x4 bytes
{
    EtwTraceGuidType        = 0 /*0x0*/,
    EtwNotificationGuidType = 1 /*0x1*/,
    EtwGuidTypeMax          = 2 /*0x2*/
}ETW_GUID_TYPE, *PETW_GUID_TYPE;

typedef enum _ETW_PROVIDER_STATE  // 4 elements, 0x4 bytes
{
    EtwProviderStateFree       = 0 /*0x0*/,
    EtwProviderStateTransition = 1 /*0x1*/,
    EtwProviderStateActive     = 2 /*0x2*/,
    EtwProviderStateMax        = 3 /*0x3*/
}ETW_PROVIDER_STATE, *PETW_PROVIDER_STATE;

typedef enum _ETW_RT_EVENT_LOSS  // 5 elements, 0x4 bytes
{
    EtwRtEventNoLoss  = 0 /*0x0*/,
    EtwRtEventLost    = 1 /*0x1*/,
    EtwRtBufferLost   = 2 /*0x2*/,
    EtwRtBackupLost   = 3 /*0x3*/,
    EtwRtEventLossMax = 4 /*0x4*/
}ETW_RT_EVENT_LOSS, *PETW_RT_EVENT_LOSS;

typedef enum _EVENT_TYPE  // 2 elements, 0x4 bytes
{
    NotificationEvent    = 0 /*0x0*/,
    SynchronizationEvent = 1 /*0x1*/
}EVENT_TYPE, *PEVENT_TYPE;

typedef enum _EX_POOL_PRIORITY  // 9 elements, 0x4 bytes
{
    LowPoolPriority                       = 0 /*0x0*/,
    LowPoolPrioritySpecialPoolOverrun     = 8 /*0x8*/,
    LowPoolPrioritySpecialPoolUnderrun    = 9 /*0x9*/,
    NormalPoolPriority                    = 16 /*0x10*/,
    NormalPoolPrioritySpecialPoolOverrun  = 24 /*0x18*/,
    NormalPoolPrioritySpecialPoolUnderrun = 25 /*0x19*/,
    HighPoolPriority                      = 32 /*0x20*/,
    HighPoolPrioritySpecialPoolOverrun    = 40 /*0x28*/,
    HighPoolPrioritySpecialPoolUnderrun   = 41 /*0x29*/
}EX_POOL_PRIORITY, *PEX_POOL_PRIORITY;

typedef enum _EXCEPTION_DISPOSITION  // 4 elements, 0x4 bytes
{
    ExceptionContinueExecution = 0 /*0x0*/,
    ExceptionContinueSearch    = 1 /*0x1*/,
    ExceptionNestedException   = 2 /*0x2*/,
    ExceptionCollidedUnwind    = 3 /*0x3*/
}EXCEPTION_DISPOSITION, *PEXCEPTION_DISPOSITION;

typedef enum _FILE_INFORMATION_CLASS  // 56 elements, 0x4 bytes
{
    FileDirectoryInformation                = 1 /*0x1*/,
    FileFullDirectoryInformation            = 2 /*0x2*/,
    FileBothDirectoryInformation            = 3 /*0x3*/,
    FileBasicInformation                    = 4 /*0x4*/,
    FileStandardInformation                 = 5 /*0x5*/,
    FileInternalInformation                 = 6 /*0x6*/,
    FileEaInformation                       = 7 /*0x7*/,
    FileAccessInformation                   = 8 /*0x8*/,
    FileNameInformation                     = 9 /*0x9*/,
    FileRenameInformation                   = 10 /*0xA*/,
    FileLinkInformation                     = 11 /*0xB*/,
    FileNamesInformation                    = 12 /*0xC*/,
    FileDispositionInformation              = 13 /*0xD*/,
    FilePositionInformation                 = 14 /*0xE*/,
    FileFullEaInformation                   = 15 /*0xF*/,
    FileModeInformation                     = 16 /*0x10*/,
    FileAlignmentInformation                = 17 /*0x11*/,
    FileAllInformation                      = 18 /*0x12*/,
    FileAllocationInformation               = 19 /*0x13*/,
    FileEndOfFileInformation                = 20 /*0x14*/,
    FileAlternateNameInformation            = 21 /*0x15*/,
    FileStreamInformation                   = 22 /*0x16*/,
    FilePipeInformation                     = 23 /*0x17*/,
    FilePipeLocalInformation                = 24 /*0x18*/,
    FilePipeRemoteInformation               = 25 /*0x19*/,
    FileMailslotQueryInformation            = 26 /*0x1A*/,
    FileMailslotSetInformation              = 27 /*0x1B*/,
    FileCompressionInformation              = 28 /*0x1C*/,
    FileObjectIdInformation                 = 29 /*0x1D*/,
    FileCompletionInformation               = 30 /*0x1E*/,
    FileMoveClusterInformation              = 31 /*0x1F*/,
    FileQuotaInformation                    = 32 /*0x20*/,
    FileReparsePointInformation             = 33 /*0x21*/,
    FileNetworkOpenInformation              = 34 /*0x22*/,
    FileAttributeTagInformation             = 35 /*0x23*/,
    FileTrackingInformation                 = 36 /*0x24*/,
    FileIdBothDirectoryInformation          = 37 /*0x25*/,
    FileIdFullDirectoryInformation          = 38 /*0x26*/,
    FileValidDataLengthInformation          = 39 /*0x27*/,
    FileShortNameInformation                = 40 /*0x28*/,
    FileIoCompletionNotificationInformation = 41 /*0x29*/,
    FileIoStatusBlockRangeInformation       = 42 /*0x2A*/,
    FileIoPriorityHintInformation           = 43 /*0x2B*/,
    FileSfioReserveInformation              = 44 /*0x2C*/,
    FileSfioVolumeInformation               = 45 /*0x2D*/,
    FileHardLinkInformation                 = 46 /*0x2E*/,
    FileProcessIdsUsingFileInformation      = 47 /*0x2F*/,
    FileNormalizedNameInformation           = 48 /*0x30*/,
    FileNetworkPhysicalNameInformation      = 49 /*0x31*/,
    FileIdGlobalTxDirectoryInformation      = 50 /*0x32*/,
    FileIsRemoteDeviceInformation           = 51 /*0x33*/,
    FileAttributeCacheInformation           = 52 /*0x34*/,
    FileNumaNodeInformation                 = 53 /*0x35*/,
    FileStandardLinkInformation             = 54 /*0x36*/,
    FileRemoteProtocolInformation           = 55 /*0x37*/,
    FileMaximumInformation                  = 56 /*0x38*/
}FILE_INFORMATION_CLASS, *PFILE_INFORMATION_CLASS;

typedef enum _FILE_OBJECT_EXTENSION_TYPE  // 8 elements, 0x4 bytes
{
    FoExtTypeTransactionParams = 0 /*0x0*/,
    FoExtTypeDeviceObjectHint  = 1 /*0x1*/,
    FoExtTypeIosbRange         = 2 /*0x2*/,
    FoExtTypeGeneric           = 3 /*0x3*/,
    FoExtTypeSfio              = 4 /*0x4*/,
    FoExtTypeSymlink           = 5 /*0x5*/,
    FoExtTypeOplockKey         = 6 /*0x6*/,
    MaxFoExtTypes              = 7 /*0x7*/
}FILE_OBJECT_EXTENSION_TYPE, *PFILE_OBJECT_EXTENSION_TYPE;

typedef enum _FS_FILTER_SECTION_SYNC_TYPE  // 2 elements, 0x4 bytes
{
    SyncTypeOther         = 0 /*0x0*/,
    SyncTypeCreateSection = 1 /*0x1*/
}FS_FILTER_SECTION_SYNC_TYPE, *PFS_FILTER_SECTION_SYNC_TYPE;

typedef enum _FS_FILTER_STREAM_FO_NOTIFICATION_TYPE  // 2 elements, 0x4 bytes
{
    NotifyTypeCreate  = 0 /*0x0*/,
    NotifyTypeRetired = 1 /*0x1*/
}FS_FILTER_STREAM_FO_NOTIFICATION_TYPE, *PFS_FILTER_STREAM_FO_NOTIFICATION_TYPE;

typedef enum _FSINFOCLASS  // 11 elements, 0x4 bytes
{
    FileFsVolumeInformation      = 1 /*0x1*/,
    FileFsLabelInformation       = 2 /*0x2*/,
    FileFsSizeInformation        = 3 /*0x3*/,
    FileFsDeviceInformation      = 4 /*0x4*/,
    FileFsAttributeInformation   = 5 /*0x5*/,
    FileFsControlInformation     = 6 /*0x6*/,
    FileFsFullSizeInformation    = 7 /*0x7*/,
    FileFsObjectIdInformation    = 8 /*0x8*/,
    FileFsDriverPathInformation  = 9 /*0x9*/,
    FileFsVolumeFlagsInformation = 10 /*0xA*/,
    FileFsMaximumInformation     = 11 /*0xB*/
}FSINFOCLASS, *PFSINFOCLASS;

typedef enum _HARDWARE_COUNTER_TYPE  // 2 elements, 0x4 bytes
{
    PMCCounter             = 0 /*0x0*/,
    MaxHardwareCounterType = 1 /*0x1*/
}HARDWARE_COUNTER_TYPE, *PHARDWARE_COUNTER_TYPE;

typedef enum _HEAP_FAILURE_TYPE  // 14 elements, 0x4 bytes
{
    heap_failure_internal                    = 0 /*0x0*/,
    heap_failure_unknown                     = 1 /*0x1*/,
    heap_failure_generic                     = 2 /*0x2*/,
    heap_failure_entry_corruption            = 3 /*0x3*/,
    heap_failure_multiple_entries_corruption = 4 /*0x4*/,
    heap_failure_virtual_block_corruption    = 5 /*0x5*/,
    heap_failure_buffer_overrun              = 6 /*0x6*/,
    heap_failure_buffer_underrun             = 7 /*0x7*/,
    heap_failure_block_not_busy              = 8 /*0x8*/,
    heap_failure_invalid_argument            = 9 /*0x9*/,
    heap_failure_usage_after_free            = 10 /*0xA*/,
    heap_failure_cross_heap_operation        = 11 /*0xB*/,
    heap_failure_freelists_corruption        = 12 /*0xC*/,
    heap_failure_listentry_corruption        = 13 /*0xD*/
}HEAP_FAILURE_TYPE, *PHEAP_FAILURE_TYPE;

typedef enum _HSTORAGE_TYPE  // 3 elements, 0x4 bytes
{
    Stable         = 0 /*0x0*/,
    Volatile       = 1 /*0x1*/,
    InvalidStorage = 2 /*0x2*/
}HSTORAGE_TYPE, *PHSTORAGE_TYPE;

typedef enum _INTERFACE_TYPE  // 19 elements, 0x4 bytes
{
    InterfaceTypeUndefined = -1 /*0xFF*/,
    Internal               = 0 /*0x0*/,
    Isa                    = 1 /*0x1*/,
    Eisa                   = 2 /*0x2*/,
    MicroChannel           = 3 /*0x3*/,
    TurboChannel           = 4 /*0x4*/,
    PCIBus                 = 5 /*0x5*/,
    VMEBus                 = 6 /*0x6*/,
    NuBus                  = 7 /*0x7*/,
    PCMCIABus              = 8 /*0x8*/,
    CBus                   = 9 /*0x9*/,
    MPIBus                 = 10 /*0xA*/,
    MPSABus                = 11 /*0xB*/,
    ProcessorInternal      = 12 /*0xC*/,
    InternalPowerBus       = 13 /*0xD*/,
    PNPISABus              = 14 /*0xE*/,
    PNPBus                 = 15 /*0xF*/,
    Vmcs                   = 16 /*0x10*/,
    MaximumInterfaceType   = 17 /*0x11*/
}INTERFACE_TYPE, *PINTERFACE_TYPE;

typedef enum _INTERLOCKED_RESULT  // 3 elements, 0x4 bytes
{
    ResultNegative = 1 /*0x1*/,
    ResultZero     = 0 /*0x0*/,
    ResultPositive = 2 /*0x2*/
}INTERLOCKED_RESULT, *PINTERLOCKED_RESULT;

typedef enum _IO_ALLOCATION_ACTION  // 3 elements, 0x4 bytes
{
    KeepObject                    = 1 /*0x1*/,
    DeallocateObject              = 2 /*0x2*/,
    DeallocateObjectKeepRegisters = 3 /*0x3*/
}IO_ALLOCATION_ACTION, *PIO_ALLOCATION_ACTION;

typedef enum _IO_PAGING_PRIORITY  // 5 elements, 0x4 bytes
{
    IoPagingPriorityInvalid   = 0 /*0x0*/,
    IoPagingPriorityNormal    = 1 /*0x1*/,
    IoPagingPriorityHigh      = 2 /*0x2*/,
    IoPagingPriorityReserved1 = 3 /*0x3*/,
    IoPagingPriorityReserved2 = 4 /*0x4*/
}IO_PAGING_PRIORITY, *PIO_PAGING_PRIORITY;

typedef enum _IO_PRIORITY_HINT  // 6 elements, 0x4 bytes
{
    IoPriorityVeryLow  = 0 /*0x0*/,
    IoPriorityLow      = 1 /*0x1*/,
    IoPriorityNormal   = 2 /*0x2*/,
    IoPriorityHigh     = 3 /*0x3*/,
    IoPriorityCritical = 4 /*0x4*/,
    MaxIoPriorityTypes = 5 /*0x5*/
}IO_PRIORITY_HINT, *PIO_PRIORITY_HINT;

typedef enum _IO_SESSION_STATE  // 9 elements, 0x4 bytes
{
    IoSessionStateCreated              = 1 /*0x1*/,
    IoSessionStateInitialized          = 2 /*0x2*/,
    IoSessionStateConnected            = 3 /*0x3*/,
    IoSessionStateDisconnected         = 4 /*0x4*/,
    IoSessionStateDisconnectedLoggedOn = 5 /*0x5*/,
    IoSessionStateLoggedOn             = 6 /*0x6*/,
    IoSessionStateLoggedOff            = 7 /*0x7*/,
    IoSessionStateTerminated           = 8 /*0x8*/,
    IoSessionStateMax                  = 9 /*0x9*/
}IO_SESSION_STATE, *PIO_SESSION_STATE;

typedef enum _IOP_PRIORITY_HINT  // 7 elements, 0x4 bytes
{
    IopIoPriorityNotSet   = 0 /*0x0*/,
    IopIoPriorityVeryLow  = 1 /*0x1*/,
    IopIoPriorityLow      = 2 /*0x2*/,
    IopIoPriorityNormal   = 3 /*0x3*/,
    IopIoPriorityHigh     = 4 /*0x4*/,
    IopIoPriorityCritical = 5 /*0x5*/,
    MaxIopIoPriorityTypes = 6 /*0x6*/
}IOP_PRIORITY_HINT, *PIOP_PRIORITY_HINT;

typedef enum _IRPLOCK  // 4 elements, 0x4 bytes
{
    IRPLOCK_CANCELABLE      = 0 /*0x0*/,
    IRPLOCK_CANCEL_STARTED  = 1 /*0x1*/,
    IRPLOCK_CANCEL_COMPLETE = 2 /*0x2*/,
    IRPLOCK_COMPLETED       = 3 /*0x3*/
}IRPLOCK, *PIRPLOCK;

typedef enum _IRQ_PRIORITY  // 4 elements, 0x4 bytes
{
    IrqPriorityUndefined = 0 /*0x0*/,
    IrqPriorityLow       = 1 /*0x1*/,
    IrqPriorityNormal    = 2 /*0x2*/,
    IrqPriorityHigh      = 3 /*0x3*/
}IRQ_PRIORITY, *PIRQ_PRIORITY;

typedef enum _KENLISTMENT_STATE  // 20 elements, 0x4 bytes
{
    KEnlistmentUninitialized         = 0 /*0x0*/,
    KEnlistmentActive                = 256 /*0x100*/,
    KEnlistmentPreparing             = 257 /*0x101*/,
    KEnlistmentPrepared              = 258 /*0x102*/,
    KEnlistmentInDoubt               = 259 /*0x103*/,
    KEnlistmentCommitted             = 260 /*0x104*/,
    KEnlistmentCommittedNotify       = 261 /*0x105*/,
    KEnlistmentCommitRequested       = 262 /*0x106*/,
    KEnlistmentAborted               = 263 /*0x107*/,
    KEnlistmentDelegated             = 264 /*0x108*/,
    KEnlistmentDelegatedDisconnected = 265 /*0x109*/,
    KEnlistmentPrePreparing          = 266 /*0x10A*/,
    KEnlistmentForgotten             = 267 /*0x10B*/,
    KEnlistmentRecovering            = 268 /*0x10C*/,
    KEnlistmentAborting              = 269 /*0x10D*/,
    KEnlistmentReadOnly              = 270 /*0x10E*/,
    KEnlistmentOutcomeUnavailable    = 271 /*0x10F*/,
    KEnlistmentOffline               = 272 /*0x110*/,
    KEnlistmentPrePrepared           = 273 /*0x111*/,
    KEnlistmentInitialized           = 274 /*0x112*/
}KENLISTMENT_STATE, *PKENLISTMENT_STATE;

typedef enum _KINTERRUPT_MODE  // 2 elements, 0x4 bytes
{
    LevelSensitive = 0 /*0x0*/,
    Latched        = 1 /*0x1*/
}KINTERRUPT_MODE, *PKINTERRUPT_MODE;

typedef enum _KINTERRUPT_POLARITY  // 3 elements, 0x4 bytes
{
    InterruptPolarityUnknown = 0 /*0x0*/,
    InterruptActiveHigh      = 1 /*0x1*/,
    InterruptActiveLow       = 2 /*0x2*/
}KINTERRUPT_POLARITY, *PKINTERRUPT_POLARITY;

typedef enum _KOBJECTS  // 26 elements, 0x4 bytes
{
    EventNotificationObject    = 0 /*0x0*/,
    EventSynchronizationObject = 1 /*0x1*/,
    MutantObject               = 2 /*0x2*/,
    ProcessObject              = 3 /*0x3*/,
    QueueObject                = 4 /*0x4*/,
    SemaphoreObject            = 5 /*0x5*/,
    ThreadObject               = 6 /*0x6*/,
    GateObject                 = 7 /*0x7*/,
    TimerNotificationObject    = 8 /*0x8*/,
    TimerSynchronizationObject = 9 /*0x9*/,
    Spare2Object               = 10 /*0xA*/,
    Spare3Object               = 11 /*0xB*/,
    Spare4Object               = 12 /*0xC*/,
    Spare5Object               = 13 /*0xD*/,
    Spare6Object               = 14 /*0xE*/,
    Spare7Object               = 15 /*0xF*/,
    Spare8Object               = 16 /*0x10*/,
    Spare9Object               = 17 /*0x11*/,
    ApcObject                  = 18 /*0x12*/,
    DpcObject                  = 19 /*0x13*/,
    DeviceQueueObject          = 20 /*0x14*/,
    EventPairObject            = 21 /*0x15*/,
    InterruptObject            = 22 /*0x16*/,
    ProfileObject              = 23 /*0x17*/,
    ThreadedDpcObject          = 24 /*0x18*/,
    MaximumKernelObject        = 25 /*0x19*/
}KOBJECTS, *PKOBJECTS;

typedef enum _KPROCESS_STATE  // 7 elements, 0x4 bytes
{
    ProcessInMemory      = 0 /*0x0*/,
    ProcessOutOfMemory   = 1 /*0x1*/,
    ProcessInTransition  = 2 /*0x2*/,
    ProcessOutTransition = 3 /*0x3*/,
    ProcessInSwap        = 4 /*0x4*/,
    ProcessOutSwap       = 5 /*0x5*/,
    ProcessAllSwapStates = 6 /*0x6*/
}KPROCESS_STATE, *PKPROCESS_STATE;

typedef enum _KRESOURCEMANAGER_STATE  // 3 elements, 0x4 bytes
{
    KResourceManagerUninitialized = 0 /*0x0*/,
    KResourceManagerOffline       = 1 /*0x1*/,
    KResourceManagerOnline        = 2 /*0x2*/
}KRESOURCEMANAGER_STATE, *PKRESOURCEMANAGER_STATE;

typedef enum _KTM_STATE  // 6 elements, 0x4 bytes
{
    KKtmUninitialized  = 0 /*0x0*/,
    KKtmInitialized    = 1 /*0x1*/,
    KKtmRecovering     = 2 /*0x2*/,
    KKtmOnline         = 3 /*0x3*/,
    KKtmRecoveryFailed = 4 /*0x4*/,
    KKtmOffline        = 5 /*0x5*/
}KTM_STATE, *PKTM_STATE;

typedef enum _KTRANSACTION_OUTCOME  // 5 elements, 0x4 bytes
{
    KTxOutcomeUninitialized = 0 /*0x0*/,
    KTxOutcomeUndetermined  = 1 /*0x1*/,
    KTxOutcomeCommitted     = 2 /*0x2*/,
    KTxOutcomeAborted       = 3 /*0x3*/,
    KTxOutcomeUnavailable   = 4 /*0x4*/
}KTRANSACTION_OUTCOME, *PKTRANSACTION_OUTCOME;

typedef enum _KTRANSACTION_STATE  // 12 elements, 0x4 bytes
{
    KTransactionUninitialized = 0 /*0x0*/,
    KTransactionActive        = 1 /*0x1*/,
    KTransactionPreparing     = 2 /*0x2*/,
    KTransactionPrepared      = 3 /*0x3*/,
    KTransactionInDoubt       = 4 /*0x4*/,
    KTransactionCommitted     = 5 /*0x5*/,
    KTransactionAborted       = 6 /*0x6*/,
    KTransactionDelegated     = 7 /*0x7*/,
    KTransactionPrePreparing  = 8 /*0x8*/,
    KTransactionForgotten     = 9 /*0x9*/,
    KTransactionRecovering    = 10 /*0xA*/,
    KTransactionPrePrepared   = 11 /*0xB*/
}KTRANSACTION_STATE, *PKTRANSACTION_STATE;

typedef enum _KWAIT_BLOCK_STATE  // 5 elements, 0x4 bytes
{
    WaitBlockBypassStart    = 0 /*0x0*/,
    WaitBlockBypassComplete = 1 /*0x1*/,
    WaitBlockActive         = 2 /*0x2*/,
    WaitBlockInactive       = 3 /*0x3*/,
    WaitBlockAllStates      = 4 /*0x4*/
}KWAIT_BLOCK_STATE, *PKWAIT_BLOCK_STATE;

typedef enum _KWAIT_REASON  // 38 elements, 0x4 bytes
{
    Executive         = 0 /*0x0*/,
    FreePage          = 1 /*0x1*/,
    PageIn            = 2 /*0x2*/,
    PoolAllocation    = 3 /*0x3*/,
    DelayExecution    = 4 /*0x4*/,
    Suspended         = 5 /*0x5*/,
    UserRequest       = 6 /*0x6*/,
    WrExecutive       = 7 /*0x7*/,
    WrFreePage        = 8 /*0x8*/,
    WrPageIn          = 9 /*0x9*/,
    WrPoolAllocation  = 10 /*0xA*/,
    WrDelayExecution  = 11 /*0xB*/,
    WrSuspended       = 12 /*0xC*/,
    WrUserRequest     = 13 /*0xD*/,
    WrEventPair       = 14 /*0xE*/,
    WrQueue           = 15 /*0xF*/,
    WrLpcReceive      = 16 /*0x10*/,
    WrLpcReply        = 17 /*0x11*/,
    WrVirtualMemory   = 18 /*0x12*/,
    WrPageOut         = 19 /*0x13*/,
    WrRendezvous      = 20 /*0x14*/,
    WrKeyedEvent      = 21 /*0x15*/,
    WrTerminated      = 22 /*0x16*/,
    WrProcessInSwap   = 23 /*0x17*/,
    WrCpuRateControl  = 24 /*0x18*/,
    WrCalloutStack    = 25 /*0x19*/,
    WrKernel          = 26 /*0x1A*/,
    WrResource        = 27 /*0x1B*/,
    WrPushLock        = 28 /*0x1C*/,
    WrMutex           = 29 /*0x1D*/,
    WrQuantumEnd      = 30 /*0x1E*/,
    WrDispatchInt     = 31 /*0x1F*/,
    WrPreempted       = 32 /*0x20*/,
    WrYieldExecution  = 33 /*0x21*/,
    WrFastMutex       = 34 /*0x22*/,
    WrGuardedMutex    = 35 /*0x23*/,
    WrRundown         = 36 /*0x24*/,
    MaximumWaitReason = 37 /*0x25*/
}KWAIT_REASON, *PKWAIT_REASON;

typedef enum _KWAIT_STATE  // 4 elements, 0x4 bytes
{
    WaitInProgress   = 0 /*0x0*/,
    WaitCommitted    = 1 /*0x1*/,
    WaitAborted      = 2 /*0x2*/,
    MaximumWaitState = 3 /*0x3*/
}KWAIT_STATE, *PKWAIT_STATE;

typedef enum _LOCK_OPERATION  // 3 elements, 0x4 bytes
{
    IoReadAccess   = 0 /*0x0*/,
    IoWriteAccess  = 1 /*0x1*/,
    IoModifyAccess = 2 /*0x2*/
}LOCK_OPERATION, *PLOCK_OPERATION;

typedef enum _LSA_FOREST_TRUST_RECORD_TYPE  // 4 elements, 0x4 bytes
{
    ForestTrustTopLevelName   = 0 /*0x0*/,
    ForestTrustTopLevelNameEx = 1 /*0x1*/,
    ForestTrustDomainInfo     = 2 /*0x2*/,
    ForestTrustRecordTypeLast = 2 /*0x2*/
}LSA_FOREST_TRUST_RECORD_TYPE, *PLSA_FOREST_TRUST_RECORD_TYPE;

typedef enum _MEMORY_CACHING_TYPE  // 7 elements, 0x4 bytes
{
    MmNonCached              = 0 /*0x0*/,
    MmCached                 = 1 /*0x1*/,
    MmWriteCombined          = 2 /*0x2*/,
    MmHardwareCoherentCached = 3 /*0x3*/,
    MmNonCachedUnordered     = 4 /*0x4*/,
    MmUSWCCached             = 5 /*0x5*/,
    MmMaximumCacheType       = 6 /*0x6*/
}MEMORY_CACHING_TYPE, *PMEMORY_CACHING_TYPE;

typedef enum _MEMORY_CACHING_TYPE_ORIG  // 1 elements, 0x4 bytes
{
    MmFrameBufferCached = 2 /*0x2*/
}MEMORY_CACHING_TYPE_ORIG, *PMEMORY_CACHING_TYPE_ORIG;

typedef enum _MI_DYNAMIC_MEMORY_LOCKTYPE  // 4 elements, 0x4 bytes
{
    AlreadyHeld          = 0 /*0x0*/,
    AcquiredShared       = 1 /*0x1*/,
    UseSpinLock          = 2 /*0x2*/,
    UseSpinLockRaiseIrql = 3 /*0x3*/
}MI_DYNAMIC_MEMORY_LOCKTYPE, *PMI_DYNAMIC_MEMORY_LOCKTYPE;

typedef enum _MI_PFN_CACHE_ATTRIBUTE  // 4 elements, 0x4 bytes
{
    MiNonCached     = 0 /*0x0*/,
    MiCached        = 1 /*0x1*/,
    MiWriteCombined = 2 /*0x2*/,
    MiNotMapped     = 3 /*0x3*/
}MI_PFN_CACHE_ATTRIBUTE, *PMI_PFN_CACHE_ATTRIBUTE;

typedef enum _MI_STORE_BIT_TYPE  // 3 elements, 0x4 bytes
{
    MiStoreBitTypeInStore = 0 /*0x0*/,
    MiStoreBitTypeEvicted = 1 /*0x1*/,
    MiStoreBitTypeMax     = 2 /*0x2*/
}MI_STORE_BIT_TYPE, *PMI_STORE_BIT_TYPE;

typedef enum _MI_SYSTEM_VA_TYPE  // 15 elements, 0x4 bytes
{
    MiVaUnused              = 0 /*0x0*/,
    MiVaSessionSpace        = 1 /*0x1*/,
    MiVaProcessSpace        = 2 /*0x2*/,
    MiVaBootLoaded          = 3 /*0x3*/,
    MiVaPfnDatabase         = 4 /*0x4*/,
    MiVaNonPagedPool        = 5 /*0x5*/,
    MiVaPagedPool           = 6 /*0x6*/,
    MiVaSpecialPoolPaged    = 7 /*0x7*/,
    MiVaSystemCache         = 8 /*0x8*/,
    MiVaSystemPtes          = 9 /*0x9*/,
    MiVaHal                 = 10 /*0xA*/,
    MiVaSessionGlobalSpace  = 11 /*0xB*/,
    MiVaDriverImages        = 12 /*0xC*/,
    MiVaSpecialPoolNonPaged = 13 /*0xD*/,
    MiVaMaximumType         = 14 /*0xE*/
}MI_SYSTEM_VA_TYPE, *PMI_SYSTEM_VA_TYPE;

typedef enum _MM_PAGE_ACCESS_TYPE  // 4 elements, 0x4 bytes
{
    MmPteAccessType         = 0 /*0x0*/,
    MmCcReadAheadType       = 1 /*0x1*/,
    MmPfnRepurposeType      = 2 /*0x2*/,
    MmMaximumPageAccessType = 3 /*0x3*/
}MM_PAGE_ACCESS_TYPE, *PMM_PAGE_ACCESS_TYPE;

typedef enum _MM_POOL_FAILURE_REASONS  // 12 elements, 0x4 bytes
{
    MmNonPagedNoPtes               = 0 /*0x0*/,
    MmPriorityTooLow               = 1 /*0x1*/,
    MmNonPagedNoPagesAvailable     = 2 /*0x2*/,
    MmPagedNoPtes                  = 3 /*0x3*/,
    MmSessionPagedNoPtes           = 4 /*0x4*/,
    MmPagedNoPagesAvailable        = 5 /*0x5*/,
    MmSessionPagedNoPagesAvailable = 6 /*0x6*/,
    MmPagedNoCommit                = 7 /*0x7*/,
    MmSessionPagedNoCommit         = 8 /*0x8*/,
    MmNonPagedNoResidentAvailable  = 9 /*0x9*/,
    MmNonPagedNoCommit             = 10 /*0xA*/,
    MmMaximumFailureReason         = 11 /*0xB*/
}MM_POOL_FAILURE_REASONS, *PMM_POOL_FAILURE_REASONS;

typedef enum _MM_POOL_PRIORITIES  // 4 elements, 0x4 bytes
{
    MmHighPriority        = 0 /*0x0*/,
    MmNormalPriority      = 1 /*0x1*/,
    MmLowPriority         = 2 /*0x2*/,
    MmMaximumPoolPriority = 3 /*0x3*/
}MM_POOL_PRIORITIES, *PMM_POOL_PRIORITIES;

typedef enum _MM_POOL_TYPES  // 4 elements, 0x4 bytes
{
    MmNonPagedPool     = 0 /*0x0*/,
    MmPagedPool        = 1 /*0x1*/,
    MmSessionPagedPool = 2 /*0x2*/,
    MmMaximumPoolType  = 3 /*0x3*/
}MM_POOL_TYPES, *PMM_POOL_TYPES;

typedef enum _MM_PREEMPTIVE_TRIMS  // 5 elements, 0x4 bytes
{
    MmPreemptForNonPaged         = 0 /*0x0*/,
    MmPreemptForPaged            = 1 /*0x1*/,
    MmPreemptForNonPagedPriority = 2 /*0x2*/,
    MmPreemptForPagedPriority    = 3 /*0x3*/,
    MmMaximumPreempt             = 4 /*0x4*/
}MM_PREEMPTIVE_TRIMS, *PMM_PREEMPTIVE_TRIMS;

typedef enum _MMLISTS  // 8 elements, 0x4 bytes
{
    ZeroedPageList          = 0 /*0x0*/,
    FreePageList            = 1 /*0x1*/,
    StandbyPageList         = 2 /*0x2*/,
    ModifiedPageList        = 3 /*0x3*/,
    ModifiedNoWritePageList = 4 /*0x4*/,
    BadPageList             = 5 /*0x5*/,
    ActiveAndValid          = 6 /*0x6*/,
    TransitionPage          = 7 /*0x7*/
}MMLISTS, *PMMLISTS;

typedef enum _MODE  // 3 elements, 0x4 bytes
{
    KernelMode  = 0 /*0x0*/,
    UserMode    = 1 /*0x1*/,
    MaximumMode = 2 /*0x2*/
}MODE, *PMODE;

typedef enum _NT_PRODUCT_TYPE  // 3 elements, 0x4 bytes
{
    NtProductWinNt    = 1 /*0x1*/,
    NtProductLanManNt = 2 /*0x2*/,
    NtProductServer   = 3 /*0x3*/
}NT_PRODUCT_TYPE, *PNT_PRODUCT_TYPE;

typedef enum _OB_OPEN_REASON  // 5 elements, 0x4 bytes
{
    ObCreateHandle    = 0 /*0x0*/,
    ObOpenHandle      = 1 /*0x1*/,
    ObDuplicateHandle = 2 /*0x2*/,
    ObInheritHandle   = 3 /*0x3*/,
    ObMaxOpenReason   = 4 /*0x4*/
}OB_OPEN_REASON, *POB_OPEN_REASON;

typedef enum _OBJECT_INFORMATION_CLASS  // 7 elements, 0x4 bytes
{
    ObjectBasicInformation      = 0 /*0x0*/,
    ObjectNameInformation       = 1 /*0x1*/,
    ObjectTypeInformation       = 2 /*0x2*/,
    ObjectTypesInformation      = 3 /*0x3*/,
    ObjectHandleFlagInformation = 4 /*0x4*/,
    ObjectSessionInformation    = 5 /*0x5*/,
    MaxObjectInfoClass          = 6 /*0x6*/
}OBJECT_INFORMATION_CLASS, *POBJECT_INFORMATION_CLASS;

typedef enum _PCW_CALLBACK_TYPE  // 4 elements, 0x4 bytes
{
    PcwCallbackAddCounter         = 0 /*0x0*/,
    PcwCallbackRemoveCounter      = 1 /*0x1*/,
    PcwCallbackEnumerateInstances = 2 /*0x2*/,
    PcwCallbackCollectData        = 3 /*0x3*/
}PCW_CALLBACK_TYPE, *PPCW_CALLBACK_TYPE;

typedef enum _PF_FILE_ACCESS_TYPE  // 3 elements, 0x4 bytes
{
    PfFileAccessTypeRead  = 0 /*0x0*/,
    PfFileAccessTypeWrite = 1 /*0x1*/,
    PfFileAccessTypeMax   = 2 /*0x2*/
}PF_FILE_ACCESS_TYPE, *PPF_FILE_ACCESS_TYPE;

typedef enum _PLUGPLAY_EVENT_CATEGORY  // 12 elements, 0x4 bytes
{
    HardwareProfileChangeEvent = 0 /*0x0*/,
    TargetDeviceChangeEvent    = 1 /*0x1*/,
    DeviceClassChangeEvent     = 2 /*0x2*/,
    CustomDeviceEvent          = 3 /*0x3*/,
    DeviceInstallEvent         = 4 /*0x4*/,
    DeviceArrivalEvent         = 5 /*0x5*/,
    VetoEvent                  = 6 /*0x6*/,
    BlockedDriverEvent         = 7 /*0x7*/,
    InvalidIDEvent             = 8 /*0x8*/,
    DevicePropertyChangeEvent  = 9 /*0x9*/,
    DeviceInstanceRemovalEvent = 10 /*0xA*/,
    MaxPlugEventCategory       = 11 /*0xB*/
}PLUGPLAY_EVENT_CATEGORY, *PPLUGPLAY_EVENT_CATEGORY;

typedef enum _PNP_DEVICE_ACTION_REQUEST  // 19 elements, 0x4 bytes
{
    AssignResources             = 0 /*0x0*/,
    ClearDeviceProblem          = 1 /*0x1*/,
    ClearProblem                = 2 /*0x2*/,
    ClearEjectProblem           = 3 /*0x3*/,
    HaltDevice                  = 4 /*0x4*/,
    QueryPowerRelations         = 5 /*0x5*/,
    Rebalance                   = 6 /*0x6*/,
    ReenumerateBootDevices      = 7 /*0x7*/,
    ReenumerateDeviceOnly       = 8 /*0x8*/,
    ReenumerateDeviceTree       = 9 /*0x9*/,
    ReenumerateRootDevices      = 10 /*0xA*/,
    RequeryDeviceState          = 11 /*0xB*/,
    ResetDevice                 = 12 /*0xC*/,
    ResourceRequirementsChanged = 13 /*0xD*/,
    RestartEnumeration          = 14 /*0xE*/,
    SetDeviceProblem            = 15 /*0xF*/,
    StartDevice                 = 16 /*0x10*/,
    StartSystemDevicesPass0     = 17 /*0x11*/,
    StartSystemDevicesPass1     = 18 /*0x12*/
}PNP_DEVICE_ACTION_REQUEST, *PPNP_DEVICE_ACTION_REQUEST;

typedef enum _PNP_DEVNODE_STATE  // 22 elements, 0x4 bytes
{
    DeviceNodeUnspecified            = 768 /*0x300*/,
    DeviceNodeUninitialized          = 769 /*0x301*/,
    DeviceNodeInitialized            = 770 /*0x302*/,
    DeviceNodeDriversAdded           = 771 /*0x303*/,
    DeviceNodeResourcesAssigned      = 772 /*0x304*/,
    DeviceNodeStartPending           = 773 /*0x305*/,
    DeviceNodeStartCompletion        = 774 /*0x306*/,
    DeviceNodeStartPostWork          = 775 /*0x307*/,
    DeviceNodeStarted                = 776 /*0x308*/,
    DeviceNodeQueryStopped           = 777 /*0x309*/,
    DeviceNodeStopped                = 778 /*0x30A*/,
    DeviceNodeRestartCompletion      = 779 /*0x30B*/,
    DeviceNodeEnumeratePending       = 780 /*0x30C*/,
    DeviceNodeEnumerateCompletion    = 781 /*0x30D*/,
    DeviceNodeAwaitingQueuedDeletion = 782 /*0x30E*/,
    DeviceNodeAwaitingQueuedRemoval  = 783 /*0x30F*/,
    DeviceNodeQueryRemoved           = 784 /*0x310*/,
    DeviceNodeRemovePendingCloses    = 785 /*0x311*/,
    DeviceNodeRemoved                = 786 /*0x312*/,
    DeviceNodeDeletePendingCloses    = 787 /*0x313*/,
    DeviceNodeDeleted                = 788 /*0x314*/,
    MaxDeviceNodeState               = 789 /*0x315*/
}PNP_DEVNODE_STATE, *PPNP_DEVNODE_STATE;

typedef enum _PNP_VETO_TYPE  // 13 elements, 0x4 bytes
{
    PNP_VetoTypeUnknown          = 0 /*0x0*/,
    PNP_VetoLegacyDevice         = 1 /*0x1*/,
    PNP_VetoPendingClose         = 2 /*0x2*/,
    PNP_VetoWindowsApp           = 3 /*0x3*/,
    PNP_VetoWindowsService       = 4 /*0x4*/,
    PNP_VetoOutstandingOpen      = 5 /*0x5*/,
    PNP_VetoDevice               = 6 /*0x6*/,
    PNP_VetoDriver               = 7 /*0x7*/,
    PNP_VetoIllegalDeviceRequest = 8 /*0x8*/,
    PNP_VetoInsufficientPower    = 9 /*0x9*/,
    PNP_VetoNonDisableable       = 10 /*0xA*/,
    PNP_VetoLegacyDriver         = 11 /*0xB*/,
    PNP_VetoInsufficientRights   = 12 /*0xC*/
}PNP_VETO_TYPE, *PPNP_VETO_TYPE;

typedef enum _POLICY_AUDIT_EVENT_TYPE  // 9 elements, 0x4 bytes
{
    AuditCategorySystem                 = 0 /*0x0*/,
    AuditCategoryLogon                  = 1 /*0x1*/,
    AuditCategoryObjectAccess           = 2 /*0x2*/,
    AuditCategoryPrivilegeUse           = 3 /*0x3*/,
    AuditCategoryDetailedTracking       = 4 /*0x4*/,
    AuditCategoryPolicyChange           = 5 /*0x5*/,
    AuditCategoryAccountManagement      = 6 /*0x6*/,
    AuditCategoryDirectoryServiceAccess = 7 /*0x7*/,
    AuditCategoryAccountLogon           = 8 /*0x8*/
}POLICY_AUDIT_EVENT_TYPE, *PPOLICY_AUDIT_EVENT_TYPE;

typedef enum _POOL_TYPE  // 15 elements, 0x4 bytes
{
    NonPagedPool                         = 0 /*0x0*/,
    PagedPool                            = 1 /*0x1*/,
    NonPagedPoolMustSucceed              = 2 /*0x2*/,
    DontUseThisType                      = 3 /*0x3*/,
    NonPagedPoolCacheAligned             = 4 /*0x4*/,
    PagedPoolCacheAligned                = 5 /*0x5*/,
    NonPagedPoolCacheAlignedMustS        = 6 /*0x6*/,
    MaxPoolType                          = 7 /*0x7*/,
    NonPagedPoolSession                  = 32 /*0x20*/,
    PagedPoolSession                     = 33 /*0x21*/,
    NonPagedPoolMustSucceedSession       = 34 /*0x22*/,
    DontUseThisTypeSession               = 35 /*0x23*/,
    NonPagedPoolCacheAlignedSession      = 36 /*0x24*/,
    PagedPoolCacheAlignedSession         = 37 /*0x25*/,
    NonPagedPoolCacheAlignedMustSSession = 38 /*0x26*/
}POOL_TYPE, *PPOOL_TYPE;

typedef enum _POP_DEVICE_IDLE_TYPE  // 2 elements, 0x4 bytes
{
    DeviceIdleNormal = 0 /*0x0*/,
    DeviceIdleDisk   = 1 /*0x1*/
}POP_DEVICE_IDLE_TYPE, *PPOP_DEVICE_IDLE_TYPE;

typedef enum _POWER_ACTION  // 8 elements, 0x4 bytes
{
    PowerActionNone          = 0 /*0x0*/,
    PowerActionReserved      = 1 /*0x1*/,
    PowerActionSleep         = 2 /*0x2*/,
    PowerActionHibernate     = 3 /*0x3*/,
    PowerActionShutdown      = 4 /*0x4*/,
    PowerActionShutdownReset = 5 /*0x5*/,
    PowerActionShutdownOff   = 6 /*0x6*/,
    PowerActionWarmEject     = 7 /*0x7*/
}POWER_ACTION, *PPOWER_ACTION;

typedef enum _POWER_POLICY_DEVICE_TYPE  // 9 elements, 0x4 bytes
{
    PolicyDeviceSystemButton     = 0 /*0x0*/,
    PolicyDeviceThermalZone      = 1 /*0x1*/,
    PolicyDeviceBattery          = 2 /*0x2*/,
    PolicyDeviceMemory           = 3 /*0x3*/,
    PolicyInitiatePowerActionAPI = 4 /*0x4*/,
    PolicySetPowerStateAPI       = 5 /*0x5*/,
    PolicyImmediateDozeS4        = 6 /*0x6*/,
    PolicySystemIdle             = 7 /*0x7*/,
    PolicyDeviceMax              = 8 /*0x8*/
}POWER_POLICY_DEVICE_TYPE, *PPOWER_POLICY_DEVICE_TYPE;

typedef enum _POWER_STATE_TYPE  // 2 elements, 0x4 bytes
{
    SystemPowerState = 0 /*0x0*/,
    DevicePowerState = 1 /*0x1*/
}POWER_STATE_TYPE, *PPOWER_STATE_TYPE;

typedef enum _PP_NPAGED_LOOKASIDE_NUMBER  // 10 elements, 0x4 bytes
{
    LookasideSmallIrpList      = 0 /*0x0*/,
    LookasideMediumIrpList     = 1 /*0x1*/,
    LookasideLargeIrpList      = 2 /*0x2*/,
    LookasideMdlList           = 3 /*0x3*/,
    LookasideCreateInfoList    = 4 /*0x4*/,
    LookasideNameBufferList    = 5 /*0x5*/,
    LookasideTwilightList      = 6 /*0x6*/,
    LookasideCompletionList    = 7 /*0x7*/,
    LookasideScratchBufferList = 8 /*0x8*/,
    LookasideMaximumList       = 9 /*0x9*/
}PP_NPAGED_LOOKASIDE_NUMBER, *PPP_NPAGED_LOOKASIDE_NUMBER;

typedef enum _PROC_HYPERVISOR_STATE  // 3 elements, 0x4 bytes
{
    ProcHypervisorNone    = 0 /*0x0*/,
    ProcHypervisorPresent = 1 /*0x1*/,
    ProcHypervisorPower   = 2 /*0x2*/
}PROC_HYPERVISOR_STATE, *PPROC_HYPERVISOR_STATE;

typedef enum _PROCESSOR_CACHE_TYPE  // 4 elements, 0x4 bytes
{
    CacheUnified     = 0 /*0x0*/,
    CacheInstruction = 1 /*0x1*/,
    CacheData        = 2 /*0x2*/,
    CacheTrace       = 3 /*0x3*/
}PROCESSOR_CACHE_TYPE, *PPROCESSOR_CACHE_TYPE;

typedef enum _PROFILE_DEPARTURE_STYLE  // 4 elements, 0x4 bytes
{
    PDS_UPDATE_DEFAULT      = 1 /*0x1*/,
    PDS_UPDATE_ON_REMOVE    = 2 /*0x2*/,
    PDS_UPDATE_ON_INTERFACE = 3 /*0x3*/,
    PDS_UPDATE_ON_EJECT     = 4 /*0x4*/
}PROFILE_DEPARTURE_STYLE, *PPROFILE_DEPARTURE_STYLE;

typedef enum _PROFILE_STATUS  // 5 elements, 0x4 bytes
{
    DOCK_NOTDOCKDEVICE      = 0 /*0x0*/,
    DOCK_QUIESCENT          = 1 /*0x1*/,
    DOCK_ARRIVING           = 2 /*0x2*/,
    DOCK_DEPARTING          = 3 /*0x3*/,
    DOCK_EJECTIRP_COMPLETED = 4 /*0x4*/
}PROFILE_STATUS, *PPROFILE_STATUS;

typedef enum _PS_ATTRIBUTE_NUM  // 18 elements, 0x4 bytes
{
    PsAttributeParentProcess  = 0 /*0x0*/,
    PsAttributeDebugObject    = 1 /*0x1*/,
    PsAttributeToken          = 2 /*0x2*/,
    PsAttributeClientId       = 3 /*0x3*/,
    PsAttributeTebAddress     = 4 /*0x4*/,
    PsAttributeImageName      = 5 /*0x5*/,
    PsAttributeImageInfo      = 6 /*0x6*/,
    PsAttributeMemoryReserve  = 7 /*0x7*/,
    PsAttributePriorityClass  = 8 /*0x8*/,
    PsAttributeErrorMode      = 9 /*0x9*/,
    PsAttributeStdHandleInfo  = 10 /*0xA*/,
    PsAttributeHandleList     = 11 /*0xB*/,
    PsAttributeGroupAffinity  = 12 /*0xC*/,
    PsAttributePreferredNode  = 13 /*0xD*/,
    PsAttributeIdealProcessor = 14 /*0xE*/,
    PsAttributeUmsThread      = 15 /*0xF*/,
    PsAttributeExecuteOptions = 16 /*0x10*/,
    PsAttributeMax            = 17 /*0x11*/
}PS_ATTRIBUTE_NUM, *PPS_ATTRIBUTE_NUM;

typedef enum _PS_CREATE_STATE  // 8 elements, 0x4 bytes
{
    PsCreateInitialState        = 0 /*0x0*/,
    PsCreateFailOnFileOpen      = 1 /*0x1*/,
    PsCreateFailOnSectionCreate = 2 /*0x2*/,
    PsCreateFailExeFormat       = 3 /*0x3*/,
    PsCreateFailMachineMismatch = 4 /*0x4*/,
    PsCreateFailExeName         = 5 /*0x5*/,
    PsCreateSuccess             = 6 /*0x6*/,
    PsCreateMaximumStates       = 7 /*0x7*/
}PS_CREATE_STATE, *PPS_CREATE_STATE;

typedef enum _PS_IFEO_KEY_STATE  // 4 elements, 0x4 bytes
{
    PsReadIFEOAllValues = 0 /*0x0*/,
    PsSkipIFEODebugger  = 1 /*0x1*/,
    PsSkipAllIFEO       = 2 /*0x2*/,
    PsMaxIFEOKeyStates  = 3 /*0x3*/
}PS_IFEO_KEY_STATE, *PPS_IFEO_KEY_STATE;

typedef enum _PS_RESOURCE_TYPE  // 6 elements, 0x4 bytes
{
    PsResourceNonPagedPool = 0 /*0x0*/,
    PsResourcePagedPool    = 1 /*0x1*/,
    PsResourcePageFile     = 2 /*0x2*/,
    PsResourceWorkingSet   = 3 /*0x3*/,
    PsResourceCpuRate      = 4 /*0x4*/,
    PsResourceMax          = 5 /*0x5*/
}PS_RESOURCE_TYPE, *PPS_RESOURCE_TYPE;

typedef enum _PS_STD_HANDLE_STATE  // 4 elements, 0x4 bytes
{
    PsNeverDuplicate     = 0 /*0x0*/,
    PsRequestDuplicate   = 1 /*0x1*/,
    PsAlwaysDuplicate    = 2 /*0x2*/,
    PsMaxStdHandleStates = 3 /*0x3*/
}PS_STD_HANDLE_STATE, *PPS_STD_HANDLE_STATE;

typedef enum _REG_NOTIFY_CLASS  // 59 elements, 0x4 bytes
{
    RegNtDeleteKey                    = 0 /*0x0*/,
    RegNtPreDeleteKey                 = 0 /*0x0*/,
    RegNtSetValueKey                  = 1 /*0x1*/,
    RegNtPreSetValueKey               = 1 /*0x1*/,
    RegNtDeleteValueKey               = 2 /*0x2*/,
    RegNtPreDeleteValueKey            = 2 /*0x2*/,
    RegNtSetInformationKey            = 3 /*0x3*/,
    RegNtPreSetInformationKey         = 3 /*0x3*/,
    RegNtRenameKey                    = 4 /*0x4*/,
    RegNtPreRenameKey                 = 4 /*0x4*/,
    RegNtEnumerateKey                 = 5 /*0x5*/,
    RegNtPreEnumerateKey              = 5 /*0x5*/,
    RegNtEnumerateValueKey            = 6 /*0x6*/,
    RegNtPreEnumerateValueKey         = 6 /*0x6*/,
    RegNtQueryKey                     = 7 /*0x7*/,
    RegNtPreQueryKey                  = 7 /*0x7*/,
    RegNtQueryValueKey                = 8 /*0x8*/,
    RegNtPreQueryValueKey             = 8 /*0x8*/,
    RegNtQueryMultipleValueKey        = 9 /*0x9*/,
    RegNtPreQueryMultipleValueKey     = 9 /*0x9*/,
    RegNtPreCreateKey                 = 10 /*0xA*/,
    RegNtPostCreateKey                = 11 /*0xB*/,
    RegNtPreOpenKey                   = 12 /*0xC*/,
    RegNtPostOpenKey                  = 13 /*0xD*/,
    RegNtKeyHandleClose               = 14 /*0xE*/,
    RegNtPreKeyHandleClose            = 14 /*0xE*/,
    RegNtPostDeleteKey                = 15 /*0xF*/,
    RegNtPostSetValueKey              = 16 /*0x10*/,
    RegNtPostDeleteValueKey           = 17 /*0x11*/,
    RegNtPostSetInformationKey        = 18 /*0x12*/,
    RegNtPostRenameKey                = 19 /*0x13*/,
    RegNtPostEnumerateKey             = 20 /*0x14*/,
    RegNtPostEnumerateValueKey        = 21 /*0x15*/,
    RegNtPostQueryKey                 = 22 /*0x16*/,
    RegNtPostQueryValueKey            = 23 /*0x17*/,
    RegNtPostQueryMultipleValueKey    = 24 /*0x18*/,
    RegNtPostKeyHandleClose           = 25 /*0x19*/,
    RegNtPreCreateKeyEx               = 26 /*0x1A*/,
    RegNtPostCreateKeyEx              = 27 /*0x1B*/,
    RegNtPreOpenKeyEx                 = 28 /*0x1C*/,
    RegNtPostOpenKeyEx                = 29 /*0x1D*/,
    RegNtPreFlushKey                  = 30 /*0x1E*/,
    RegNtPostFlushKey                 = 31 /*0x1F*/,
    RegNtPreLoadKey                   = 32 /*0x20*/,
    RegNtPostLoadKey                  = 33 /*0x21*/,
    RegNtPreUnLoadKey                 = 34 /*0x22*/,
    RegNtPostUnLoadKey                = 35 /*0x23*/,
    RegNtPreQueryKeySecurity          = 36 /*0x24*/,
    RegNtPostQueryKeySecurity         = 37 /*0x25*/,
    RegNtPreSetKeySecurity            = 38 /*0x26*/,
    RegNtPostSetKeySecurity           = 39 /*0x27*/,
    RegNtCallbackObjectContextCleanup = 40 /*0x28*/,
    RegNtPreRestoreKey                = 41 /*0x29*/,
    RegNtPostRestoreKey               = 42 /*0x2A*/,
    RegNtPreSaveKey                   = 43 /*0x2B*/,
    RegNtPostSaveKey                  = 44 /*0x2C*/,
    RegNtPreReplaceKey                = 45 /*0x2D*/,
    RegNtPostReplaceKey               = 46 /*0x2E*/,
    MaxRegNtNotifyClass               = 47 /*0x2F*/
}REG_NOTIFY_CLASS, *PREG_NOTIFY_CLASS;

typedef enum _ReplacesCorHdrNumericDefines  // 24 elements, 0x4 bytes
{
    COMIMAGE_FLAGS_ILONLY                      = 1 /*0x1*/,
    COMIMAGE_FLAGS_32BITREQUIRED               = 2 /*0x2*/,
    COMIMAGE_FLAGS_IL_LIBRARY                  = 4 /*0x4*/,
    COMIMAGE_FLAGS_STRONGNAMESIGNED            = 8 /*0x8*/,
    COMIMAGE_FLAGS_NATIVE_ENTRYPOINT           = 16 /*0x10*/,
    COMIMAGE_FLAGS_TRACKDEBUGDATA              = 65536 /*0x10000*/,
    COR_VERSION_MAJOR_V2                       = 2 /*0x2*/,
    COR_VERSION_MAJOR                          = 2 /*0x2*/,
    COR_VERSION_MINOR                          = 0 /*0x0*/,
    COR_DELETED_NAME_LENGTH                    = 8 /*0x8*/,
    COR_VTABLEGAP_NAME_LENGTH                  = 8 /*0x8*/,
    NATIVE_TYPE_MAX_CB                         = 1 /*0x1*/,
    COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE       = 255 /*0xFF*/,
    IMAGE_COR_MIH_METHODRVA                    = 1 /*0x1*/,
    IMAGE_COR_MIH_EHRVA                        = 2 /*0x2*/,
    IMAGE_COR_MIH_BASICBLOCK                   = 8 /*0x8*/,
    COR_VTABLE_32BIT                           = 1 /*0x1*/,
    COR_VTABLE_64BIT                           = 2 /*0x2*/,
    COR_VTABLE_FROM_UNMANAGED                  = 4 /*0x4*/,
    COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 8 /*0x8*/,
    COR_VTABLE_CALL_MOST_DERIVED               = 16 /*0x10*/,
    IMAGE_COR_EATJ_THUNK_SIZE                  = 32 /*0x20*/,
    MAX_CLASS_NAME                             = 1024 /*0x400*/,
    MAX_PACKAGE_NAME                           = 1024 /*0x400*/
}ReplacesCorHdrNumericDefines, *PReplacesCorHdrNumericDefines;

typedef enum _REQUESTER_TYPE  // 3 elements, 0x4 bytes
{
    KernelRequester            = 0 /*0x0*/,
    UserProcessRequester       = 1 /*0x1*/,
    UserSharedServiceRequester = 2 /*0x2*/
}REQUESTER_TYPE, *PREQUESTER_TYPE;

typedef enum _RTL_GENERIC_COMPARE_RESULTS  // 3 elements, 0x4 bytes
{
    GenericLessThan    = 0 /*0x0*/,
    GenericGreaterThan = 1 /*0x1*/,
    GenericEqual       = 2 /*0x2*/
}RTL_GENERIC_COMPARE_RESULTS, *PRTL_GENERIC_COMPARE_RESULTS;

typedef enum _SECURITY_IMPERSONATION_LEVEL  // 4 elements, 0x4 bytes
{
    SecurityAnonymous      = 0 /*0x0*/,
    SecurityIdentification = 1 /*0x1*/,
    SecurityImpersonation  = 2 /*0x2*/,
    SecurityDelegation     = 3 /*0x3*/
}SECURITY_IMPERSONATION_LEVEL, *PSECURITY_IMPERSONATION_LEVEL;

typedef enum _SECURITY_OPERATION_CODE  // 4 elements, 0x4 bytes
{
    SetSecurityDescriptor    = 0 /*0x0*/,
    QuerySecurityDescriptor  = 1 /*0x1*/,
    DeleteSecurityDescriptor = 2 /*0x2*/,
    AssignSecurityDescriptor = 3 /*0x3*/
}SECURITY_OPERATION_CODE, *PSECURITY_OPERATION_CODE;

typedef enum _SYSTEM_POWER_CONDITION  // 4 elements, 0x4 bytes
{
    PoAc               = 0 /*0x0*/,
    PoDc               = 1 /*0x1*/,
    PoHot              = 2 /*0x2*/,
    PoConditionMaximum = 3 /*0x3*/
}SYSTEM_POWER_CONDITION, *PSYSTEM_POWER_CONDITION;

typedef enum _SYSTEM_POWER_STATE  // 8 elements, 0x4 bytes
{
    PowerSystemUnspecified = 0 /*0x0*/,
    PowerSystemWorking     = 1 /*0x1*/,
    PowerSystemSleeping1   = 2 /*0x2*/,
    PowerSystemSleeping2   = 3 /*0x3*/,
    PowerSystemSleeping3   = 4 /*0x4*/,
    PowerSystemHibernate   = 5 /*0x5*/,
    PowerSystemShutdown    = 6 /*0x6*/,
    PowerSystemMaximum     = 7 /*0x7*/
}SYSTEM_POWER_STATE, *PSYSTEM_POWER_STATE;

typedef enum _TOKEN_TYPE  // 2 elements, 0x4 bytes
{
    TokenPrimary       = 1 /*0x1*/,
    TokenImpersonation = 2 /*0x2*/
}TOKEN_TYPE, *PTOKEN_TYPE;

typedef enum _TP_CALLBACK_PRIORITY  // 4 elements, 0x4 bytes
{
    TP_CALLBACK_PRIORITY_HIGH    = 0 /*0x0*/,
    TP_CALLBACK_PRIORITY_NORMAL  = 1 /*0x1*/,
    TP_CALLBACK_PRIORITY_LOW     = 2 /*0x2*/,
    TP_CALLBACK_PRIORITY_INVALID = 3 /*0x3*/
}TP_CALLBACK_PRIORITY, *PTP_CALLBACK_PRIORITY;

typedef enum _TPM_BOOT_ENTROPY_RESULT_CODE  // 5 elements, 0x4 bytes
{
    TpmBootEntropyStructureUninitialized = 0 /*0x0*/,
    TpmBootEntropyDisabledByPolicy       = 1 /*0x1*/,
    TpmBootEntropyNoTpmFound             = 2 /*0x2*/,
    TpmBootEntropyTpmError               = 3 /*0x3*/,
    TpmBootEntropySuccess                = 4 /*0x4*/
}TPM_BOOT_ENTROPY_RESULT_CODE, *PTPM_BOOT_ENTROPY_RESULT_CODE;

typedef enum _TRANSFER_TYPE  // 3 elements, 0x4 bytes
{
    ReadTransfer  = 0 /*0x0*/,
    WriteTransfer = 1 /*0x1*/,
    OtherTransfer = 2 /*0x2*/
}TRANSFER_TYPE, *PTRANSFER_TYPE;

typedef enum _TYPE_OF_MEMORY  // 30 elements, 0x4 bytes
{
    LoaderExceptionBlock     = 0 /*0x0*/,
    LoaderSystemBlock        = 1 /*0x1*/,
    LoaderFree               = 2 /*0x2*/,
    LoaderBad                = 3 /*0x3*/,
    LoaderLoadedProgram      = 4 /*0x4*/,
    LoaderFirmwareTemporary  = 5 /*0x5*/,
    LoaderFirmwarePermanent  = 6 /*0x6*/,
    LoaderOsloaderHeap       = 7 /*0x7*/,
    LoaderOsloaderStack      = 8 /*0x8*/,
    LoaderSystemCode         = 9 /*0x9*/,
    LoaderHalCode            = 10 /*0xA*/,
    LoaderBootDriver         = 11 /*0xB*/,
    LoaderConsoleInDriver    = 12 /*0xC*/,
    LoaderConsoleOutDriver   = 13 /*0xD*/,
    LoaderStartupDpcStack    = 14 /*0xE*/,
    LoaderStartupKernelStack = 15 /*0xF*/,
    LoaderStartupPanicStack  = 16 /*0x10*/,
    LoaderStartupPcrPage     = 17 /*0x11*/,
    LoaderStartupPdrPage     = 18 /*0x12*/,
    LoaderRegistryData       = 19 /*0x13*/,
    LoaderMemoryData         = 20 /*0x14*/,
    LoaderNlsData            = 21 /*0x15*/,
    LoaderSpecialMemory      = 22 /*0x16*/,
    LoaderBBTMemory          = 23 /*0x17*/,
    LoaderReserve            = 24 /*0x18*/,
    LoaderXIPRom             = 25 /*0x19*/,
    LoaderHALCachedMemory    = 26 /*0x1A*/,
    LoaderLargePageFiller    = 27 /*0x1B*/,
    LoaderErrorLogMemory     = 28 /*0x1C*/,
    LoaderMaximum            = 29 /*0x1D*/
}TYPE_OF_MEMORY, *PTYPE_OF_MEMORY;

typedef enum _UoWActionType  // 15 elements, 0x4 bytes
{
    UoWAddThisKey            = 0 /*0x0*/,
    UoWAddChildKey           = 1 /*0x1*/,
    UoWDeleteThisKey         = 2 /*0x2*/,
    UoWDeleteChildKey        = 3 /*0x3*/,
    UoWSetValueNew           = 4 /*0x4*/,
    UoWSetValueExisting      = 5 /*0x5*/,
    UoWDeleteValue           = 6 /*0x6*/,
    UoWSetKeyUserFlags       = 7 /*0x7*/,
    UoWSetLastWriteTime      = 8 /*0x8*/,
    UoWSetSecurityDescriptor = 9 /*0x9*/,
    UoWRenameSubKey          = 10 /*0xA*/,
    UoWRenameOldSubKey       = 11 /*0xB*/,
    UoWRenameNewSubKey       = 12 /*0xC*/,
    UoWIsolation             = 13 /*0xD*/,
    UoWInvalid               = 14 /*0xE*/
}UoWActionType, *PUoWActionType;

typedef enum _VI_DEADLOCK_RESOURCE_TYPE  // 10 elements, 0x4 bytes
{
    VfDeadlockUnknown               = 0 /*0x0*/,
    VfDeadlockMutex                 = 1 /*0x1*/,
    VfDeadlockMutexAbandoned        = 2 /*0x2*/,
    VfDeadlockFastMutex             = 3 /*0x3*/,
    VfDeadlockFastMutexUnsafe       = 4 /*0x4*/,
    VfDeadlockSpinLock              = 5 /*0x5*/,
    VfDeadlockInStackQueuedSpinLock = 6 /*0x6*/,
    VfDeadlockUnusedSpinLock        = 7 /*0x7*/,
    VfDeadlockEresource             = 8 /*0x8*/,
    VfDeadlockTypeMaximum           = 9 /*0x9*/
}VI_DEADLOCK_RESOURCE_TYPE, *PVI_DEADLOCK_RESOURCE_TYPE;

typedef enum _WHEA_ERROR_PACKET_DATA_FORMAT  // 9 elements, 0x4 bytes
{
    WheaDataFormatIPFSalRecord = 0 /*0x0*/,
    WheaDataFormatXPFMCA       = 1 /*0x1*/,
    WheaDataFormatMemory       = 2 /*0x2*/,
    WheaDataFormatPCIExpress   = 3 /*0x3*/,
    WheaDataFormatNMIPort      = 4 /*0x4*/,
    WheaDataFormatPCIXBus      = 5 /*0x5*/,
    WheaDataFormatPCIXDevice   = 6 /*0x6*/,
    WheaDataFormatGeneric      = 7 /*0x7*/,
    WheaDataFormatMax          = 8 /*0x8*/
}WHEA_ERROR_PACKET_DATA_FORMAT, *PWHEA_ERROR_PACKET_DATA_FORMAT;

typedef enum _WHEA_ERROR_SEVERITY  // 4 elements, 0x4 bytes
{
    WheaErrSevRecoverable   = 0 /*0x0*/,
    WheaErrSevFatal         = 1 /*0x1*/,
    WheaErrSevCorrected     = 2 /*0x2*/,
    WheaErrSevInformational = 3 /*0x3*/
}WHEA_ERROR_SEVERITY, *PWHEA_ERROR_SEVERITY;

typedef enum _WHEA_ERROR_SOURCE_TYPE  // 13 elements, 0x4 bytes
{
    WheaErrSrcTypeMCE        = 0 /*0x0*/,
    WheaErrSrcTypeCMC        = 1 /*0x1*/,
    WheaErrSrcTypeCPE        = 2 /*0x2*/,
    WheaErrSrcTypeNMI        = 3 /*0x3*/,
    WheaErrSrcTypePCIe       = 4 /*0x4*/,
    WheaErrSrcTypeGeneric    = 5 /*0x5*/,
    WheaErrSrcTypeINIT       = 6 /*0x6*/,
    WheaErrSrcTypeBOOT       = 7 /*0x7*/,
    WheaErrSrcTypeSCIGeneric = 8 /*0x8*/,
    WheaErrSrcTypeIPFMCA     = 9 /*0x9*/,
    WheaErrSrcTypeIPFCMC     = 10 /*0xA*/,
    WheaErrSrcTypeIPFCPE     = 11 /*0xB*/,
    WheaErrSrcTypeMax        = 12 /*0xC*/
}WHEA_ERROR_SOURCE_TYPE, *PWHEA_ERROR_SOURCE_TYPE;

typedef enum _WHEA_ERROR_TYPE  // 7 elements, 0x4 bytes
{
    WheaErrTypeProcessor  = 0 /*0x0*/,
    WheaErrTypeMemory     = 1 /*0x1*/,
    WheaErrTypePCIExpress = 2 /*0x2*/,
    WheaErrTypeNMI        = 3 /*0x3*/,
    WheaErrTypePCIXBus    = 4 /*0x4*/,
    WheaErrTypePCIXDevice = 5 /*0x5*/,
    WheaErrTypeGeneric    = 6 /*0x6*/
}WHEA_ERROR_TYPE, *PWHEA_ERROR_TYPE;

typedef enum _WORKING_SET_TYPE  // 7 elements, 0x4 bytes
{
    WorkingSetTypeUser        = 0 /*0x0*/,
    WorkingSetTypeSession     = 1 /*0x1*/,
    WorkingSetTypeSystemTypes = 2 /*0x2*/,
    WorkingSetTypeSystemCache = 2 /*0x2*/,
    WorkingSetTypePagedPool   = 3 /*0x3*/,
    WorkingSetTypeSystemPtes  = 4 /*0x4*/,
    WorkingSetTypeMaximum     = 5 /*0x5*/
}WORKING_SET_TYPE, *PWORKING_SET_TYPE;

typedef enum _WOW64_SHARED_INFORMATION  // 13 elements, 0x4 bytes
{
    SharedNtdll32LdrInitializeThunk                  = 0 /*0x0*/,
    SharedNtdll32KiUserExceptionDispatcher           = 1 /*0x1*/,
    SharedNtdll32KiUserApcDispatcher                 = 2 /*0x2*/,
    SharedNtdll32KiUserCallbackDispatcher            = 3 /*0x3*/,
    SharedNtdll32LdrHotPatchRoutine                  = 4 /*0x4*/,
    SharedNtdll32ExpInterlockedPopEntrySListFault    = 5 /*0x5*/,
    SharedNtdll32ExpInterlockedPopEntrySListResume   = 6 /*0x6*/,
    SharedNtdll32ExpInterlockedPopEntrySListEnd      = 7 /*0x7*/,
    SharedNtdll32RtlUserThreadStart                  = 8 /*0x8*/,
    SharedNtdll32pQueryProcessDebugInformationRemote = 9 /*0x9*/,
    SharedNtdll32EtwpNotificationThread              = 10 /*0xA*/,
    SharedNtdll32BaseAddress                         = 11 /*0xB*/,
    Wow64SharedPageEntriesCount                      = 12 /*0xC*/
}WOW64_SHARED_INFORMATION, *PWOW64_SHARED_INFORMATION;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Information about structure types

typedef struct _ACCESS_REASONS;
typedef struct _ACCESS_STATE;
typedef struct _ACL;
typedef struct _ACTIVATION_CONTEXT;
typedef struct _ACTIVATION_CONTEXT_DATA;
typedef struct _ACTIVATION_CONTEXT_STACK;
typedef struct _ADAPTER_OBJECT;
typedef struct _ALIGNED_AFFINITY_SUMMARY;
typedef struct _ALPC_COMMUNICATION_INFO;
typedef struct _ALPC_COMPLETION_LIST;
typedef struct _ALPC_COMPLETION_LIST_HEADER;
typedef struct _ALPC_COMPLETION_LIST_STATE;
typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE;
typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY;
typedef struct _ALPC_DISPATCH_CONTEXT;
typedef struct _ALPC_HANDLE_ENTRY;
typedef struct _ALPC_HANDLE_TABLE;
typedef struct _ALPC_MESSAGE_ATTRIBUTES;
typedef struct _ALPC_MESSAGE_ZONE;
typedef struct _ALPC_PORT;
typedef struct _ALPC_PORT_ATTRIBUTES;
typedef struct _ALPC_PROCESS_CONTEXT;
typedef struct _AMD64_DBGKD_CONTROL_SET;
typedef struct _ARBITER_ADD_RESERVED_PARAMETERS;
typedef struct _ARBITER_ALLOCATION_STATE;
typedef struct _ARBITER_ALTERNATIVE;
typedef struct _ARBITER_BOOT_ALLOCATION_PARAMETERS;
typedef struct _ARBITER_CONFLICT_INFO;
typedef struct _ARBITER_INSTANCE;
typedef struct _ARBITER_INTERFACE;
typedef struct _ARBITER_LIST_ENTRY;
typedef struct _ARBITER_ORDERING;
typedef struct _ARBITER_ORDERING_LIST;
typedef struct _ARBITER_PARAMETERS;
typedef struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS;
typedef struct _ARBITER_QUERY_ARBITRATE_PARAMETERS;
typedef struct _ARBITER_QUERY_CONFLICT_PARAMETERS;
typedef struct _ARBITER_RETEST_ALLOCATION_PARAMETERS;
typedef struct _ARBITER_TEST_ALLOCATION_PARAMETERS;
typedef struct _ARC_DISK_INFORMATION;
typedef struct _ARM_DBGKD_CONTROL_SET;
typedef struct _ASSEMBLY_STORAGE_MAP;
typedef struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION;
typedef struct _AUX_ACCESS_DATA;
typedef struct _BATTERY_REPORTING_SCALE;
typedef struct _BITMAP_RANGE;
typedef struct _BLOB;
typedef struct _BLOB_TYPE;
typedef struct _BUS_EXTENSION_LIST;
typedef struct _CACHE_DESCRIPTOR;
typedef struct _CACHE_MANAGER_CALLBACKS;
typedef struct _CACHE_UNINITIALIZE_EVENT;
typedef struct _CACHED_CHILD_LIST;
typedef struct _CACHED_KSTACK_LIST;
typedef struct _CALL_HASH_ENTRY;
typedef struct _CALL_PERFORMANCE_DATA;
typedef struct _CALLBACK_OBJECT;
typedef struct _CELL_DATA;
typedef struct _CHILD_LIST;
typedef struct _CLIENT_ID;
typedef struct _CLIENT_ID32;
typedef struct _CLIENT_ID64;
typedef union _CLS_LSN;
typedef struct _CM_BIG_DATA;
typedef struct _CM_CACHED_VALUE_INDEX;
typedef struct _CM_CELL_REMAP_BLOCK;
typedef struct _CM_FULL_RESOURCE_DESCRIPTOR;
typedef struct _CM_INDEX_HINT_BLOCK;
typedef struct _CM_INTENT_LOCK;
typedef struct _CM_KCB_UOW;
typedef struct _CM_KEY_BODY;
typedef struct _CM_KEY_CONTROL_BLOCK;
typedef struct _CM_KEY_HASH;
typedef struct _CM_KEY_HASH_TABLE_ENTRY;
typedef struct _CM_KEY_INDEX;
typedef struct _CM_KEY_NODE;
typedef struct _CM_KEY_REFERENCE;
typedef struct _CM_KEY_SECURITY;
typedef struct _CM_KEY_SECURITY_CACHE;
typedef struct _CM_KEY_SECURITY_CACHE_ENTRY;
typedef struct _CM_KEY_VALUE;
typedef struct _CM_NAME_CONTROL_BLOCK;
typedef struct _CM_NAME_HASH;
typedef struct _CM_NOTIFY_BLOCK;
typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR;
typedef struct _CM_PARTIAL_RESOURCE_LIST;
typedef struct _CM_RESOURCE_LIST;
typedef struct _CM_RM;
typedef struct _CM_TRANS;
typedef struct _CM_VIEW_OF_FILE;
typedef struct _CM_WORKITEM;
typedef struct _CMHIVE;
typedef struct _CMP_OFFSET_ARRAY;
typedef struct _COMPRESSED_DATA_INFO;
typedef struct _CONFIGURATION_COMPONENT;
typedef struct _CONFIGURATION_COMPONENT_DATA;
typedef struct _CONTEXT;
typedef struct _CONTEXT32_UPDATE;
typedef struct _CONTROL_AREA;
typedef struct _COUNTER_READING;
typedef struct _CPU_INFO;
typedef struct _CURDIR;
typedef struct _DBGKD_ANY_CONTROL_SET;
typedef struct _DBGKD_BREAKPOINTEX;
typedef struct _DBGKD_CONTINUE;
typedef struct _DBGKD_CONTINUE2;
typedef struct _DBGKD_FILL_MEMORY;
typedef struct _DBGKD_GET_CONTEXT;
typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT32;
typedef struct _DBGKD_GET_INTERNAL_BREAKPOINT64;
typedef struct _DBGKD_GET_SET_BUS_DATA;
typedef struct _DBGKD_GET_VERSION32;
typedef struct _DBGKD_GET_VERSION64;
typedef struct _DBGKD_LOAD_SYMBOLS32;
typedef struct _DBGKD_LOAD_SYMBOLS64;
typedef struct _DBGKD_MANIPULATE_STATE32;
typedef struct _DBGKD_MANIPULATE_STATE64;
typedef struct _DBGKD_QUERY_MEMORY;
typedef struct _DBGKD_QUERY_SPECIAL_CALLS;
typedef struct _DBGKD_READ_MEMORY32;
typedef struct _DBGKD_READ_MEMORY64;
typedef struct _DBGKD_READ_WRITE_IO_EXTENDED32;
typedef struct _DBGKD_READ_WRITE_IO_EXTENDED64;
typedef struct _DBGKD_READ_WRITE_IO32;
typedef struct _DBGKD_READ_WRITE_IO64;
typedef struct _DBGKD_READ_WRITE_MSR;
typedef struct _DBGKD_RESTORE_BREAKPOINT;
typedef struct _DBGKD_SEARCH_MEMORY;
typedef struct _DBGKD_SET_CONTEXT;
typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT32;
typedef struct _DBGKD_SET_INTERNAL_BREAKPOINT64;
typedef struct _DBGKD_SET_SPECIAL_CALL32;
typedef struct _DBGKD_SET_SPECIAL_CALL64;
typedef struct _DBGKD_SWITCH_PARTITION;
typedef struct _DBGKD_WRITE_BREAKPOINT32;
typedef struct _DBGKD_WRITE_BREAKPOINT64;
typedef struct _DBGKD_WRITE_MEMORY32;
typedef struct _DBGKD_WRITE_MEMORY64;
typedef struct _DBGKM_EXCEPTION32;
typedef struct _DBGKM_EXCEPTION64;
typedef struct _DEFERRED_WRITE;
typedef struct _DEVICE_CAPABILITIES;
typedef struct _DEVICE_FLAGS;
typedef struct _DEVICE_MAP;
typedef struct _DEVICE_NODE;
typedef struct _DEVICE_OBJECT;
typedef struct _DEVICE_OBJECT_POWER_EXTENSION;
typedef struct _DEVICE_RELATIONS;
typedef struct _DEVOBJ_EXTENSION;
typedef struct _DIAGNOSTIC_BUFFER;
typedef struct _DIAGNOSTIC_CONTEXT;
typedef struct _DISPATCHER_HEADER;
typedef struct _DOCK_INTERFACE;
typedef struct _DRIVER_EXTENSION;
typedef struct _DRIVER_OBJECT;
typedef struct _DUAL;
typedef struct _DUMMY_FILE_OBJECT;
typedef struct _DUMP_INITIALIZATION_CONTEXT;
typedef struct _DUMP_STACK_CONTEXT;
typedef struct _ECP_LIST;
typedef struct _EFI_FIRMWARE_INFORMATION;
typedef struct _EJOB;
typedef struct _EPROCESS;
typedef struct _EPROCESS_QUOTA_BLOCK;
typedef struct _ERESOURCE;
typedef struct _ETHREAD;
typedef struct _ETIMER;
typedef struct _ETW_BUFFER_CONTEXT;
typedef struct _ETW_BUFFER_HANDLE;
typedef struct _ETW_GUID_ENTRY;
typedef struct _ETW_LAST_ENABLE_INFO;
typedef struct _ETW_LOGGER_HANDLE;
typedef struct _ETW_PERF_COUNTERS;
typedef struct _ETW_PROVIDER_TABLE_ENTRY;
typedef struct _ETW_REALTIME_CONSUMER;
typedef struct _ETW_REF_CLOCK;
typedef struct _ETW_REG_ENTRY;
typedef struct _ETW_REPLY_QUEUE;
typedef struct _ETW_SESSION_PERF_COUNTERS;
typedef struct _ETW_SYSTEMTIME;
typedef struct _ETW_WMITRACE_WORK;
typedef struct _EVENT_DATA_DESCRIPTOR;
typedef struct _EVENT_DESCRIPTOR;
typedef struct _EVENT_FILTER_HEADER;
typedef struct _EX_FAST_REF;
typedef struct _EX_PUSH_LOCK;
typedef struct _EX_PUSH_LOCK_CACHE_AWARE;
typedef struct _EX_PUSH_LOCK_WAIT_BLOCK;
typedef union _EX_QUEUE_WORKER_INFO;
typedef struct _EX_RUNDOWN_REF;
typedef struct _EX_WORK_QUEUE;
typedef struct _EXCEPTION_POINTERS;
typedef struct _EXCEPTION_RECORD;
typedef struct _EXCEPTION_RECORD32;
typedef struct _EXCEPTION_RECORD64;
typedef struct _EXCEPTION_REGISTRATION_RECORD;
typedef struct _FAST_IO_DISPATCH;
typedef struct _FAST_MUTEX;
typedef struct _FILE_BASIC_INFORMATION;
typedef struct _FILE_GET_QUOTA_INFORMATION;
typedef struct _FILE_NETWORK_OPEN_INFORMATION;
typedef struct _FILE_OBJECT;
typedef union _FILE_SEGMENT_ELEMENT;
typedef struct _FILE_STANDARD_INFORMATION;
typedef struct _FIRMWARE_INFORMATION_LOADER_BLOCK;
typedef struct _flags;
typedef struct _FLS_CALLBACK_INFO;
typedef struct _FREE_DISPLAY;
typedef struct _FS_FILTER_CALLBACK_DATA;
typedef struct _FS_FILTER_CALLBACKS;
typedef union _FS_FILTER_PARAMETERS;
typedef struct _FSRTL_ADVANCED_FCB_HEADER;
typedef struct _GDI_TEB_BATCH;
typedef struct _GDI_TEB_BATCH32;
typedef struct _GDI_TEB_BATCH64;
typedef struct _GENERAL_LOOKASIDE;
typedef struct _GENERAL_LOOKASIDE_POOL;
typedef struct _GENERIC_MAPPING;
typedef struct _GROUP_AFFINITY;
typedef struct _GUID;
typedef struct _HANDLE_TABLE;
typedef struct _HANDLE_TABLE_ENTRY;
typedef struct _HANDLE_TABLE_ENTRY_INFO;
typedef struct _HANDLE_TRACE_DB_ENTRY;
typedef struct _HANDLE_TRACE_DEBUG_INFO;
typedef struct _HARDWARE_PTE;
typedef struct _HBASE_BLOCK;
typedef struct _HBIN;
typedef struct _HCELL;
typedef struct _HEADLESS_LOADER_BLOCK;
typedef struct _HEAP;
typedef struct _HEAP_COUNTERS;
typedef struct _HEAP_DEBUGGING_INFORMATION;
typedef struct _HEAP_ENTRY;
typedef struct _HEAP_ENTRY_EXTRA;
typedef struct _HEAP_FREE_ENTRY;
typedef struct _HEAP_FREE_ENTRY_EXTRA;
typedef struct _HEAP_LIST_LOOKUP;
typedef struct _HEAP_LOCAL_SEGMENT_INFO;
typedef struct _HEAP_LOCK;
typedef struct _HEAP_LOOKASIDE;
typedef struct _HEAP_PSEUDO_TAG_ENTRY;
typedef struct _HEAP_SEGMENT;
typedef struct _HEAP_STOP_ON_TAG;
typedef struct _HEAP_STOP_ON_VALUES;
typedef struct _HEAP_SUBSEGMENT;
typedef struct _HEAP_TAG_ENTRY;
typedef struct _HEAP_TUNING_PARAMETERS;
typedef struct _HEAP_UCR_DESCRIPTOR;
typedef struct _HEAP_USERDATA_HEADER;
typedef struct _HEAP_VIRTUAL_ALLOC_ENTRY;
typedef struct _HHIVE;
typedef struct _HIVE_LIST_ENTRY;
typedef struct _HIVE_LOAD_FAILURE;
typedef struct _HMAP_DIRECTORY;
typedef struct _HMAP_ENTRY;
typedef struct _HMAP_TABLE;
typedef struct _I386_LOADER_BLOCK;
typedef struct _IA64_DBGKD_CONTROL_SET;
typedef struct _IA64_LOADER_BLOCK;
typedef struct _IMAGE_DATA_DIRECTORY;
typedef struct _IMAGE_DEBUG_DIRECTORY;
typedef struct _IMAGE_DOS_HEADER;
typedef struct _IMAGE_FILE_HEADER;
typedef struct _IMAGE_NT_HEADERS64;
typedef struct _IMAGE_OPTIONAL_HEADER64;
typedef struct _IMAGE_ROM_OPTIONAL_HEADER;
typedef struct _IMAGE_SECTION_HEADER;
typedef struct _IMAGE_SECURITY_CONTEXT;
typedef struct _INITIAL_PRIVILEGE_SET;
typedef struct _INTERFACE;
typedef struct _INTERLOCK_SEQ;
typedef struct _IO_CLIENT_EXTENSION;
typedef struct _IO_COMPLETION_CONTEXT;
typedef struct _IO_DRIVER_CREATE_CONTEXT;
typedef struct _IO_MINI_COMPLETION_PACKET_USER;
typedef struct _IO_PRIORITY_INFO;
typedef struct _IO_RESOURCE_DESCRIPTOR;
typedef struct _IO_RESOURCE_LIST;
typedef struct _IO_RESOURCE_REQUIREMENTS_LIST;
typedef struct _IO_SECURITY_CONTEXT;
typedef struct _IO_STACK_LOCATION;
typedef struct _IO_STATUS_BLOCK;
typedef struct _IO_STATUS_BLOCK32;
typedef struct _IO_TIMER;
typedef struct _IO_WORKITEM;
typedef struct _iobuf;
typedef struct _IOP_FILE_OBJECT_EXTENSION;
typedef struct _IOV_FORCED_PENDING_TRACE;
typedef struct _IRP;
typedef struct _JOB_ACCESS_STATE;
typedef struct _KAFFINITY_ENUMERATION_CONTEXT;
typedef struct _KAFFINITY_EX;
typedef struct _KALPC_HANDLE_DATA;
typedef struct _KALPC_MESSAGE;
typedef struct _KALPC_MESSAGE_ATTRIBUTES;
typedef struct _KALPC_REGION;
typedef struct _KALPC_RESERVE;
typedef struct _KALPC_SECTION;
typedef struct _KALPC_SECURITY_DATA;
typedef struct _KALPC_VIEW;
typedef struct _KAPC;
typedef struct _KAPC_STATE;
typedef union _KBUGCHECK_ACTIVE_STATE;
typedef struct _KDESCRIPTOR;
typedef struct _KDEVICE_QUEUE;
typedef struct _KDEVICE_QUEUE_ENTRY;
typedef struct _KDPC;
typedef struct _KDPC_DATA;
typedef struct _KENLISTMENT;
typedef struct _KENLISTMENT_HISTORY;
typedef struct _KERNEL_STACK_CONTROL;
typedef struct _KERNEL_STACK_SEGMENT;
typedef struct _KEVENT;
typedef struct _KEXCEPTION_FRAME;
typedef union _KEXECUTE_OPTIONS;
typedef struct _KGATE;
typedef union _KGDTENTRY64;
typedef struct _KGUARDED_MUTEX;
typedef union _KIDTENTRY64;
typedef struct _KINTERRUPT;
typedef struct _KLOCK_QUEUE_HANDLE;
typedef struct _KMUTANT;
typedef struct _KNODE;
typedef struct _KPCR;
typedef struct _KPRCB;
typedef struct _KPROCESS;
typedef struct _KPROCESSOR_STATE;
typedef struct _KQUEUE;
typedef struct _KREQUEST_PACKET;
typedef struct _KRESOURCEMANAGER;
typedef struct _KRESOURCEMANAGER_COMPLETION_BINDING;
typedef struct _KSEMAPHORE;
typedef struct _KSPECIAL_REGISTERS;
typedef struct _KSPIN_LOCK_QUEUE;
typedef struct _KSTACK_AREA;
typedef union _KSTACK_COUNT;
typedef struct _KSYSTEM_TIME;
typedef struct _KTHREAD;
typedef struct _KTHREAD_COUNTERS;
typedef struct _KTIMER;
typedef struct _KTIMER_TABLE;
typedef struct _KTIMER_TABLE_ENTRY;
typedef struct _KTM;
typedef struct _KTMNOTIFICATION_PACKET;
typedef struct _KTMOBJECT_NAMESPACE;
typedef struct _KTMOBJECT_NAMESPACE_LINK;
typedef struct _KTRANSACTION;
typedef struct _KTRANSACTION_HISTORY;
typedef struct _KTRAP_FRAME;
typedef struct _KTSS64;
typedef struct _KUMS_CONTEXT_HEADER;
typedef struct _KUSER_SHARED_DATA;
typedef struct _KWAIT_BLOCK;
typedef union _KWAIT_STATUS_REGISTER;
typedef union _LARGE_INTEGER;
typedef struct _LAZY_WRITER;
typedef struct _LDR_DATA_TABLE_ENTRY;
typedef struct _LIST_ENTRY;
typedef struct _LIST_ENTRY32;
typedef struct _LIST_ENTRY64;
typedef struct _LOADER_PARAMETER_BLOCK;
typedef struct _LOADER_PARAMETER_EXTENSION;
typedef struct _LOADER_PERFORMANCE_DATA;
typedef struct _LOOKASIDE_LIST_EX;
typedef struct _LPCP_MESSAGE;
typedef struct _LPCP_NONPAGED_PORT_QUEUE;
typedef struct _LPCP_PORT_OBJECT;
typedef struct _LPCP_PORT_QUEUE;
typedef struct _LUID;
typedef struct _LUID_AND_ATTRIBUTES;
typedef struct _M128A;
typedef struct _MAILSLOT_CREATE_PARAMETERS;
typedef struct _MAPPED_FILE_SEGMENT;
typedef struct _MBCB;
typedef struct _MDL;
typedef struct _MEMORY_ALLOCATION_DESCRIPTOR;
typedef struct _MI_COLOR_BASE;
typedef struct _MI_EXTRA_IMAGE_INFORMATION;
typedef struct _MI_IMAGE_SECURITY_REFERENCE;
typedef struct _MI_PAGEFILE_TRACES;
typedef struct _MI_SECTION_CREATION_GATE;
typedef struct _MI_SECTION_IMAGE_INFORMATION;
typedef struct _MI_SPECIAL_POOL;
typedef struct _MI_SPECIAL_POOL_PTE_LIST;
typedef struct _MI_SYSTEM_PTE_TYPE;
typedef struct _MI_VERIFIER_POOL_HEADER;
typedef struct _MM_AVL_TABLE;
typedef struct _MM_DRIVER_VERIFIER_DATA;
typedef struct _MM_PAGE_ACCESS_INFO;
typedef union _MM_PAGE_ACCESS_INFO_FLAGS;
typedef struct _MM_PAGE_ACCESS_INFO_HEADER;
typedef struct _MM_PAGED_POOL_INFO;
typedef struct _MM_SESSION_SPACE;
typedef struct _MM_SESSION_SPACE_FLAGS;
typedef union _MM_STORE_KEY;
typedef struct _MM_SUBSECTION_AVL_TABLE;
typedef struct _MMADDRESS_LIST;
typedef struct _MMADDRESS_NODE;
typedef struct _MMBANKED_SECTION;
typedef struct _MMEXTEND_INFO;
typedef struct _MMMOD_WRITER_MDL_ENTRY;
typedef struct _MMPAGING_FILE;
typedef struct _MMPFN;
typedef struct _MMPFNENTRY;
typedef struct _MMPFNLIST;
typedef struct _MMPTE;
typedef struct _MMPTE_HARDWARE;
typedef struct _MMPTE_LIST;
typedef struct _MMPTE_PROTOTYPE;
typedef struct _MMPTE_SOFTWARE;
typedef struct _MMPTE_SUBSECTION;
typedef struct _MMPTE_TIMESTAMP;
typedef struct _MMPTE_TRANSITION;
typedef struct _MMSECTION_FLAGS;
typedef struct _MMSECURE_FLAGS;
typedef struct _MMSESSION;
typedef struct _MMSUBSECTION_FLAGS;
typedef struct _MMSUBSECTION_NODE;
typedef struct _MMSUPPORT;
typedef struct _MMSUPPORT_FLAGS;
typedef struct _MMVAD;
typedef struct _MMVAD_FLAGS;
typedef struct _MMVAD_FLAGS2;
typedef struct _MMVAD_FLAGS3;
typedef struct _MMVAD_LONG;
typedef struct _MMVAD_SHORT;
typedef struct _MMVIEW;
typedef struct _MMWSL;
typedef struct _MMWSLE;
typedef struct _MMWSLE_FREE_ENTRY;
typedef struct _MMWSLE_HASH;
typedef struct _MMWSLE_NONDIRECT_HASH;
typedef struct _MMWSLENTRY;
typedef struct _MSUBSECTION;
typedef struct _NAMED_PIPE_CREATE_PARAMETERS;
typedef struct _NBQUEUE_BLOCK;
typedef struct _NETWORK_LOADER_BLOCK;
typedef struct _NLS_DATA_BLOCK;
typedef struct _NPAGED_LOOKASIDE_LIST;
typedef struct _NT_TIB;
typedef struct _NT_TIB32;
typedef struct _NT_TIB64;
typedef struct _OB_DUPLICATE_OBJECT_STATE;
typedef struct _OBJECT_ATTRIBUTES;
typedef struct _OBJECT_CREATE_INFORMATION;
typedef struct _OBJECT_DIRECTORY;
typedef struct _OBJECT_DIRECTORY_ENTRY;
typedef struct _OBJECT_DUMP_CONTROL;
typedef struct _OBJECT_HANDLE_COUNT_DATABASE;
typedef struct _OBJECT_HANDLE_COUNT_ENTRY;
typedef struct _OBJECT_HANDLE_INFORMATION;
typedef struct _OBJECT_HEADER;
typedef struct _OBJECT_HEADER_CREATOR_INFO;
typedef struct _OBJECT_HEADER_HANDLE_INFO;
typedef struct _OBJECT_HEADER_NAME_INFO;
typedef struct _OBJECT_HEADER_PROCESS_INFO;
typedef struct _OBJECT_HEADER_QUOTA_INFO;
typedef struct _OBJECT_NAME_INFORMATION;
typedef struct _OBJECT_REF_INFO;
typedef struct _OBJECT_REF_STACK_INFO;
typedef struct _OBJECT_REF_TRACE;
typedef struct _OBJECT_SYMBOLIC_LINK;
typedef struct _OBJECT_TYPE;
typedef struct _OBJECT_TYPE_INITIALIZER;
typedef struct _OBP_LOOKUP_CONTEXT;
typedef struct _OPEN_PACKET;
typedef struct _OWNER_ENTRY;
typedef struct _PAGED_LOOKASIDE_LIST;
typedef struct _PAGEFAULT_HISTORY;
typedef struct _PCAT_FIRMWARE_INFORMATION;
typedef struct _PCW_BUFFER;
typedef union _PCW_CALLBACK_INFORMATION;
typedef struct _PCW_COUNTER_DESCRIPTOR;
typedef struct _PCW_COUNTER_INFORMATION;
typedef struct _PCW_DATA;
typedef struct _PCW_INSTANCE;
typedef struct _PCW_MASK_INFORMATION;
typedef struct _PCW_PROCESSOR_INFO;
typedef struct _PCW_REGISTRATION;
typedef struct _PCW_REGISTRATION_INFORMATION;
typedef struct _PEB;
typedef struct _PEB_LDR_DATA;
typedef struct _PEB32;
typedef struct _PEB64;
typedef struct _PENDING_RELATIONS_LIST_ENTRY;
typedef struct _PERFINFO_GROUPMASK;
typedef struct _PERFINFO_TRACE_HEADER;
typedef struct _PF_KERNEL_GLOBALS;
typedef struct _PHYSICAL_MEMORY_DESCRIPTOR;
typedef struct _PHYSICAL_MEMORY_RUN;
typedef struct _PI_BUS_EXTENSION;
typedef struct _PI_RESOURCE_ARBITER_ENTRY;
typedef struct _PLUGPLAY_EVENT_BLOCK;
typedef struct _PNP_ASSIGN_RESOURCES_CONTEXT;
typedef struct _PNP_DEVICE_ACTION_ENTRY;
typedef struct _PNP_DEVICE_COMPLETION_QUEUE;
typedef struct _PNP_DEVICE_COMPLETION_REQUEST;
typedef struct _PNP_DEVICE_EVENT_ENTRY;
typedef struct _PNP_DEVICE_EVENT_LIST;
typedef struct _PNP_RESOURCE_REQUEST;
typedef struct _PO_DEVICE_NOTIFY;
typedef struct _PO_DEVICE_NOTIFY_ORDER;
typedef struct _PO_DIAG_STACK_RECORD;
typedef struct _PO_HIBER_PERF;
typedef struct _PO_IRP_MANAGER;
typedef struct _PO_IRP_QUEUE;
typedef struct _PO_MEMORY_IMAGE;
typedef struct _PO_NOTIFY_ORDER_LEVEL;
typedef struct _POOL_BLOCK_HEAD;
typedef struct _POOL_DESCRIPTOR;
typedef struct _POOL_HACKER;
typedef struct _POOL_HEADER;
typedef struct _POOL_TRACKER_BIG_PAGES;
typedef struct _POOL_TRACKER_TABLE;
typedef struct _POP_ACTION_TRIGGER;
typedef struct _POP_DEVICE_SYS_STATE;
typedef struct _POP_HIBER_CONTEXT;
typedef struct _POP_POWER_ACTION;
typedef struct _POP_SHUTDOWN_BUG_CHECK;
typedef struct _POP_SYSTEM_IDLE;
typedef struct _POP_THERMAL_ZONE;
typedef struct _POP_THERMAL_ZONE_METRICS;
typedef struct _POP_TRIGGER_WAIT;
typedef struct _PORT_MESSAGE;
typedef struct _PORT_MESSAGE32;
typedef struct _POWER_ACTION_POLICY;
typedef struct _POWER_SEQUENCE;
typedef union _POWER_STATE;
typedef struct _PP_LOOKASIDE_LIST;
typedef struct _PPC_DBGKD_CONTROL_SET;
typedef struct _PPM_FFH_THROTTLE_STATE_INFO;
typedef struct _PPM_IDLE_STATE;
typedef struct _PPM_IDLE_STATES;
typedef struct _PPM_PERF_STATE;
typedef struct _PPM_PERF_STATES;
typedef struct _PRIVATE_CACHE_MAP;
typedef struct _PRIVATE_CACHE_MAP_FLAGS;
typedef struct _PRIVILEGE_SET;
typedef struct _PROC_HISTORY_ENTRY;
typedef struct _PROC_IDLE_ACCOUNTING;
typedef struct _PROC_IDLE_SNAP;
typedef struct _PROC_IDLE_STATE_ACCOUNTING;
typedef struct _PROC_IDLE_STATE_BUCKET;
typedef struct _PROC_PERF_CONSTRAINT;
typedef struct _PROC_PERF_DOMAIN;
typedef struct _PROC_PERF_LOAD;
typedef struct _PROCESSOR_IDLESTATE_INFO;
typedef struct _PROCESSOR_IDLESTATE_POLICY;
typedef struct _PROCESSOR_NUMBER;
typedef struct _PROCESSOR_PERFSTATE_POLICY;
typedef struct _PROCESSOR_POWER_STATE;
typedef struct _PROFILE_PARAMETER_BLOCK;
typedef union _PS_CLIENT_SECURITY_CONTEXT;
typedef struct _PS_CPU_QUOTA_BLOCK;
typedef struct _PS_PER_CPU_QUOTA_CACHE_AWARE;
typedef union _PSP_CPU_QUOTA_APC;
typedef union _PSP_CPU_SHARE_CAPTURED_WEIGHT_DATA;
typedef struct _PTE_TRACKER;
typedef struct _QUAD;
typedef struct _RELATION_LIST;
typedef struct _RELATION_LIST_ENTRY;
typedef struct _RELATIVE_SYMLINK_INFO;
typedef struct _REMOTE_PORT_VIEW;
typedef struct _REQUEST_MAILBOX;
typedef struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME;
typedef struct _RTL_ATOM_TABLE;
typedef struct _RTL_ATOM_TABLE_ENTRY;
typedef struct _RTL_AVL_TABLE;
typedef struct _RTL_BALANCED_LINKS;
typedef struct _RTL_BITMAP;
typedef struct _RTL_CRITICAL_SECTION;
typedef struct _RTL_CRITICAL_SECTION_DEBUG;
typedef struct _RTL_DRIVE_LETTER_CURDIR;
typedef struct _RTL_DYNAMIC_HASH_TABLE;
typedef struct _RTL_DYNAMIC_HASH_TABLE_CONTEXT;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENTRY;
typedef struct _RTL_DYNAMIC_HASH_TABLE_ENUMERATOR;
typedef struct _RTL_HANDLE_TABLE;
typedef struct _RTL_HANDLE_TABLE_ENTRY;
typedef struct _RTL_RANGE;
typedef struct _RTL_RANGE_LIST;
typedef struct _RTL_SRWLOCK;
typedef struct _RTL_UMS_CONTEXT;
typedef struct _RTL_USER_PROCESS_PARAMETERS;
typedef struct _RTLP_RANGE_LIST_ENTRY;
typedef struct _SCSI_REQUEST_BLOCK;
typedef struct _SE_AUDIT_PROCESS_CREATION_INFO;
typedef struct _SECTION_IMAGE_INFORMATION;
typedef struct _SECTION_OBJECT;
typedef struct _SECTION_OBJECT_POINTERS;
typedef struct _SECURITY_CLIENT_CONTEXT;
typedef struct _SECURITY_DESCRIPTOR;
typedef struct _SECURITY_DESCRIPTOR_RELATIVE;
typedef struct _SECURITY_QUALITY_OF_SERVICE;
typedef struct _SECURITY_SUBJECT_CONTEXT;
typedef struct _SEGMENT;
typedef struct _SEGMENT_FLAGS;
typedef struct _SEGMENT_OBJECT;
typedef struct _SEP_AUDIT_POLICY;
typedef struct _SEP_LOGON_SESSION_REFERENCES;
typedef struct _SEP_TOKEN_PRIVILEGES;
typedef struct _SHARED_CACHE_MAP;
typedef struct _SHARED_CACHE_MAP_LIST_CURSOR;
typedef struct _SID;
typedef struct _SID_AND_ATTRIBUTES;
typedef struct _SID_AND_ATTRIBUTES_HASH;
typedef struct _SID_IDENTIFIER_AUTHORITY;
typedef struct _SINGLE_LIST_ENTRY;
typedef struct _SINGLE_LIST_ENTRY32;
typedef struct _SLIST_ENTRY;
typedef union _SLIST_HEADER;
typedef struct _SMBIOS_TABLE_HEADER;
typedef struct _STACK_TABLE;
typedef struct _STRING;
typedef struct _STRING32;
typedef struct _STRING64;
typedef struct _SUBSECTION;
typedef struct _SYSPTES_HEADER;
typedef struct _SYSTEM_POWER_CAPABILITIES;
typedef struct _SYSTEM_POWER_LEVEL;
typedef struct _SYSTEM_POWER_POLICY;
typedef struct _SYSTEM_POWER_STATE_CONTEXT;
typedef struct _SYSTEM_TRACE_HEADER;
typedef struct _TEB;
typedef struct _TEB_ACTIVE_FRAME;
typedef struct _TEB_ACTIVE_FRAME_CONTEXT;
typedef struct _TEB32;
typedef struct _TEB64;
typedef struct _TERMINATION_PORT;
typedef struct _THERMAL_INFORMATION;
typedef struct _THERMAL_INFORMATION_EX;
typedef struct _THREAD_PERFORMANCE_DATA;
typedef struct _TIME_FIELDS;
typedef struct _TOKEN;
typedef struct _TOKEN_AUDIT_POLICY;
typedef struct _TOKEN_CONTROL;
typedef struct _TOKEN_SOURCE;
typedef struct _TP_CALLBACK_ENVIRON_V3;
typedef struct _TP_CALLBACK_INSTANCE;
typedef struct _TP_CLEANUP_GROUP;
typedef struct _TP_DIRECT;
typedef struct _TP_NBQ_GUARD;
typedef struct _TP_POOL;
typedef struct _TP_TASK;
typedef struct _TP_TASK_CALLBACKS;
typedef struct _TPM_BOOT_ENTROPY_LDR_RESULT;
typedef struct _TRACE_ENABLE_CONTEXT;
typedef struct _TRACE_ENABLE_CONTEXT_EX;
typedef struct _TRACE_ENABLE_INFO;
typedef struct _TXN_PARAMETER_BLOCK;
typedef union _ULARGE_INTEGER;
typedef struct _UMS_CONTROL_BLOCK;
typedef struct _UNEXPECTED_INTERRUPT;
typedef struct _UNICODE_STRING;
typedef struct _VACB;
typedef struct _VACB_ARRAY_HEADER;
typedef struct _VACB_LEVEL_ALLOCATION_LIST;
typedef struct _VACB_LEVEL_REFERENCE;
typedef struct _VERIFIER_SHARED_EXPORT_THUNK;
typedef struct _VF_ADDRESS_RANGE;
typedef struct _VF_AVL_TABLE;
typedef struct _VF_AVL_TREE;
typedef struct _VF_AVL_TREE_NODE;
typedef struct _VF_KE_CRITICAL_REGION_TRACE;
typedef struct _VF_POOL_TRACE;
typedef struct _VF_SUSPECT_DRIVER_ENTRY;
typedef struct _VF_TARGET_ALL_SHARED_EXPORT_THUNKS;
typedef struct _VF_TARGET_DRIVER;
typedef struct _VF_TARGET_VERIFIED_DRIVER_DATA;
typedef struct _VF_TRACKER;
typedef struct _VF_TRACKER_STAMP;
typedef struct _VF_WATCHDOG_IRP;
typedef struct _VI_DEADLOCK_GLOBALS;
typedef struct _VI_DEADLOCK_NODE;
typedef struct _VI_DEADLOCK_RESOURCE;
typedef struct _VI_DEADLOCK_THREAD;
typedef struct _VI_FAULT_TRACE;
typedef struct _VI_POOL_ENTRY;
typedef struct _VI_POOL_ENTRY_INUSE;
typedef struct _VI_POOL_PAGE_HEADER;
typedef struct _VI_TRACK_IRQL;
typedef struct _VI_VERIFIER_ISSUE;
typedef struct _VIRTUAL_EFI_RUNTIME_SERVICES;
typedef struct _VOLUME_CACHE_MAP;
typedef struct _VPB;
typedef struct _WAIT_CONTEXT_BLOCK;
typedef union _WHEA_ERROR_PACKET_FLAGS;
typedef struct _WHEA_ERROR_PACKET_V2;
typedef struct _WHEA_ERROR_RECORD;
typedef struct _WHEA_ERROR_RECORD_HEADER;
typedef union _WHEA_ERROR_RECORD_HEADER_FLAGS;
typedef union _WHEA_ERROR_RECORD_HEADER_VALIDBITS;
typedef struct _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_FLAGS;
typedef union _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR_VALIDBITS;
typedef union _WHEA_ERROR_STATUS;
typedef struct _WHEA_MEMORY_ERROR_SECTION;
typedef union _WHEA_MEMORY_ERROR_SECTION_VALIDBITS;
typedef union _WHEA_PERSISTENCE_INFO;
typedef union _WHEA_REVISION;
typedef union _WHEA_TIMESTAMP;
typedef struct _WMI_BUFFER_HEADER;
typedef struct _WMI_LOGGER_CONTEXT;
typedef struct _WMI_TRACE_PACKET;
typedef struct _WORK_QUEUE_ENTRY;
typedef struct _WORK_QUEUE_ITEM;
typedef struct _X86_DBGKD_CONTROL_SET;
typedef struct _XSAVE_AREA;
typedef struct _XSAVE_AREA_HEADER;
typedef struct _XSAVE_FORMAT;
typedef struct _XSTATE_CONFIGURATION;
typedef struct _XSTATE_CONTEXT;
typedef struct _XSTATE_FEATURE;
typedef struct _XSTATE_SAVE;

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Function types

typedef VOID (NEAR CDECL FUNCT_00A3_00A2_CleanupGroupCancelCallback_DeRefSecurityDescriptor_PostRoutine) (VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_00AA_FinalizationCallback) (struct _TP_CALLBACK_INSTANCE*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_00C7_ExecuteCallback) (struct _TP_CALLBACK_INSTANCE*, struct _TP_TASK*);
typedef VOID (NEAR CDECL FUNCT_00A3_00CC_Unposted) (struct _TP_TASK*, struct _TP_POOL*);
typedef VOID (NEAR CDECL FUNCT_00A3_00DF_Callback) (struct _TP_CALLBACK_INSTANCE*, struct _TP_DIRECT*, VOID*, struct _IO_STATUS_BLOCK*);
typedef enum _EXCEPTION_DISPOSITION (NEAR CDECL FUNCT_0160_015F_Handler) (struct _EXCEPTION_RECORD*, VOID*, struct _CONTEXT*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_0284_PostProcessInitRoutine_DispatchAddress_FinishRoutine) ();
typedef VOID (NEAR CDECL FUNCT_00A3_0583_DeferredRoutine) (struct _KDPC*, VOID*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_0661_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_0658_KernelRoutine) (struct _KAPC*, FUNCT_00A3_0661_NormalRoutine**, VOID**, VOID**, VOID**);
typedef VOID (NEAR CDECL FUNCT_00A3_0661_NormalRoutine) (VOID*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_0666_RundownRoutine) (struct _KAPC*);
typedef VOID* (NEAR CDECL FUNCT_00A6_0715_AllocateEx) (enum _POOL_TYPE, UINT64, ULONG32, struct _LOOKASIDE_LIST_EX*);
typedef VOID* (NEAR CDECL FUNCT_00A6_071F_Allocate) (enum _POOL_TYPE, UINT64, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_0724_FreeEx) (VOID*, struct _LOOKASIDE_LIST_EX*);
typedef VOID (NEAR CDECL FUNCT_00A3_0728_Free_IdleHandler_InterfaceReference_InterfaceDereference_DeleteProcedure_WorkerRoutine_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead) (VOID*);
typedef LONG32 (NEAR CDECL FUNCT_005B_079E_IdleCheck_DestroyProcedure) (VOID*);
typedef UINT8 (NEAR CDECL FUNCT_0065_07E1_FeedbackHandler) (ULONG32*, UINT64, UINT8);
typedef VOID (NEAR CDECL FUNCT_00A3_07E6_GetFFHThrottleState) (UINT64*);
typedef VOID (NEAR CDECL FUNCT_00A3_07EA_BoostPolicyHandler_StallRoutine) (ULONG32);
typedef ULONG32 (NEAR CDECL FUNCT_0009_07ED_PerfSelectionHandler) (UINT64, ULONG32, ULONG32, ULONG32, ULONG32, ULONG32*, ULONG32*);
typedef VOID (NEAR CDECL FUNCT_00A3_07F6_PerfHandler) (UINT64, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_0827_WorkerRoutine) (VOID*, VOID*, VOID*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_005B_093F_AddDevice) (struct _DRIVER_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0957_PreAcquireForSectionSynchronization_PreReleaseForSectionSynchronization_PreAcquireForCcFlush_PreReleaseForCcFlush_PreAcquireForModifiedPageWriter_PreReleaseForModifiedPageWriter) (struct _FS_FILTER_CALLBACK_DATA*, VOID**);
typedef VOID (NEAR CDECL FUNCT_00A3_09D0_PostAcquireForSectionSynchronization_PostReleaseForSectionSynchronization_PostAcquireForCcFlush_PostReleaseForCcFlush_PostAcquireForModifiedPageWriter_PostReleaseForModifiedPageWriter) (struct _FS_FILTER_CALLBACK_DATA*, LONG32, VOID*);
typedef UINT8 (NEAR CDECL FUNCT_0065_09F4_FastIoCheckIfPossible) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_09FE_FastIoRead_FastIoWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, UINT8, ULONG32, VOID*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0A08_FastIoQueryBasicInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_BASIC_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0A16_FastIoQueryStandardInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_STANDARD_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0A24_FastIoLock) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, UINT8, UINT8, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0BC6_FastIoUnlockSingle) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, union _LARGE_INTEGER*, struct _EPROCESS*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0BCF_FastIoUnlockAll) (struct _FILE_OBJECT*, struct _EPROCESS*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0BD5_FastIoUnlockAllByKey) (struct _FILE_OBJECT*, VOID*, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0BDC_FastIoDeviceControl) (struct _FILE_OBJECT*, UINT8, VOID*, ULONG32, VOID*, ULONG32, ULONG32, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR CDECL FUNCT_00A3_0BE7_AcquireFileForNtCreateSection_ReleaseFileForNtCreateSection) (struct _FILE_OBJECT*);
typedef VOID (NEAR CDECL FUNCT_00A3_0BEA_FastIoDetachDevice) (struct _DEVICE_OBJECT*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0BEE_FastIoQueryNetworkOpenInfo) (struct _FILE_OBJECT*, UINT8, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0BFE_AcquireForModWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _ERESOURCE**, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0C04_MdlRead_PrepareMdlWrite) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0C18_MdlReadComplete_MdlReadCompleteCompressed) (struct _FILE_OBJECT*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0C1D_MdlWriteComplete_MdlWriteCompleteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, struct _MDL*, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0C23_FastIoReadCompressed_FastIoWriteCompressed) (struct _FILE_OBJECT*, union _LARGE_INTEGER*, ULONG32, ULONG32, VOID*, struct _MDL**, struct _IO_STATUS_BLOCK*, struct _COMPRESSED_DATA_INFO*, ULONG32, struct _DEVICE_OBJECT*);
typedef UINT8 (NEAR CDECL FUNCT_0065_0C38_FastIoQueryOpen) (struct _IRP*, struct _FILE_NETWORK_OPEN_INFORMATION*, struct _DEVICE_OBJECT*);
typedef VOID (NEAR CDECL FUNCT_00A3_0C5F_UserApcRoutine) (VOID*, struct _IO_STATUS_BLOCK*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_0C64_DriverStartIo_CancelRoutine) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0EE6_CompletionRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0EEB_ReleaseForModWrite) (struct _FILE_OBJECT*, struct _ERESOURCE*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0EF0_AcquireForCcFlush_ReleaseForCcFlush) (struct _FILE_OBJECT*, struct _DEVICE_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0EF4_DriverInit) (struct _DRIVER_OBJECT*, struct _UNICODE_STRING*);
typedef VOID (NEAR CDECL FUNCT_00A3_0EF8_DriverUnload) (struct _DRIVER_OBJECT*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0EFC_MajorFunction) (struct _DEVICE_OBJECT*, struct _IRP*);
typedef VOID (NEAR CDECL FUNCT_00A3_0F06_TimerRoutine) (struct _DEVICE_OBJECT*, VOID*);
typedef enum _IO_ALLOCATION_ACTION (NEAR CDECL FUNCT_0F16_0F15_DeviceRoutine) (struct _DEVICE_OBJECT*, struct _IRP*, VOID*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_0FB1_DumpProcedure) (VOID*, struct _OBJECT_DUMP_CONTROL*);
typedef LONG32 (NEAR CDECL FUNCT_005B_0FB9_OpenProcedure) (enum _OB_OPEN_REASON, CHAR, struct _EPROCESS*, VOID*, ULONG32*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_0FC7_CloseProcedure) (struct _EPROCESS*, VOID*, UINT64, UINT64);
typedef LONG32 (NEAR CDECL FUNCT_005B_0FCD_ParseProcedure) (VOID*, VOID*, struct _ACCESS_STATE*, CHAR, ULONG32, struct _UNICODE_STRING*, struct _UNICODE_STRING*, VOID*, struct _SECURITY_QUALITY_OF_SERVICE*, VOID**);
typedef LONG32 (NEAR CDECL FUNCT_005B_0FD9_SecurityProcedure) (VOID*, enum _SECURITY_OPERATION_CODE, ULONG32*, VOID*, ULONG32*, VOID**, enum _POOL_TYPE, struct _GENERIC_MAPPING*, CHAR);
typedef LONG32 (NEAR CDECL FUNCT_005B_0FEA_QueryNameProcedure) (VOID*, UINT8, struct _OBJECT_NAME_INFORMATION*, ULONG32, ULONG32*, CHAR);
typedef UINT8 (NEAR CDECL FUNCT_0065_0FF2_OkayToCloseProcedure) (struct _EPROCESS*, VOID*, VOID*, CHAR);
typedef struct _CELL_DATA* (NEAR CDECL FUNCT_1420_141F_GetCellRoutine) (struct _HHIVE*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_146E_ReleaseCellRoutine) (struct _HHIVE*, ULONG32);
typedef VOID* (NEAR CDECL FUNCT_00A6_1470_Allocate) (ULONG32, UINT8, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_1475_Free) (VOID*, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_0065_1479_FileSetSize) (struct _HHIVE*, ULONG32, ULONG32, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_0065_147F_FileWrite) (struct _HHIVE*, ULONG32, struct _CMP_OFFSET_ARRAY*, ULONG32, ULONG32*);
typedef UINT8 (NEAR CDECL FUNCT_0065_148B_FileRead) (struct _HHIVE*, ULONG32, ULONG32*, VOID*, ULONG32);
typedef UINT8 (NEAR CDECL FUNCT_0065_1492_FileFlush) (struct _HHIVE*, ULONG32, union _LARGE_INTEGER*, ULONG32);
typedef LONG32 (NEAR CDECL FUNCT_005B_15F7_NotificationRoutine) (struct _KENLISTMENT*, VOID*, VOID*, ULONG32, union _LARGE_INTEGER*, ULONG32, VOID*);
typedef enum _RTL_GENERIC_COMPARE_RESULTS (NEAR CDECL FUNCT_163D_163C_CompareRoutine) (struct _RTL_AVL_TABLE*, VOID*, VOID*);
typedef VOID* (NEAR CDECL FUNCT_00A6_1646_AllocateRoutine) (struct _RTL_AVL_TABLE*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_164A_FreeRoutine) (struct _RTL_AVL_TABLE*, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_005B_177F_Callback) (enum _PCW_CALLBACK_TYPE, union _PCW_CALLBACK_INFORMATION*, VOID*);
typedef ULONG32 (NEAR CDECL FUNCT_0009_18C6_ProfileDepartureSetMode) (VOID*, enum _PROFILE_DEPARTURE_STYLE);
typedef ULONG32 (NEAR CDECL FUNCT_0009_18CF_ProfileDepartureUpdate) (VOID*);
typedef UINT8 (NEAR CDECL FUNCT_0065_1A77_AcquireForLazyWrite_AcquireForReadAhead) (VOID*, UINT8);
typedef VOID (NEAR CDECL FUNCT_00A3_1A7B_FlushToLsnRoutine) (VOID*, union _LARGE_INTEGER);
typedef LONG32 (NEAR CDECL FUNCT_005B_1B29_CommitRoutine) (VOID*, VOID**, UINT64*);
typedef VOID (NEAR CDECL FUNCT_00A3_1C59_MiniPacketCallback) (struct _IO_MINI_COMPLETION_PACKET_USER*, VOID*);
typedef INT64 (NEAR CDECL FUNCT_0075_1E6E_GetCpuClock) ();
typedef VOID (NEAR CDECL FUNCT_00A3_1E93_BufferCallback) (struct _WMI_BUFFER_HEADER*, VOID*);
typedef VOID (NEAR CDECL FUNCT_00A3_2054_BankedRoutine) (ULONG32, ULONG32, VOID*);
typedef UINT8 (NEAR CDECL FUNCT_0065_20AD_ServiceRoutine) (struct _KINTERRUPT*, VOID*);
typedef UINT8 (NEAR CDECL FUNCT_0065_20B2_MessageServiceRoutine) (struct _KINTERRUPT*, VOID*, ULONG32);
typedef VOID (NEAR CDECL FUNCT_00A3_210B_Routine) (VOID*, VOID*, struct _IO_WORKITEM*);
typedef LONG32 (NEAR CDECL FUNCT_005B_237C_ArbiterHandler) (VOID*, enum _ARBITER_ACTION, struct _ARBITER_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_005B_23DE_UnpackRequirement) (struct _IO_RESOURCE_DESCRIPTOR*, UINT64*, UINT64*, UINT64*, UINT64*);
typedef LONG32 (NEAR CDECL FUNCT_005B_23E5_PackResource) (struct _IO_RESOURCE_DESCRIPTOR*, UINT64, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*);
typedef LONG32 (NEAR CDECL FUNCT_005B_23EA_UnpackResource) (struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*, UINT64*, UINT64*);
typedef LONG32 (NEAR CDECL FUNCT_005B_23EF_ScoreRequirement) (struct _IO_RESOURCE_DESCRIPTOR*);
typedef LONG32 (NEAR CDECL FUNCT_005B_23F2_TestAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_TEST_ALLOCATION_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_005B_23F8_RetestAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_RETEST_ALLOCATION_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_005B_23FD_CommitAllocation_RollbackAllocation) (struct _ARBITER_INSTANCE*);
typedef LONG32 (NEAR CDECL FUNCT_005B_2400_BootAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_BOOT_ALLOCATION_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_005B_2405_QueryArbitrate) (struct _ARBITER_INSTANCE*, struct _ARBITER_QUERY_ARBITRATE_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_005B_240A_QueryConflict) (struct _ARBITER_INSTANCE*, struct _ARBITER_QUERY_CONFLICT_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_005B_240F_AddReserved) (struct _ARBITER_INSTANCE*, struct _ARBITER_ADD_RESERVED_PARAMETERS*);
typedef LONG32 (NEAR CDECL FUNCT_005B_2414_StartArbiter) (struct _ARBITER_INSTANCE*, struct _CM_RESOURCE_LIST*);
typedef LONG32 (NEAR CDECL FUNCT_005B_2418_PreprocessEntry_AllocateEntry) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef UINT8 (NEAR CDECL FUNCT_0065_241C_GetNextAllocationRange_FindSuitableRange_OverrideConflict) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef VOID (NEAR CDECL FUNCT_00A3_241E_AddAllocation_BacktrackAllocation) (struct _ARBITER_INSTANCE*, struct _ARBITER_ALLOCATION_STATE*);
typedef LONG32 (NEAR CDECL FUNCT_005B_2420_InitializeRangeList) (struct _ARBITER_INSTANCE*, ULONG32, struct _CM_PARTIAL_RESOURCE_DESCRIPTOR*, struct _RTL_RANGE_LIST*);
typedef UINT8 (NEAR CDECL FUNCT_0065_2426_ConflictCallback) (VOID*, struct _RTL_RANGE*);
typedef LONG32 (NEAR CDECL FUNCT_005B_2616_HeapLeakEnumerationRoutine) (LONG32, VOID*, VOID*, UINT64, ULONG32, VOID*);
typedef LONG32 (NEAR CDECL FUNCT_005B_2669_PStateHandler_TStateHandler) (UINT64, UINT64, UINT64);
typedef UINT8 (NEAR CDECL FUNCT_0065_2739_OpenRoutine) (union _LARGE_INTEGER);
typedef LONG32 (NEAR CDECL FUNCT_005B_273C_WriteRoutine) (union _LARGE_INTEGER*, struct _MDL*);
typedef LONG32 (NEAR CDECL FUNCT_005B_2742_WritePendingRoutine) (LONG32, union _LARGE_INTEGER*, struct _MDL*, VOID*);

//------------------------------------------------------------------------
//------------------------------------------------------------------------
// Declaration of Structure types

          typedef struct _ACCESS_REASONS // 1 elements, 0x80 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      Data[32];                                        
          }ACCESS_REASONS, *PACCESS_REASONS;                                   
                                                                            
          typedef struct _LUID       // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      LowPart;                                    
/*0x004*/     LONG32       HighPart;                                   
          }LUID, *PLUID;                                               
                                                                       
          typedef struct _SECURITY_SUBJECT_CONTEXT                   // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                             
/*0x000*/     VOID*        ClientToken;                                                                 
/*0x008*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                    
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                             
/*0x010*/     VOID*        PrimaryToken;                                                                
/*0x018*/     VOID*        ProcessAuditId;                                                              
          }SECURITY_SUBJECT_CONTEXT, *PSECURITY_SUBJECT_CONTEXT;                                        
                                                                                                        
          typedef struct _LUID_AND_ATTRIBUTES // 2 elements, 0xC bytes (sizeof) 
          {                                                                     
/*0x000*/     struct _LUID Luid;              // 2 elements, 0x8 bytes (sizeof) 
/*0x008*/     ULONG32      Attributes;                                          
          }LUID_AND_ATTRIBUTES, *PLUID_AND_ATTRIBUTES;                                  
                                                                                
          typedef struct _INITIAL_PRIVILEGE_SET         // 3 elements, 0x2C bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[3];                                    
          }INITIAL_PRIVILEGE_SET, *PINITIAL_PRIVILEGE_SET;                                   
                                                                                           
          typedef struct _PRIVILEGE_SET                 // 3 elements, 0x14 bytes (sizeof) 
          {                                                                                
/*0x000*/     ULONG32      PrivilegeCount;                                                 
/*0x004*/     ULONG32      Control;                                                        
/*0x008*/     struct _LUID_AND_ATTRIBUTES Privilege[1];                                    
          }PRIVILEGE_SET, *PPRIVILEGE_SET;                                                 
                                                                                           
          typedef struct _UNICODE_STRING    // 3 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT16       Length;                                             
/*0x002*/     UINT16       MaximumLength;                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     UINT16*      Buffer;                                             
          }UNICODE_STRING, *PUNICODE_STRING;                                   
                                                                               
          typedef struct _ACCESS_STATE                                 // 16 elements, 0xA0 bytes (sizeof) 
          {                                                                                                
/*0x000*/     struct _LUID OperationID;                                // 2 elements, 0x8 bytes (sizeof)   
/*0x008*/     UINT8        SecurityEvaluated;                                                              
/*0x009*/     UINT8        GenerateAudit;                                                                  
/*0x00A*/     UINT8        GenerateOnClose;                                                                
/*0x00B*/     UINT8        PrivilegesAllocated;                                                            
/*0x00C*/     ULONG32      Flags;                                                                          
/*0x010*/     ULONG32      RemainingDesiredAccess;                                                         
/*0x014*/     ULONG32      PreviouslyGrantedAccess;                                                        
/*0x018*/     ULONG32      OriginalDesiredAccess;                                                          
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                                
/*0x020*/     struct _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext; // 4 elements, 0x20 bytes (sizeof)  
/*0x040*/     VOID*        SecurityDescriptor;                                                             
/*0x048*/     VOID*        AuxData;                                                                        
              union                                                    // 2 elements, 0x2C bytes (sizeof)  
              {                                                                                            
/*0x050*/         struct _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;   // 3 elements, 0x2C bytes (sizeof)  
/*0x050*/         struct _PRIVILEGE_SET PrivilegeSet;                  // 3 elements, 0x14 bytes (sizeof)  
              }Privileges;                                                                                 
/*0x07C*/     UINT8        AuditPrivileges;                                                                
/*0x07D*/     UINT8        _PADDING1_[0x3];                                                                
/*0x080*/     struct _UNICODE_STRING ObjectName;                       // 3 elements, 0x10 bytes (sizeof)  
/*0x090*/     struct _UNICODE_STRING ObjectTypeName;                   // 3 elements, 0x10 bytes (sizeof)  
          }ACCESS_STATE, *PACCESS_STATE;                                                                   
                                                                                                           
          typedef struct _ACL           // 5 elements, 0x8 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT8        AclRevision;                                   
/*0x001*/     UINT8        Sbz1;                                          
/*0x002*/     UINT16       AclSize;                                       
/*0x004*/     UINT16       AceCount;                                      
/*0x006*/     UINT16       Sbz2;                                          
          }ACL, *PACL;                                                    
                                                                          
typedef struct _ACTIVATION_CONTEXT // 0 elements, 0x0 bytes (sizeof) 
{                                                                    
}ACTIVATION_CONTEXT, *PACTIVATION_CONTEXT;                                  
                                                                     
typedef struct _ACTIVATION_CONTEXT_DATA // 0 elements, 0x0 bytes (sizeof) 
{                                                                         
}ACTIVATION_CONTEXT_DATA, *PACTIVATION_CONTEXT_DATA;                                  
                                                                          
          typedef struct _LIST_ENTRY     // 2 elements, 0x10 bytes (sizeof) 
          {                                                                 
/*0x000*/     struct _LIST_ENTRY* Flink;                                    
/*0x008*/     struct _LIST_ENTRY* Blink;                                    
          }LIST_ENTRY, *PLIST_ENTRY;                                        
                                                                            
          typedef struct _ACTIVATION_CONTEXT_STACK                     // 5 elements, 0x28 bytes (sizeof) 
          {                                                                                               
/*0x000*/     struct _RTL_ACTIVATION_CONTEXT_STACK_FRAME* ActiveFrame;                                    
/*0x008*/     struct _LIST_ENTRY FrameListCache;                       // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     ULONG32      Flags;                                                                         
/*0x01C*/     ULONG32      NextCookieSequenceNumber;                                                      
/*0x020*/     ULONG32      StackId;                                                                       
/*0x024*/     UINT8        _PADDING0_[0x4];                                                               
          }ACTIVATION_CONTEXT_STACK, *PACTIVATION_CONTEXT_STACK;                                          
                                                                                                          
typedef struct _ADAPTER_OBJECT // 0 elements, 0x0 bytes (sizeof) 
{                                                                
}ADAPTER_OBJECT, *PADAPTER_OBJECT;                                  
                                                                 
          typedef struct _KAFFINITY_EX // 4 elements, 0x28 bytes (sizeof) 
          {                                                               
/*0x000*/     UINT16       Count;                                         
/*0x002*/     UINT16       Size;                                          
/*0x004*/     ULONG32      Reserved;                                      
/*0x008*/     UINT64       Bitmap[4];                                     
          }KAFFINITY_EX, *PKAFFINITY_EX;                                   
                                                                          
          typedef struct _ALIGNED_AFFINITY_SUMMARY // 2 elements, 0x80 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _KAFFINITY_EX CpuSet;         // 4 elements, 0x28 bytes (sizeof) 
/*0x028*/     struct _KAFFINITY_EX SMTSet;         // 4 elements, 0x28 bytes (sizeof) 
/*0x050*/     UINT8        _PADDING0_[0x30];                                          
          }ALIGNED_AFFINITY_SUMMARY, *PALIGNED_AFFINITY_SUMMARY;                                   
                                                                                      
          typedef struct _EX_PUSH_LOCK                 // 7 elements, 0x8 bytes (sizeof) 
          {                                                                              
              union                                    // 3 elements, 0x8 bytes (sizeof) 
              {                                                                          
                  struct                               // 5 elements, 0x8 bytes (sizeof) 
                  {                                                                      
/*0x000*/             UINT64       Locked : 1;         // 0 BitPosition                  
/*0x000*/             UINT64       Waiting : 1;        // 1 BitPosition                  
/*0x000*/             UINT64       Waking : 1;         // 2 BitPosition                  
/*0x000*/             UINT64       MultipleShared : 1; // 3 BitPosition                  
/*0x000*/             UINT64       Shared : 60;        // 4 BitPosition                  
                  };                                                                     
/*0x000*/         UINT64       Value;                                                    
/*0x000*/         VOID*        Ptr;                                                      
              };                                                                         
          }EX_PUSH_LOCK, *PEX_PUSH_LOCK;                                                 
                                                                                         
          typedef struct _ALPC_HANDLE_TABLE       // 4 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _ALPC_HANDLE_ENTRY* Handles;                                    
/*0x008*/     ULONG32      TotalHandles;                                             
/*0x00C*/     ULONG32      Flags;                                                    
/*0x010*/     struct _EX_PUSH_LOCK Lock;          // 7 elements, 0x8 bytes (sizeof)  
          }ALPC_HANDLE_TABLE, *PALPC_HANDLE_TABLE;                                   
                                                                                     
          typedef struct _ALPC_COMMUNICATION_INFO         // 5 elements, 0x40 bytes (sizeof) 
          {                                                                                  
/*0x000*/     struct _ALPC_PORT* ConnectionPort;                                             
/*0x008*/     struct _ALPC_PORT* ServerCommunicationPort;                                    
/*0x010*/     struct _ALPC_PORT* ClientCommunicationPort;                                    
/*0x018*/     struct _LIST_ENTRY CommunicationList;       // 2 elements, 0x10 bytes (sizeof) 
/*0x028*/     struct _ALPC_HANDLE_TABLE HandleTable;      // 4 elements, 0x18 bytes (sizeof) 
          }ALPC_COMMUNICATION_INFO, *PALPC_COMMUNICATION_INFO;                                   
                                                                                             
          typedef struct _ALPC_COMPLETION_LIST             // 20 elements, 0x98 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _LIST_ENTRY Entry;                    // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     struct _EPROCESS* OwnerProcess;                                                  
/*0x018*/     struct _MDL* Mdl;                                                                
/*0x020*/     VOID*        UserVa;                                                             
/*0x028*/     VOID*        UserLimit;                                                          
/*0x030*/     VOID*        DataUserVa;                                                         
/*0x038*/     VOID*        SystemVa;                                                           
/*0x040*/     UINT64       TotalSize;                                                          
/*0x048*/     struct _ALPC_COMPLETION_LIST_HEADER* Header;                                     
/*0x050*/     VOID*        List;                                                               
/*0x058*/     UINT64       ListSize;                                                           
/*0x060*/     VOID*        Bitmap;                                                             
/*0x068*/     UINT64       BitmapSize;                                                         
/*0x070*/     VOID*        Data;                                                               
/*0x078*/     UINT64       DataSize;                                                           
/*0x080*/     ULONG32      BitmapLimit;                                                        
/*0x084*/     ULONG32      BitmapNextHint;                                                     
/*0x088*/     ULONG32      ConcurrencyCount;                                                   
/*0x08C*/     ULONG32      AttributeFlags;                                                     
/*0x090*/     ULONG32      AttributeSize;                                                      
/*0x094*/     UINT8        _PADDING0_[0x4];                                                    
          }ALPC_COMPLETION_LIST, *PALPC_COMPLETION_LIST;                                       
                                                                                               
          typedef struct _ALPC_COMPLETION_LIST_STATE       // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                  
              union                                        // 2 elements, 0x8 bytes (sizeof) 
              {                                                                              
                  struct                                   // 3 elements, 0x8 bytes (sizeof) 
                  {                                                                          
/*0x000*/             UINT64       Head : 24;              // 0 BitPosition                  
/*0x000*/             UINT64       Tail : 24;              // 24 BitPosition                 
/*0x000*/             UINT64       ActiveThreadCount : 16; // 48 BitPosition                 
                  }s1;                                                                       
/*0x000*/         UINT64       Value;                                                        
              }u1;                                                                           
          }ALPC_COMPLETION_LIST_STATE, *PALPC_COMPLETION_LIST_STATE;                                  
                                                                                             
          typedef struct _RTL_SRWLOCK                  // 7 elements, 0x8 bytes (sizeof) 
          {                                                                              
              union                                    // 3 elements, 0x8 bytes (sizeof) 
              {                                                                          
                  struct                               // 5 elements, 0x8 bytes (sizeof) 
                  {                                                                      
/*0x000*/             UINT64       Locked : 1;         // 0 BitPosition                  
/*0x000*/             UINT64       Waiting : 1;        // 1 BitPosition                  
/*0x000*/             UINT64       Waking : 1;         // 2 BitPosition                  
/*0x000*/             UINT64       MultipleShared : 1; // 3 BitPosition                  
/*0x000*/             UINT64       Shared : 60;        // 4 BitPosition                  
                  };                                                                     
/*0x000*/         UINT64       Value;                                                    
/*0x000*/         VOID*        Ptr;                                                      
              };                                                                         
          }RTL_SRWLOCK, *PRTL_SRWLOCK;                                                   
                                                                                         
          typedef struct _ALPC_COMPLETION_LIST_HEADER   // 18 elements, 0x300 bytes (sizeof) 
          {                                                                                  
/*0x000*/     UINT64       StartMagic;                                                       
/*0x008*/     ULONG32      TotalSize;                                                        
/*0x00C*/     ULONG32      ListOffset;                                                       
/*0x010*/     ULONG32      ListSize;                                                         
/*0x014*/     ULONG32      BitmapOffset;                                                     
/*0x018*/     ULONG32      BitmapSize;                                                       
/*0x01C*/     ULONG32      DataOffset;                                                       
/*0x020*/     ULONG32      DataSize;                                                         
/*0x024*/     ULONG32      AttributeFlags;                                                   
/*0x028*/     ULONG32      AttributeSize;                                                    
/*0x02C*/     UINT8        _PADDING0_[0x54];                                                 
/*0x080*/     struct _ALPC_COMPLETION_LIST_STATE State; // 1 elements, 0x8 bytes (sizeof)    
/*0x088*/     ULONG32      LastMessageId;                                                    
/*0x08C*/     ULONG32      LastCallbackId;                                                   
/*0x090*/     UINT8        _PADDING1_[0x70];                                                 
/*0x100*/     ULONG32      PostCount;                                                        
/*0x104*/     UINT8        _PADDING2_[0x7C];                                                 
/*0x180*/     ULONG32      ReturnCount;                                                      
/*0x184*/     UINT8        _PADDING3_[0x7C];                                                 
/*0x200*/     ULONG32      LogSequenceNumber;                                                
/*0x204*/     UINT8        _PADDING4_[0x7C];                                                 
/*0x280*/     struct _RTL_SRWLOCK UserLock;             // 7 elements, 0x8 bytes (sizeof)    
/*0x288*/     UINT64       EndMagic;                                                         
/*0x290*/     UINT8        _PADDING5_[0x70];                                                 
          }ALPC_COMPLETION_LIST_HEADER, *PALPC_COMPLETION_LIST_HEADER;                                     
                                                                                             
          typedef struct _SINGLE_LIST_ENTRY    // 1 elements, 0x8 bytes (sizeof) 
          {                                                                      
/*0x000*/     struct _SINGLE_LIST_ENTRY* Next;                                   
          }SINGLE_LIST_ENTRY, *PSINGLE_LIST_ENTRY;                                  
                                                                                 
          typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY   // 3 elements, 0x18 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _SINGLE_LIST_ENTRY ListEntry;                 // 1 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _IO_MINI_COMPLETION_PACKET_USER* Packet;                                         
/*0x010*/     struct _ALPC_COMPLETION_PACKET_LOOKASIDE* Lookaside;                                    
          }ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY, *PALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY;                                   
                                                                                                      
          typedef struct _ALPC_COMPLETION_PACKET_LOOKASIDE             // 10 elements, 0x50 bytes (sizeof) 
          {                                                                                                
/*0x000*/     UINT64       Lock;                                                                           
/*0x008*/     ULONG32      Size;                                                                           
/*0x00C*/     ULONG32      ActiveCount;                                                                    
/*0x010*/     ULONG32      PendingNullCount;                                                               
/*0x014*/     ULONG32      PendingCheckCompletionListCount;                                                
/*0x018*/     ULONG32      PendingDelete;                                                                  
/*0x01C*/     UINT8        _PADDING0_[0x4];                                                                
/*0x020*/     struct _SINGLE_LIST_ENTRY FreeListHead;                  // 1 elements, 0x8 bytes (sizeof)   
/*0x028*/     VOID*        CompletionPort;                                                                 
/*0x030*/     VOID*        CompletionKey;                                                                  
/*0x038*/     struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY Entry[1];                                     
          }ALPC_COMPLETION_PACKET_LOOKASIDE, *PALPC_COMPLETION_PACKET_LOOKASIDE;                                    
                                                                                                           
          typedef struct _ALPC_DISPATCH_CONTEXT                   // 9 elements, 0x38 bytes (sizeof) 
          {                                                                                          
/*0x000*/     struct _ALPC_PORT* PortObject;                                                         
/*0x008*/     struct _KALPC_MESSAGE* Message;                                                        
/*0x010*/     struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;                                    
/*0x018*/     struct _ETHREAD* TargetThread;                                                         
/*0x020*/     struct _ALPC_PORT* TargetPort;                                                         
/*0x028*/     ULONG32      Flags;                                                                    
/*0x02C*/     UINT16       TotalLength;                                                              
/*0x02E*/     UINT16       Type;                                                                     
/*0x030*/     UINT16       DataInfoOffset;                                                           
/*0x032*/     UINT8        _PADDING0_[0x6];                                                          
          }ALPC_DISPATCH_CONTEXT, *PALPC_DISPATCH_CONTEXT;                                           
                                                                                                     
          typedef struct _ALPC_HANDLE_ENTRY // 1 elements, 0x8 bytes (sizeof) 
          {                                                                   
/*0x000*/     VOID*        Object;                                            
          }ALPC_HANDLE_ENTRY, *PALPC_HANDLE_ENTRY;                                  
                                                                              
          typedef struct _ALPC_MESSAGE_ATTRIBUTES // 2 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      AllocatedAttributes;                                     
/*0x004*/     ULONG32      ValidAttributes;                                         
          }ALPC_MESSAGE_ATTRIBUTES, *PALPC_MESSAGE_ATTRIBUTES;                                  
                                                                                    
          typedef struct _ALPC_MESSAGE_ZONE // 6 elements, 0x30 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _MDL* Mdl;                                                
/*0x008*/     VOID*        UserVa;                                             
/*0x010*/     VOID*        UserLimit;                                          
/*0x018*/     VOID*        SystemVa;                                           
/*0x020*/     VOID*        SystemLimit;                                        
/*0x028*/     UINT64       Size;                                               
          }ALPC_MESSAGE_ZONE, *PALPC_MESSAGE_ZONE;                                   
                                                                               
          typedef struct _SECURITY_QUALITY_OF_SERVICE                // 4 elements, 0xC bytes (sizeof) 
          {                                                                                            
/*0x000*/     ULONG32      Length;                                                                     
/*0x004*/     enum _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel;                                   
/*0x008*/     UINT8        ContextTrackingMode;                                                        
/*0x009*/     UINT8        EffectiveOnly;                                                              
/*0x00A*/     UINT8        _PADDING0_[0x2];                                                            
          }SECURITY_QUALITY_OF_SERVICE, *PSECURITY_QUALITY_OF_SERVICE;                                  
                                                                                                       
          typedef struct _TOKEN_SOURCE       // 2 elements, 0x10 bytes (sizeof) 
          {                                                                     
/*0x000*/     CHAR         SourceName[8];                                       
/*0x008*/     struct _LUID SourceIdentifier; // 2 elements, 0x8 bytes (sizeof)  
          }TOKEN_SOURCE, *PTOKEN_SOURCE;                                        
                                                                                
          typedef struct _TOKEN_CONTROL         // 4 elements, 0x28 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _LUID TokenId;             // 2 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _LUID AuthenticationId;    // 2 elements, 0x8 bytes (sizeof)  
/*0x010*/     struct _LUID ModifiedId;          // 2 elements, 0x8 bytes (sizeof)  
/*0x018*/     struct _TOKEN_SOURCE TokenSource; // 2 elements, 0x10 bytes (sizeof) 
          }TOKEN_CONTROL, *PTOKEN_CONTROL;                                         
                                                                                   
          typedef struct _SECURITY_CLIENT_CONTEXT              // 6 elements, 0x48 bytes (sizeof) 
          {                                                                                       
/*0x000*/     struct _SECURITY_QUALITY_OF_SERVICE SecurityQos; // 4 elements, 0xC bytes (sizeof)  
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                       
/*0x010*/     VOID*        ClientToken;                                                           
/*0x018*/     UINT8        DirectlyAccessClientToken;                                             
/*0x019*/     UINT8        DirectAccessEffectiveOnly;                                             
/*0x01A*/     UINT8        ServerIsRemote;                                                        
/*0x01B*/     UINT8        _PADDING1_[0x1];                                                       
/*0x01C*/     struct _TOKEN_CONTROL ClientTokenControl;        // 4 elements, 0x28 bytes (sizeof) 
/*0x044*/     UINT8        _PADDING2_[0x4];                                                       
          }SECURITY_CLIENT_CONTEXT, *PSECURITY_CLIENT_CONTEXT;                                    
                                                                                                  
          typedef struct _ALPC_PORT_ATTRIBUTES                 // 10 elements, 0x48 bytes (sizeof) 
          {                                                                                        
/*0x000*/     ULONG32      Flags;                                                                  
/*0x004*/     struct _SECURITY_QUALITY_OF_SERVICE SecurityQos; // 4 elements, 0xC bytes (sizeof)   
/*0x010*/     UINT64       MaxMessageLength;                                                       
/*0x018*/     UINT64       MemoryBandwidth;                                                        
/*0x020*/     UINT64       MaxPoolUsage;                                                           
/*0x028*/     UINT64       MaxSectionSize;                                                         
/*0x030*/     UINT64       MaxViewSize;                                                            
/*0x038*/     UINT64       MaxTotalSectionSize;                                                    
/*0x040*/     ULONG32      DupObjectTypes;                                                         
/*0x044*/     ULONG32      Reserved;                                                               
          }ALPC_PORT_ATTRIBUTES, *PALPC_PORT_ATTRIBUTES;                                           
                                                                                                   
          typedef struct _ALPC_PORT                                                // 33 elements, 0x1A0 bytes (sizeof) 
          {                                                                                                             
/*0x000*/     struct _LIST_ENTRY PortListEntry;                                    // 2 elements, 0x10 bytes (sizeof)   
/*0x010*/     struct _ALPC_COMMUNICATION_INFO* CommunicationInfo;                                                       
/*0x018*/     struct _EPROCESS* OwnerProcess;                                                                           
/*0x020*/     VOID*        CompletionPort;                                                                              
/*0x028*/     VOID*        CompletionKey;                                                                               
/*0x030*/     struct _ALPC_COMPLETION_PACKET_LOOKASIDE* CompletionPacketLookaside;                                      
/*0x038*/     VOID*        PortContext;                                                                                 
/*0x040*/     struct _SECURITY_CLIENT_CONTEXT StaticSecurity;                      // 6 elements, 0x48 bytes (sizeof)   
/*0x088*/     struct _LIST_ENTRY MainQueue;                                        // 2 elements, 0x10 bytes (sizeof)   
/*0x098*/     struct _LIST_ENTRY PendingQueue;                                     // 2 elements, 0x10 bytes (sizeof)   
/*0x0A8*/     struct _LIST_ENTRY LargeMessageQueue;                                // 2 elements, 0x10 bytes (sizeof)   
/*0x0B8*/     struct _LIST_ENTRY WaitQueue;                                        // 2 elements, 0x10 bytes (sizeof)   
              union                                                                // 2 elements, 0x8 bytes (sizeof)    
              {                                                                                                         
/*0x0C8*/         struct _KSEMAPHORE* Semaphore;                                                                        
/*0x0C8*/         struct _KEVENT* DummyEvent;                                                                           
              };                                                                                                        
/*0x0D0*/     struct _ALPC_PORT_ATTRIBUTES PortAttributes;                         // 10 elements, 0x48 bytes (sizeof)  
/*0x118*/     struct _EX_PUSH_LOCK Lock;                                           // 7 elements, 0x8 bytes (sizeof)    
/*0x120*/     struct _EX_PUSH_LOCK ResourceListLock;                               // 7 elements, 0x8 bytes (sizeof)    
/*0x128*/     struct _LIST_ENTRY ResourceListHead;                                 // 2 elements, 0x10 bytes (sizeof)   
/*0x138*/     struct _ALPC_COMPLETION_LIST* CompletionList;                                                             
/*0x140*/     struct _ALPC_MESSAGE_ZONE* MessageZone;                                                                   
/*0x148*/     struct _CALLBACK_OBJECT* CallbackObject;                                                                  
/*0x150*/     VOID*        CallbackContext;                                                                             
/*0x158*/     struct _LIST_ENTRY CanceledQueue;                                    // 2 elements, 0x10 bytes (sizeof)   
/*0x168*/     LONG32       SequenceNo;                                                                                  
              union                                                                // 2 elements, 0x4 bytes (sizeof)    
              {                                                                                                         
                  struct                                                           // 16 elements, 0x4 bytes (sizeof)   
                  {                                                                                                     
/*0x16C*/             ULONG32      Initialized : 1;                                // 0 BitPosition                     
/*0x16C*/             ULONG32      Type : 2;                                       // 1 BitPosition                     
/*0x16C*/             ULONG32      ConnectionPending : 1;                          // 3 BitPosition                     
/*0x16C*/             ULONG32      ConnectionRefused : 1;                          // 4 BitPosition                     
/*0x16C*/             ULONG32      Disconnected : 1;                               // 5 BitPosition                     
/*0x16C*/             ULONG32      Closed : 1;                                     // 6 BitPosition                     
/*0x16C*/             ULONG32      NoFlushOnClose : 1;                             // 7 BitPosition                     
/*0x16C*/             ULONG32      ReturnExtendedInfo : 1;                         // 8 BitPosition                     
/*0x16C*/             ULONG32      Waitable : 1;                                   // 9 BitPosition                     
/*0x16C*/             ULONG32      DynamicSecurity : 1;                            // 10 BitPosition                    
/*0x16C*/             ULONG32      Wow64CompletionList : 1;                        // 11 BitPosition                    
/*0x16C*/             ULONG32      Lpc : 1;                                        // 12 BitPosition                    
/*0x16C*/             ULONG32      LpcToLpc : 1;                                   // 13 BitPosition                    
/*0x16C*/             ULONG32      HasCompletionList : 1;                          // 14 BitPosition                    
/*0x16C*/             ULONG32      HadCompletionList : 1;                          // 15 BitPosition                    
/*0x16C*/             ULONG32      EnableCompletionList : 1;                       // 16 BitPosition                    
                  }s1;                                                                                                  
/*0x16C*/         ULONG32      State;                                                                                   
              }u1;                                                                                                      
/*0x170*/     struct _ALPC_PORT* TargetQueuePort;                                                                       
/*0x178*/     struct _ALPC_PORT* TargetSequencePort;                                                                    
/*0x180*/     struct _KALPC_MESSAGE* CachedMessage;                                                                     
/*0x188*/     ULONG32      MainQueueLength;                                                                             
/*0x18C*/     ULONG32      PendingQueueLength;                                                                          
/*0x190*/     ULONG32      LargeMessageQueueLength;                                                                     
/*0x194*/     ULONG32      CanceledQueueLength;                                                                         
/*0x198*/     ULONG32      WaitQueueLength;                                                                             
/*0x19C*/     UINT8        _PADDING0_[0x4];                                                                             
          }ALPC_PORT, *PALPC_PORT;                                                                                      
                                                                                                                        
          typedef struct _ALPC_PROCESS_CONTEXT  // 3 elements, 0x20 bytes (sizeof) 
          {                                                                        
/*0x000*/     struct _EX_PUSH_LOCK Lock;        // 7 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _LIST_ENTRY ViewListHead;  // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     UINT64       PagedPoolQuotaCache;                                    
          }ALPC_PROCESS_CONTEXT, *PALPC_PROCESS_CONTEXT;                                   
                                                                                   
          typedef struct _AMD64_DBGKD_CONTROL_SET // 4 elements, 0x1C bytes (sizeof) 
          {                                                                          
/*0x000*/     ULONG32      TraceFlag;                                                
/*0x004*/     UINT64       Dr7;                                                      
/*0x00C*/     UINT64       CurrentSymbolStart;                                       
/*0x014*/     UINT64       CurrentSymbolEnd;                                         
          }AMD64_DBGKD_CONTROL_SET, *PAMD64_DBGKD_CONTROL_SET;                                   
                                                                                     
          typedef struct _ARBITER_ADD_RESERVED_PARAMETERS // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                 
/*0x000*/     struct _DEVICE_OBJECT* ReserveDevice;                                         
          }ARBITER_ADD_RESERVED_PARAMETERS, *PARBITER_ADD_RESERVED_PARAMETERS;                                  
                                                                                            
          typedef struct _ARBITER_ALLOCATION_STATE             // 12 elements, 0x50 bytes (sizeof) 
          {                                                                                        
/*0x000*/     UINT64       Start;                                                                  
/*0x008*/     UINT64       End;                                                                    
/*0x010*/     UINT64       CurrentMinimum;                                                         
/*0x018*/     UINT64       CurrentMaximum;                                                         
/*0x020*/     struct _ARBITER_LIST_ENTRY* Entry;                                                   
/*0x028*/     struct _ARBITER_ALTERNATIVE* CurrentAlternative;                                     
/*0x030*/     ULONG32      AlternativeCount;                                                       
/*0x034*/     UINT8        _PADDING0_[0x4];                                                        
/*0x038*/     struct _ARBITER_ALTERNATIVE* Alternatives;                                           
/*0x040*/     UINT16       Flags;                                                                  
/*0x042*/     UINT8        RangeAttributes;                                                        
/*0x043*/     UINT8        RangeAvailableAttributes;                                               
/*0x044*/     UINT8        _PADDING1_[0x4];                                                        
/*0x048*/     UINT64       WorkSpace;                                                              
          }ARBITER_ALLOCATION_STATE, *PARBITER_ALLOCATION_STATE;                                    
                                                                                                   
          typedef struct _ARBITER_ALTERNATIVE             // 8 elements, 0x40 bytes (sizeof) 
          {                                                                                  
/*0x000*/     UINT64       Minimum;                                                          
/*0x008*/     UINT64       Maximum;                                                          
/*0x010*/     UINT64       Length;                                                           
/*0x018*/     UINT64       Alignment;                                                        
/*0x020*/     LONG32       Priority;                                                         
/*0x024*/     ULONG32      Flags;                                                            
/*0x028*/     struct _IO_RESOURCE_DESCRIPTOR* Descriptor;                                    
/*0x030*/     ULONG32      Reserved[3];                                                      
/*0x03C*/     UINT8        _PADDING0_[0x4];                                                  
          }ARBITER_ALTERNATIVE, *PARBITER_ALTERNATIVE;                                       
                                                                                             
          typedef struct _ARBITER_BOOT_ALLOCATION_PARAMETERS // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _LIST_ENTRY* ArbitrationList;                                             
          }ARBITER_BOOT_ALLOCATION_PARAMETERS, *PARBITER_BOOT_ALLOCATION_PARAMETERS;                                  
                                                                                               
          typedef struct _ARBITER_CONFLICT_INFO    // 3 elements, 0x18 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _DEVICE_OBJECT* OwningObject;                                    
/*0x008*/     UINT64       Start;                                                     
/*0x010*/     UINT64       End;                                                       
          }ARBITER_CONFLICT_INFO, *PARBITER_CONFLICT_INFO;                                   
                                                                                      
          typedef struct _ARBITER_ORDERING_LIST    // 3 elements, 0x10 bytes (sizeof) 
          {                                                                           
/*0x000*/     UINT16       Count;                                                     
/*0x002*/     UINT16       Maximum;                                                   
/*0x004*/     UINT8        _PADDING0_[0x4];                                           
/*0x008*/     struct _ARBITER_ORDERING* Orderings;                                    
          }ARBITER_ORDERING_LIST, *PARBITER_ORDERING_LIST;                                   
                                                                                      
          typedef struct _ARBITER_INSTANCE                                                                       // 43 elements, 0x698 bytes (sizeof) 
          {                                                                                                                                           
/*0x000*/     ULONG32      Signature;                                                                                                                 
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                                           
/*0x008*/     struct _KEVENT* MutexEvent;                                                                                                             
/*0x010*/     UINT16*      Name;                                                                                                                      
/*0x018*/     UINT16*      OrderingName;                                                                                                              
/*0x020*/     INT32        ResourceType;                                                                                                              
/*0x024*/     UINT8        _PADDING1_[0x4];                                                                                                           
/*0x028*/     struct _RTL_RANGE_LIST* Allocation;                                                                                                     
/*0x030*/     struct _RTL_RANGE_LIST* PossibleAllocation;                                                                                             
/*0x038*/     struct _ARBITER_ORDERING_LIST OrderingList;                                                        // 3 elements, 0x10 bytes (sizeof)   
/*0x048*/     struct _ARBITER_ORDERING_LIST ReservedList;                                                        // 3 elements, 0x10 bytes (sizeof)   
/*0x058*/     LONG32       ReferenceCount;                                                                                                            
/*0x05C*/     UINT8        _PADDING2_[0x4];                                                                                                           
/*0x060*/     struct _ARBITER_INTERFACE* Interface;                                                                                                   
/*0x068*/     ULONG32      AllocationStackMaxSize;                                                                                                    
/*0x06C*/     UINT8        _PADDING3_[0x4];                                                                                                           
/*0x070*/     struct _ARBITER_ALLOCATION_STATE* AllocationStack;                                                                                      
/*0x078*/     FUNCT_005B_23DE_UnpackRequirement* UnpackRequirement;                                                                                   
/*0x080*/     FUNCT_005B_23E5_PackResource* PackResource;                                                                                             
/*0x088*/     FUNCT_005B_23EA_UnpackResource* UnpackResource;                                                                                         
/*0x090*/     FUNCT_005B_23EF_ScoreRequirement* ScoreRequirement;                                                                                     
/*0x098*/     FUNCT_005B_23F2_TestAllocation* TestAllocation;                                                                                         
/*0x0A0*/     FUNCT_005B_23F8_RetestAllocation* RetestAllocation;                                                                                     
/*0x0A8*/     FUNCT_005B_23FD_CommitAllocation_RollbackAllocation* CommitAllocation;                                                                  
/*0x0B0*/     FUNCT_005B_23FD_CommitAllocation_RollbackAllocation* RollbackAllocation;                                                                
/*0x0B8*/     FUNCT_005B_2400_BootAllocation* BootAllocation;                                                                                         
/*0x0C0*/     FUNCT_005B_2405_QueryArbitrate* QueryArbitrate;                                                                                         
/*0x0C8*/     FUNCT_005B_240A_QueryConflict* QueryConflict;                                                                                           
/*0x0D0*/     FUNCT_005B_240F_AddReserved* AddReserved;                                                                                               
/*0x0D8*/     FUNCT_005B_2414_StartArbiter* StartArbiter;                                                                                             
/*0x0E0*/     FUNCT_005B_2418_PreprocessEntry_AllocateEntry* PreprocessEntry;                                                                         
/*0x0E8*/     FUNCT_005B_2418_PreprocessEntry_AllocateEntry* AllocateEntry;                                                                           
/*0x0F0*/     FUNCT_0065_241C_GetNextAllocationRange_FindSuitableRange_OverrideConflict* GetNextAllocationRange;                                      
/*0x0F8*/     FUNCT_0065_241C_GetNextAllocationRange_FindSuitableRange_OverrideConflict* FindSuitableRange;                                           
/*0x100*/     FUNCT_00A3_241E_AddAllocation_BacktrackAllocation* AddAllocation;                                                                       
/*0x108*/     FUNCT_00A3_241E_AddAllocation_BacktrackAllocation* BacktrackAllocation;                                                                 
/*0x110*/     FUNCT_0065_241C_GetNextAllocationRange_FindSuitableRange_OverrideConflict* OverrideConflict;                                            
/*0x118*/     FUNCT_005B_2420_InitializeRangeList* InitializeRangeList;                                                                               
/*0x120*/     UINT8        TransactionInProgress;                                                                                                     
/*0x121*/     UINT8        _PADDING4_[0x7];                                                                                                           
/*0x128*/     struct _KEVENT* TransactionEvent;                                                                                                       
/*0x130*/     VOID*        Extension;                                                                                                                 
/*0x138*/     struct _DEVICE_OBJECT* BusDeviceObject;                                                                                                 
/*0x140*/     VOID*        ConflictCallbackContext;                                                                                                   
/*0x148*/     FUNCT_0065_2426_ConflictCallback* ConflictCallback;                                                                                     
/*0x150*/     WCHAR        PdoDescriptionString[336];                                                                                                 
/*0x3F0*/     CHAR         PdoSymbolicNameString[672];                                                                                                
/*0x690*/     WCHAR        PdoAddressString[1];                                                                                                       
/*0x692*/     UINT8        _PADDING5_[0x6];                                                                                                           
          }ARBITER_INSTANCE, *PARBITER_INSTANCE;                                                                                                      
                                                                                                                                                      
          typedef struct _ARBITER_INTERFACE                                                                                                                                                    // 7 elements, 0x30 bytes (sizeof) 
          {                                                                                                                                                                                                                       
/*0x000*/     UINT16       Size;                                                                                                                                                                                                  
/*0x002*/     UINT16       Version;                                                                                                                                                                                               
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                                                                                                                                       
/*0x008*/     VOID*        Context;                                                                                                                                                                                               
/*0x010*/     FUNCT_00A3_0728_Free_IdleHandler_InterfaceReference_InterfaceDereference_DeleteProcedure_WorkerRoutine_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead* InterfaceReference;                                      
/*0x018*/     FUNCT_00A3_0728_Free_IdleHandler_InterfaceReference_InterfaceDereference_DeleteProcedure_WorkerRoutine_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead* InterfaceDereference;                                    
/*0x020*/     FUNCT_005B_237C_ArbiterHandler* ArbiterHandler;                                                                                                                                                                     
/*0x028*/     ULONG32      Flags;                                                                                                                                                                                                 
/*0x02C*/     UINT8        _PADDING1_[0x4];                                                                                                                                                                                       
          }ARBITER_INTERFACE, *PARBITER_INTERFACE;                                                                                                                                                                                
                                                                                                                                                                                                                                  
          typedef struct _ARBITER_LIST_ENTRY                       // 13 elements, 0x60 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _LIST_ENTRY ListEntry;                        // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     ULONG32      AlternativeCount;                                                           
/*0x014*/     UINT8        _PADDING0_[0x4];                                                            
/*0x018*/     struct _IO_RESOURCE_DESCRIPTOR* Alternatives;                                            
/*0x020*/     struct _DEVICE_OBJECT* PhysicalDeviceObject;                                             
/*0x028*/     enum _ARBITER_REQUEST_SOURCE RequestSource;                                              
/*0x02C*/     ULONG32      Flags;                                                                      
/*0x030*/     INT64        WorkSpace;                                                                  
/*0x038*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x03C*/     ULONG32      SlotNumber;                                                                 
/*0x040*/     ULONG32      BusNumber;                                                                  
/*0x044*/     UINT8        _PADDING1_[0x4];                                                            
/*0x048*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* Assignment;                                      
/*0x050*/     struct _IO_RESOURCE_DESCRIPTOR* SelectedAlternative;                                     
/*0x058*/     enum _ARBITER_RESULT Result;                                                             
/*0x05C*/     UINT8        _PADDING2_[0x4];                                                            
          }ARBITER_LIST_ENTRY, *PARBITER_LIST_ENTRY;                                                   
                                                                                                       
          typedef struct _ARBITER_ORDERING // 2 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     UINT64       Start;                                             
/*0x008*/     UINT64       End;                                               
          }ARBITER_ORDERING, *PARBITER_ORDERING;                                   
                                                                              
          typedef struct _ARBITER_TEST_ALLOCATION_PARAMETERS        // 3 elements, 0x18 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _LIST_ENTRY* ArbitrationList;                                                     
/*0x008*/     ULONG32      AllocateFromCount;                                                          
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                            
/*0x010*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                                    
          }ARBITER_TEST_ALLOCATION_PARAMETERS, *PARBITER_TEST_ALLOCATION_PARAMETERS;                                   
                                                                                                       
          typedef struct _ARBITER_RETEST_ALLOCATION_PARAMETERS      // 3 elements, 0x18 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _LIST_ENTRY* ArbitrationList;                                                     
/*0x008*/     ULONG32      AllocateFromCount;                                                          
/*0x00C*/     UINT8        _PADDING0_[0x4];                                                            
/*0x010*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR* AllocateFrom;                                    
          }ARBITER_RETEST_ALLOCATION_PARAMETERS, *PARBITER_RETEST_ALLOCATION_PARAMETERS;                                   
                                                                                                       
          typedef struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                              
/*0x000*/     struct _CM_PARTIAL_RESOURCE_LIST** AllocatedResources;                                     
          }ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS, *PARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS;                                  
                                                                                                         
          typedef struct _ARBITER_QUERY_CONFLICT_PARAMETERS        // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                           
/*0x000*/     struct _DEVICE_OBJECT* PhysicalDeviceObject;                                            
/*0x008*/     struct _IO_RESOURCE_DESCRIPTOR* ConflictingResource;                                    
/*0x010*/     ULONG32*     ConflictCount;                                                             
/*0x018*/     struct _ARBITER_CONFLICT_INFO** Conflicts;                                              
          }ARBITER_QUERY_CONFLICT_PARAMETERS, *PARBITER_QUERY_CONFLICT_PARAMETERS;                                   
                                                                                                      
          typedef struct _ARBITER_QUERY_ARBITRATE_PARAMETERS // 1 elements, 0x8 bytes (sizeof) 
          {                                                                                    
/*0x000*/     struct _LIST_ENTRY* ArbitrationList;                                             
          }ARBITER_QUERY_ARBITRATE_PARAMETERS, *PARBITER_QUERY_ARBITRATE_PARAMETERS;                                  
                                                                                               
          typedef struct _ARBITER_PARAMETERS                                                    // 1 elements, 0x20 bytes (sizeof) 
          {                                                                                                                        
              union                                                                             // 7 elements, 0x20 bytes (sizeof) 
              {                                                                                                                    
/*0x000*/         struct _ARBITER_TEST_ALLOCATION_PARAMETERS TestAllocation;                    // 3 elements, 0x18 bytes (sizeof) 
/*0x000*/         struct _ARBITER_RETEST_ALLOCATION_PARAMETERS RetestAllocation;                // 3 elements, 0x18 bytes (sizeof) 
/*0x000*/         struct _ARBITER_BOOT_ALLOCATION_PARAMETERS BootAllocation;                    // 1 elements, 0x8 bytes (sizeof)  
/*0x000*/         struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS QueryAllocatedResources; // 1 elements, 0x8 bytes (sizeof)  
/*0x000*/         struct _ARBITER_QUERY_CONFLICT_PARAMETERS QueryConflict;                      // 4 elements, 0x20 bytes (sizeof) 
/*0x000*/         struct _ARBITER_QUERY_ARBITRATE_PARAMETERS QueryArbitrate;                    // 1 elements, 0x8 bytes (sizeof)  
/*0x000*/         struct _ARBITER_ADD_RESERVED_PARAMETERS AddReserved;                          // 1 elements, 0x8 bytes (sizeof)  
              }Parameters;                                                                                                         
          }ARBITER_PARAMETERS, *PARBITER_PARAMETERS;                                                                               
                                                                                                                                   
          typedef struct _ARC_DISK_INFORMATION   // 1 elements, 0x10 bytes (sizeof) 
          {                                                                         
/*0x000*/     struct _LIST_ENTRY DiskSignatures; // 2 elements, 0x10 bytes (sizeof) 
          }ARC_DISK_INFORMATION, *PARC_DISK_INFORMATION;                                   
                                                                                    
          typedef struct _ARM_DBGKD_CONTROL_SET // 3 elements, 0xC bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      Continue;                                              
/*0x004*/     ULONG32      CurrentSymbolStart;                                    
/*0x008*/     ULONG32      CurrentSymbolEnd;                                      
          }ARM_DBGKD_CONTROL_SET, *PARM_DBGKD_CONTROL_SET;                                  
                                                                                  
typedef struct _ASSEMBLY_STORAGE_MAP // 0 elements, 0x0 bytes (sizeof) 
{                                                                      
}ASSEMBLY_STORAGE_MAP, *PASSEMBLY_STORAGE_MAP;                                  
                                                                       
          typedef struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION // 4 elements, 0x30 bytes (sizeof) 
          {                                                                                             
/*0x000*/     ULONG32      SecurityAttributeCount;                                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                                             
/*0x008*/     struct _LIST_ENTRY SecurityAttributesList;             // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     ULONG32      WorkingSecurityAttributeCount;                                               
/*0x01C*/     UINT8        _PADDING1_[0x4];                                                             
/*0x020*/     struct _LIST_ENTRY WorkingSecurityAttributesList;      // 2 elements, 0x10 bytes (sizeof) 
          }AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION, *PAUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION;                                   
                                                                                                        
          typedef struct _GENERIC_MAPPING  // 4 elements, 0x10 bytes (sizeof) 
          {                                                                   
/*0x000*/     ULONG32      GenericRead;                                       
/*0x004*/     ULONG32      GenericWrite;                                      
/*0x008*/     ULONG32      GenericExecute;                                    
/*0x00C*/     ULONG32      GenericAll;                                        
          }GENERIC_MAPPING, *PGENERIC_MAPPING;                                   
                                                                              
          typedef struct _GUID       // 4 elements, 0x10 bytes (sizeof) 
          {                                                             
/*0x000*/     ULONG32      Data1;                                       
/*0x004*/     UINT16       Data2;                                       
/*0x006*/     UINT16       Data3;                                       
/*0x008*/     UINT8        Data4[8];                                    
          }GUID, *PGUID;                                                
                                                                        
          typedef struct _AUX_ACCESS_DATA                                                                              // 11 elements, 0xD8 bytes (sizeof) 
          {                                                                                                                                                
/*0x000*/     struct _PRIVILEGE_SET* PrivilegesUsed;                                                                                                       
/*0x008*/     struct _GENERIC_MAPPING GenericMapping;                                                                  // 4 elements, 0x10 bytes (sizeof)  
/*0x018*/     ULONG32      AccessesToAudit;                                                                                                                
/*0x01C*/     ULONG32      MaximumAuditMask;                                                                                                               
/*0x020*/     struct _GUID TransactionId;                                                                              // 4 elements, 0x10 bytes (sizeof)  
/*0x030*/     VOID*        NewSecurityDescriptor;                                                                                                          
/*0x038*/     VOID*        ExistingSecurityDescriptor;                                                                                                     
/*0x040*/     VOID*        ParentSecurityDescriptor;                                                                                                       
/*0x048*/     FUNCT_00A3_00A2_CleanupGroupCancelCallback_DeRefSecurityDescriptor_PostRoutine* DeRefSecurityDescriptor;                                     
/*0x050*/     VOID*        SDLock;                                                                                                                         
/*0x058*/     struct _ACCESS_REASONS AccessReasons;                                                                    // 1 elements, 0x80 bytes (sizeof)  
          }AUX_ACCESS_DATA, *PAUX_ACCESS_DATA;                                                                                                             
                                                                                                                                                           
          typedef struct _BATTERY_REPORTING_SCALE // 2 elements, 0x8 bytes (sizeof) 
          {                                                                         
/*0x000*/     ULONG32      Granularity;                                             
/*0x004*/     ULONG32      Capacity;                                                
          }BATTERY_REPORTING_SCALE, *PBATTERY_REPORTING_SCALE;                                  
                                                                                    
          typedef struct _BITMAP_RANGE      // 6 elements, 0x30 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _LIST_ENTRY Links;     // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     INT64        BasePage;                                           
/*0x018*/     ULONG32      FirstDirtyPage;                                     
/*0x01C*/     ULONG32      LastDirtyPage;                                      
/*0x020*/     ULONG32      DirtyPages;                                         
/*0x024*/     UINT8        _PADDING0_[0x4];                                    
/*0x028*/     ULONG32*     Bitmap;                                             
          }BITMAP_RANGE, *PBITMAP_RANGE;                                       
                                                                               
          typedef struct _SLIST_ENTRY       // 1 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _SLIST_ENTRY* Next;                                       
/*0x008*/     UINT8        _PADDING0_[0x8];                                    
          }SLIST_ENTRY, *PSLIST_ENTRY;                                         
                                                                               
          typedef struct _BLOB                         // 7 elements, 0x20 bytes (sizeof) 
          {                                                                               
              union                                    // 2 elements, 0x10 bytes (sizeof) 
              {                                                                           
/*0x000*/         struct _LIST_ENTRY ResourceList;     // 2 elements, 0x10 bytes (sizeof) 
/*0x000*/         struct _SLIST_ENTRY FreeListEntry;   // 1 elements, 0x10 bytes (sizeof) 
              };                                                                          
              union                                    // 2 elements, 0x1 bytes (sizeof)  
              {                                                                           
                  struct                               // 4 elements, 0x1 bytes (sizeof)  
                  {                                                                       
/*0x010*/             UINT8        ReferenceCache : 1; // 0 BitPosition                   
/*0x010*/             UINT8        Lookaside : 1;      // 1 BitPosition                   
/*0x010*/             UINT8        Initializing : 1;   // 2 BitPosition                   
/*0x010*/             UINT8        Deleted : 1;        // 3 BitPosition                   
                  }s1;                                                                    
/*0x010*/         UINT8        Flags;                                                     
              }u1;                                                                        
/*0x011*/     UINT8        ResourceId;                                                    
/*0x012*/     INT16        CachedReferences;                                              
/*0x014*/     LONG32       ReferenceCount;                                                
/*0x018*/     struct _EX_PUSH_LOCK Lock;               // 7 elements, 0x8 bytes (sizeof)  
          }BLOB, *PBLOB;                                                                  
                                                                                          
          typedef struct _BLOB_TYPE                                                                                                                                                       // 9 elements, 0x38 bytes (sizeof) 
          {                                                                                                                                                                                                                  
/*0x000*/     enum _BLOB_ID ResourceId;                                                                                                                                                                                      
/*0x004*/     ULONG32      PoolTag;                                                                                                                                                                                          
/*0x008*/     ULONG32      Flags;                                                                                                                                                                                            
/*0x00C*/     ULONG32      CreatedObjects;                                                                                                                                                                                   
/*0x010*/     ULONG32      DeletedObjects;                                                                                                                                                                                   
/*0x014*/     UINT8        _PADDING0_[0x4];                                                                                                                                                                                  
/*0x018*/     FUNCT_00A3_0728_Free_IdleHandler_InterfaceReference_InterfaceDereference_DeleteProcedure_WorkerRoutine_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead* DeleteProcedure;                                    
/*0x020*/     FUNCT_005B_079E_IdleCheck_DestroyProcedure* DestroyProcedure;                                                                                                                                                  
/*0x028*/     UINT64       UsualSize;                                                                                                                                                                                        
/*0x030*/     ULONG32      LookasideIndex;                                                                                                                                                                                   
/*0x034*/     UINT8        _PADDING1_[0x4];                                                                                                                                                                                  
          }BLOB_TYPE, *PBLOB_TYPE;                                                                                                                                                                                           
                                                                                                                                                                                                                             
          typedef struct _BUS_EXTENSION_LIST          // 2 elements, 0x10 bytes (sizeof) 
          {                                                                              
/*0x000*/     VOID*        Next;                                                         
/*0x008*/     struct _PI_BUS_EXTENSION* BusExtension;                                    
          }BUS_EXTENSION_LIST, *PBUS_EXTENSION_LIST;                                     
                                                                                         
          typedef struct _CACHE_DESCRIPTOR     // 5 elements, 0xC bytes (sizeof) 
          {                                                                      
/*0x000*/     UINT8        Level;                                                
/*0x001*/     UINT8        Associativity;                                        
/*0x002*/     UINT16       LineSize;                                             
/*0x004*/     ULONG32      Size;                                                 
/*0x008*/     enum _PROCESSOR_CACHE_TYPE Type;                                   
          }CACHE_DESCRIPTOR, *PCACHE_DESCRIPTOR;                                  
                                                                                 
          typedef struct _CACHE_MANAGER_CALLBACKS                                                                                                                                              // 4 elements, 0x20 bytes (sizeof) 
          {                                                                                                                                                                                                                       
/*0x000*/     FUNCT_0065_1A77_AcquireForLazyWrite_AcquireForReadAhead* AcquireForLazyWrite;                                                                                                                                       
/*0x008*/     FUNCT_00A3_0728_Free_IdleHandler_InterfaceReference_InterfaceDereference_DeleteProcedure_WorkerRoutine_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead* ReleaseFromLazyWrite;                                    
/*0x010*/     FUNCT_0065_1A77_AcquireForLazyWrite_AcquireForReadAhead* AcquireForReadAhead;                                                                                                                                       
/*0x018*/     FUNCT_00A3_0728_Free_IdleHandler_InterfaceReference_InterfaceDereference_DeleteProcedure_WorkerRoutine_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead* ReleaseFromReadAhead;                                    
          }CACHE_MANAGER_CALLBACKS, *PCACHE_MANAGER_CALLBACKS;                                                                                                                                                                    
                                                                                                                                                                                                                                  
          typedef struct _DISPATCHER_HEADER                           // 29 elements, 0x18 bytes (sizeof) 
          {                                                                                               
              union                                                   // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                           
                  struct                                              // 4 elements, 0x4 bytes (sizeof)   
                  {                                                                                       
/*0x000*/             UINT8        Type;                                                                  
                      union                                           // 4 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x001*/                 UINT8        TimerControlFlags;                                                 
                          struct                                      // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x001*/                     UINT8        Absolute : 1;              // 0 BitPosition                    
/*0x001*/                     UINT8        Coalescable : 1;           // 1 BitPosition                    
/*0x001*/                     UINT8        KeepShifting : 1;          // 2 BitPosition                    
/*0x001*/                     UINT8        EncodedTolerableDelay : 5; // 3 BitPosition                    
                          };                                                                              
/*0x001*/                 UINT8        Abandoned;                                                         
/*0x001*/                 UINT8        Signalling;                                                        
                      };                                                                                  
                      union                                           // 4 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x002*/                 UINT8        ThreadControlFlags;                                                
                          struct                                      // 4 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x002*/                     UINT8        CpuThrottled : 1;          // 0 BitPosition                    
/*0x002*/                     UINT8        CycleProfiling : 1;        // 1 BitPosition                    
/*0x002*/                     UINT8        CounterProfiling : 1;      // 2 BitPosition                    
/*0x002*/                     UINT8        Reserved : 5;              // 3 BitPosition                    
                          };                                                                              
/*0x002*/                 UINT8        Hand;                                                              
/*0x002*/                 UINT8        Size;                                                              
                      };                                                                                  
                      union                                           // 5 elements, 0x1 bytes (sizeof)   
                      {                                                                                   
/*0x003*/                 UINT8        TimerMiscFlags;                                                    
                          struct                                      // 3 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x003*/                     UINT8        Index : 6;                 // 0 BitPosition                    
/*0x003*/                     UINT8        Inserted : 1;              // 6 BitPosition                    
/*0x003*/                     UINT8        Expired : 1;               // 7 BitPosition                    
                          };                                                                              
/*0x003*/                 UINT8        DebugActive;                                                       
                          struct                                      // 5 elements, 0x1 bytes (sizeof)   
                          {                                                                               
/*0x003*/                     UINT8        ActiveDR7 : 1;             // 0 BitPosition                    
/*0x003*/                     UINT8        Instrumented : 1;          // 1 BitPosition                    
/*0x003*/                     UINT8        Reserved2 : 4;             // 2 BitPosition                    
/*0x003*/                     UINT8        UmsScheduled : 1;          // 6 BitPosition                    
/*0x003*/                     UINT8        UmsPrimary : 1;            // 7 BitPosition                    
                          };                                                                              
/*0x003*/                 UINT8        DpcActive;                                                         
                      };                                                                                  
                  };                                                                                      
/*0x000*/         LONG32       Lock;                                                                      
              };                                                                                          
/*0x004*/     LONG32       SignalState;                                                                   
/*0x008*/     struct _LIST_ENTRY WaitListHead;                        // 2 elements, 0x10 bytes (sizeof)  
          }DISPATCHER_HEADER, *PDISPATCHER_HEADER;                                                        
                                                                                                          
          typedef struct _KEVENT                // 1 elements, 0x18 bytes (sizeof)  
          {                                                                         
/*0x000*/     struct _DISPATCHER_HEADER Header; // 29 elements, 0x18 bytes (sizeof) 
          }KEVENT, *PKEVENT;                                                        
                                                                                    
          typedef struct _CACHE_UNINITIALIZE_EVENT    // 2 elements, 0x20 bytes (sizeof) 
          {                                                                              
/*0x000*/     struct _CACHE_UNINITIALIZE_EVENT* Next;                                    
/*0x008*/     struct _KEVENT Event;                   // 1 elements, 0x18 bytes (sizeof) 
          }CACHE_UNINITIALIZE_EVENT, *PCACHE_UNINITIALIZE_EVENT;                                   
                                                                                         
          typedef struct _CACHED_CHILD_LIST              // 3 elements, 0x10 bytes (sizeof) 
          {                                                                                 
/*0x000*/     ULONG32      Count;                                                           
/*0x004*/     UINT8        _PADDING0_[0x4];                                                 
              union                                      // 2 elements, 0x8 bytes (sizeof)  
              {                                                                             
/*0x008*/         UINT64       ValueList;                                                   
/*0x008*/         struct _CM_KEY_CONTROL_BLOCK* RealKcb;                                    
              };                                                                            
          }CACHED_CHILD_LIST, *PCACHED_CHILD_LIST;                                          
                                                                                            
          typedef union _SLIST_HEADER              // 5 elements, 0x10 bytes (sizeof) 
          {                                                                           
              struct                               // 2 elements, 0x10 bytes (sizeof) 
              {                                                                       
/*0x000*/         UINT64       Alignment;                                             
/*0x008*/         UINT64       Region;                                                
              };                                                                      
              struct                               // 7 elements, 0x10 bytes (sizeof) 
              {                                                                       
                  struct                           // 3 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x000*/             UINT64       Depth : 16;     // 0 BitPosition                   
/*0x000*/             UINT64       Sequence : 9;   // 16 BitPosition                  
/*0x000*/             UINT64       NextEntry : 39; // 25 BitPosition                  
                  };                                                                  
                  struct                           // 4 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x008*/             UINT64       HeaderType : 1; // 0 BitPosition                   
/*0x008*/             UINT64       Init : 1;       // 1 BitPosition                   
/*0x008*/             UINT64       Reserved : 59;  // 2 BitPosition                   
/*0x008*/             UINT64       Region : 3;     // 61 BitPosition                  
                  };                                                                  
              }Header8;                                                               
              struct                               // 6 elements, 0x10 bytes (sizeof) 
              {                                                                       
                  struct                           // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x000*/             UINT64       Depth : 16;     // 0 BitPosition                   
/*0x000*/             UINT64       Sequence : 48;  // 16 BitPosition                  
                  };                                                                  
                  struct                           // 4 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x008*/             UINT64       HeaderType : 1; // 0 BitPosition                   
/*0x008*/             UINT64       Init : 1;       // 1 BitPosition                   
/*0x008*/             UINT64       Reserved : 2;   // 2 BitPosition                   
/*0x008*/             UINT64       NextEntry : 60; // 4 BitPosition                   
                  };                                                                  
              }Header16;                                                              
              struct                               // 5 elements, 0x10 bytes (sizeof) 
              {                                                                       
                  struct                           // 2 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x000*/             UINT64       Depth : 16;     // 0 BitPosition                   
/*0x000*/             UINT64       Sequence : 48;  // 16 BitPosition                  
                  };                                                                  
                  struct                           // 3 elements, 0x8 bytes (sizeof)  
                  {                                                                   
/*0x008*/             UINT64       HeaderType : 1; // 0 BitPosition                   
/*0x008*/             UINT64       Reserved : 3;   // 1 BitPosition                   
/*0x008*/             UINT64       NextEntry : 60; // 4 BitPosition                   
                  };                                                                  
              }HeaderX64;                                                             
          }SLIST_HEADER, *PSLIST_HEADER;                                              
                                                                                      
          typedef struct _CACHED_KSTACK_LIST // 5 elements, 0x20 bytes (sizeof) 
          {                                                                     
/*0x000*/     union _SLIST_HEADER SListHead; // 5 elements, 0x10 bytes (sizeof) 
/*0x010*/     LONG32       MinimumFree;                                         
/*0x014*/     ULONG32      Misses;                                              
/*0x018*/     ULONG32      MissesLast;                                          
/*0x01C*/     ULONG32      Pad0;                                                
          }CACHED_KSTACK_LIST, *PCACHED_KSTACK_LIST;                                   
                                                                                
          typedef struct _CALL_HASH_ENTRY   // 4 elements, 0x28 bytes (sizeof) 
          {                                                                    
/*0x000*/     struct _LIST_ENTRY ListEntry; // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     VOID*        CallersAddress;                                     
/*0x018*/     VOID*        CallersCaller;                                      
/*0x020*/     ULONG32      CallCount;                                          
/*0x024*/     UINT8        _PADDING0_[0x4];                                    
          }CALL_HASH_ENTRY, *PCALL_HASH_ENTRY;                                   
                                                                               
          typedef struct _CALL_PERFORMANCE_DATA // 2 elements, 0x408 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT64       SpinLock;                                                
/*0x008*/     struct _LIST_ENTRY HashTable[64];                                     
          }CALL_PERFORMANCE_DATA, *PCALL_PERFORMANCE_DATA;                                    
                                                                                    
typedef struct _CALLBACK_OBJECT // 0 elements, 0x0 bytes (sizeof) 
{                                                                 
}CALLBACK_OBJECT, *PCALLBACK_OBJECT;                                  
                                                                  
                                                                           
          typedef struct _CHILD_LIST // 2 elements, 0x8 bytes (sizeof) 
          {                                                            
/*0x000*/     ULONG32      Count;                                      
/*0x004*/     ULONG32      List;                                       
          }CHILD_LIST, *PCHILD_LIST;                                   
                                                                       
          typedef struct _CM_KEY_REFERENCE  // 2 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     ULONG32      KeyCell;                                            
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     struct _HHIVE* KeyHive;                                          
          }CM_KEY_REFERENCE, *PCM_KEY_REFERENCE;                                   
                                                                               
          typedef struct _CM_KEY_NODE                          // 22 elements, 0x50 bytes (sizeof) 
          {                                                                                        
/*0x000*/     UINT16       Signature;                                                              
/*0x002*/     UINT16       Flags;                                                                  
/*0x004*/     union _LARGE_INTEGER LastWriteTime;              // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/     ULONG32      Spare;                                                                  
/*0x010*/     ULONG32      Parent;                                                                 
/*0x014*/     ULONG32      SubKeyCounts[2];                                                        
              union                                            // 2 elements, 0x10 bytes (sizeof)  
              {                                                                                    
                  struct                                       // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                
/*0x01C*/             ULONG32      SubKeyLists[2];                                                 
/*0x024*/             struct _CHILD_LIST ValueList;            // 2 elements, 0x8 bytes (sizeof)   
                  };                                                                               
/*0x01C*/         struct _CM_KEY_REFERENCE ChildHiveReference; // 2 elements, 0x10 bytes (sizeof)  
              };                                                                                   
/*0x02C*/     ULONG32      Security;                                                               
/*0x030*/     ULONG32      Class;                                                                  
              struct                                           // 4 elements, 0x4 bytes (sizeof)   
              {                                                                                    
/*0x034*/         ULONG32      MaxNameLen : 16;                // 0 BitPosition                    
/*0x034*/         ULONG32      UserFlags : 4;                  // 16 BitPosition                   
/*0x034*/         ULONG32      VirtControlFlags : 4;           // 20 BitPosition                   
/*0x034*/         ULONG32      Debug : 8;                      // 24 BitPosition                   
              };                                                                                   
/*0x038*/     ULONG32      MaxClassLen;                                                            
/*0x03C*/     ULONG32      MaxValueNameLen;                                                        
/*0x040*/     ULONG32      MaxValueDataLen;                                                        
/*0x044*/     ULONG32      WorkVar;                                                                
/*0x048*/     UINT16       NameLength;                                                             
/*0x04A*/     UINT16       ClassLength;                                                            
/*0x04C*/     WCHAR        Name[1];                                                                
/*0x04E*/     UINT8        _PADDING0_[0x2];                                                        
          }CM_KEY_NODE, *PCM_KEY_NODE;                                                             
                                                                                                   
          typedef struct _CM_KEY_VALUE      // 8 elements, 0x18 bytes (sizeof) 
          {                                                                    
/*0x000*/     UINT16       Signature;                                          
/*0x002*/     UINT16       NameLength;                                         
/*0x004*/     ULONG32      DataLength;                                         
/*0x008*/     ULONG32      Data;                                               
/*0x00C*/     ULONG32      Type;                                               
/*0x010*/     UINT16       Flags;                                              
/*0x012*/     UINT16       Spare;                                              
/*0x014*/     WCHAR        Name[1];                                            
/*0x016*/     UINT8        _PADDING0_[0x2];                                    
          }CM_KEY_VALUE, *PCM_KEY_VALUE;                                       
                                                                               
          typedef struct _SECURITY_DESCRIPTOR_RELATIVE // 7 elements, 0x14 bytes (sizeof) 
          {                                                                               
/*0x000*/     UINT8        Revision;                                                      
/*0x001*/     UINT8        Sbz1;                                                          
/*0x002*/     UINT16       Control;                                                       
/*0x004*/     ULONG32      Owner;                                                         
/*0x008*/     ULONG32      Group;                                                         
/*0x00C*/     ULONG32      Sacl;                                                          
/*0x010*/     ULONG32      Dacl;                                                          
          }SECURITY_DESCRIPTOR_RELATIVE, *PSECURITY_DESCRIPTOR_RELATIVE;                                   
                                                                                          
          typedef struct _CM_KEY_SECURITY                      // 7 elements, 0x28 bytes (sizeof) 
          {                                                                                       
/*0x000*/     UINT16       Signature;                                                             
/*0x002*/     UINT16       Reserved;                                                              
/*0x004*/     ULONG32      Flink;                                                                 
/*0x008*/     ULONG32      Blink;                                                                 
/*0x00C*/     ULONG32      ReferenceCount;                                                        
/*0x010*/     ULONG32      DescriptorLength;                                                      
/*0x014*/     struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor; // 7 elements, 0x14 bytes (sizeof) 
          }CM_KEY_SECURITY, *PCM_KEY_SECURITY;                                                    
                                                                                                  
          typedef struct _CM_KEY_INDEX // 3 elements, 0x8 bytes (sizeof) 
          {                                                              
/*0x000*/     UINT16       Signature;                                    
/*0x002*/     UINT16       Count;                                        
/*0x004*/     ULONG32      List[1];                                      
          }CM_KEY_INDEX, *PCM_KEY_INDEX;                                  
                                                                         
          typedef struct _CM_BIG_DATA // 3 elements, 0x8 bytes (sizeof) 
          {                                                             
/*0x000*/     UINT16       Signature;                                   
/*0x002*/     UINT16       Count;                                       
/*0x004*/     ULONG32      List;                                        
          }CM_BIG_DATA, *PCM_BIG_DATA;                                  
                                                                        
          typedef struct _CELL_DATA                    // 1 elements, 0x50 bytes (sizeof)  
          {                                                                                
              union                                    // 7 elements, 0x50 bytes (sizeof)  
              {                                                                            
/*0x000*/         struct _CM_KEY_NODE KeyNode;         // 22 elements, 0x50 bytes (sizeof) 
/*0x000*/         struct _CM_KEY_VALUE KeyValue;       // 8 elements, 0x18 bytes (sizeof)  
/*0x000*/         struct _CM_KEY_SECURITY KeySecurity; // 7 elements, 0x28 bytes (sizeof)  
/*0x000*/         struct _CM_KEY_INDEX KeyIndex;       // 3 elements, 0x8 bytes (sizeof)   
/*0x000*/         struct _CM_BIG_DATA ValueData;       // 3 elements, 0x8 bytes (sizeof)   
/*0x000*/         ULONG32      KeyList[1];                                                 
/*0x000*/         WCHAR        KeyString[1];                                               
              }u;                                                                          
          }CELL_DATA, *PCELL_DATA;                                                         
                                                                                           
          typedef struct _CLIENT_ID       // 2 elements, 0x10 bytes (sizeof) 
          {                                                                  
/*0x000*/     VOID*        UniqueProcess;                                    
/*0x008*/     VOID*        UniqueThread;                                     
          }CLIENT_ID, *PCLIENT_ID;                                           
                                                                             
          typedef struct _CLIENT_ID32     // 2 elements, 0x8 bytes (sizeof) 
          {                                                                 
/*0x000*/     ULONG32      UniqueProcess;                                   
/*0x004*/     ULONG32      UniqueThread;                                    
          }CLIENT_ID32, *PCLIENT_ID32;                                      
                                                                            
          typedef struct _CLIENT_ID64     // 2 elements, 0x10 bytes (sizeof) 
          {                                                                  
/*0x000*/     UINT64       UniqueProcess;                                    
/*0x008*/     UINT64       UniqueThread;                                     
          }CLIENT_ID64, *PCLIENT_ID64;                                       
                                                                             
          typedef union _CLS_LSN             // 2 elements, 0x8 bytes (sizeof) 
          {                                                                    
              struct                         // 2 elements, 0x8 bytes (sizeof) 
              {                                                                
/*0x000*/         UINT32       idxRecord;                                      
/*0x004*/         ULONG32      cidContainer;                                   
              }offset;                                                         
/*0x000*/     UINT64       ullOffset;                                          
          }CLS_LSN, *PCLS_LSN;                                                 
                                                                               
          typedef struct _CM_CACHED_VALUE_INDEX // 2 elements, 0x58 bytes (sizeof) 
          {                                                                        
/*0x000*/     ULONG32      CellIndex;                                              
/*0x004*/     UINT8        _PADDING0_[0x4];                                        
              union                             // 2 elements, 0x50 bytes (sizeof) 
              {                                                                    
/*0x008*/         struct _CELL_DATA CellData;   // 1 elements, 0x50 bytes (sizeof) 
/*0x008*/         UINT64       List[1];                                            
              }Data;                                                               
          }CM_CACHED_VALUE_INDEX, *PCM_CACHED_VALUE_INDEX;                                   
                                                                                   
          typedef struct _CM_CELL_REMAP_BLOCK // 2 elements, 0x8 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      OldCell;                                             
/*0x004*/     ULONG32      NewCell;                                             
          }CM_CELL_REMAP_BLOCK, *PCM_CELL_REMAP_BLOCK;                                  
                                                                                
          typedef struct _CM_PARTIAL_RESOURCE_DESCRIPTOR // 4 elements, 0x14 bytes (sizeof)  
          {                                                                                  
/*0x000*/     UINT8        Type;                                                             
/*0x001*/     UINT8        ShareDisposition;                                                 
/*0x002*/     UINT16       Flags;                                                            
              union                                      // 12 elements, 0x10 bytes (sizeof) 
              {                                                                              
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Generic;                                                                  
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Port;                                                                     
                  struct                                 // 4 elements, 0x10 bytes (sizeof)  
                  {                                                                          
/*0x004*/             UINT16       Level;                                                    
/*0x006*/             UINT16       Group;                                                    
/*0x008*/             ULONG32      Vector;                                                   
/*0x00C*/             UINT64       Affinity;                                                 
                  }Interrupt;                                                                
                  struct                                 // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                          
                      union                              // 2 elements, 0x10 bytes (sizeof)  
                      {                                                                      
                          struct                         // 4 elements, 0x10 bytes (sizeof)  
                          {                                                                  
/*0x004*/                     UINT16       Group;                                            
/*0x006*/                     UINT16       MessageCount;                                     
/*0x008*/                     ULONG32      Vector;                                           
/*0x00C*/                     UINT64       Affinity;                                         
                          }Raw;                                                              
                          struct                         // 4 elements, 0x10 bytes (sizeof)  
                          {                                                                  
/*0x004*/                     UINT16       Level;                                            
/*0x006*/                     UINT16       Group;                                            
/*0x008*/                     ULONG32      Vector;                                           
/*0x00C*/                     UINT64       Affinity;                                         
                          }Translated;                                                       
                      };                                                                     
                  }MessageInterrupt;                                                         
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length;                                                   
                  }Memory;                                                                   
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Channel;                                                  
/*0x008*/             ULONG32      Port;                                                     
/*0x00C*/             ULONG32      Reserved1;                                                
                  }Dma;                                                                      
                  struct                                 // 1 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Data[3];                                                  
                  }DevicePrivate;                                                            
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      Start;                                                    
/*0x008*/             ULONG32      Length;                                                   
/*0x00C*/             ULONG32      Reserved;                                                 
                  }BusNumber;                                                                
                  struct                                 // 3 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             ULONG32      DataSize;                                                 
/*0x008*/             ULONG32      Reserved1;                                                
/*0x00C*/             ULONG32      Reserved2;                                                
                  }DeviceSpecificData;                                                       
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length40;                                                 
                  }Memory40;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length48;                                                 
                  }Memory48;                                                                 
                  struct                                 // 2 elements, 0xC bytes (sizeof)   
                  {                                                                          
/*0x004*/             union _LARGE_INTEGER Start;        // 4 elements, 0x8 bytes (sizeof)   
/*0x00C*/             ULONG32      Length64;                                                 
                  }Memory64;                                                                 
              }u;                                                                            
          }CM_PARTIAL_RESOURCE_DESCRIPTOR, *PCM_PARTIAL_RESOURCE_DESCRIPTOR;                                    
                                                                                             
          typedef struct _CM_PARTIAL_RESOURCE_LIST                          // 4 elements, 0x1C bytes (sizeof) 
          {                                                                                                    
/*0x000*/     UINT16       Version;                                                                            
/*0x002*/     UINT16       Revision;                                                                           
/*0x004*/     ULONG32      Count;                                                                              
/*0x008*/     struct _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[1];                                    
          }CM_PARTIAL_RESOURCE_LIST, *PCM_PARTIAL_RESOURCE_LIST;                                               
                                                                                                               
          typedef struct _CM_FULL_RESOURCE_DESCRIPTOR               // 3 elements, 0x24 bytes (sizeof) 
          {                                                                                            
/*0x000*/     enum _INTERFACE_TYPE InterfaceType;                                                      
/*0x004*/     ULONG32      BusNumber;                                                                  
/*0x008*/     struct _CM_PARTIAL_RESOURCE_LIST PartialResourceList; // 4 elements, 0x1C bytes (sizeof) 
          }CM_FULL_RESOURCE_DESCRIPTOR, *PCM_FULL_RESOURCE_DESCRIPTOR;                                   
                                                                                                       
          typedef struct _CM_INDEX_HINT_BLOCK // 2 elements, 0x8 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      Count;                                               
/*0x004*/     ULONG32      HashKey[1];                                          
          }CM_INDEX_HINT_BLOCK, *PCM_INDEX_HINT_BLOCK;                                  
                                                                                
          typedef struct _CM_INTENT_LOCK       // 2 elements, 0x10 bytes (sizeof) 
          {                                                                       
/*0x000*/     ULONG32      OwnerCount;                                            
/*0x004*/     UINT8        _PADDING0_[0x4];                                       
/*0x008*/     struct _CM_KCB_UOW** OwnerTable;                                    
          }CM_INTENT_LOCK, *PCM_INTENT_LOCK;                                      
                                                                                  
          typedef struct _CM_KCB_UOW                               // 20 elements, 0x60 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _LIST_ENTRY TransactionListEntry;             // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     struct _CM_INTENT_LOCK* KCBLock;                                                         
/*0x018*/     struct _CM_INTENT_LOCK* KeyLock;                                                         
/*0x020*/     struct _LIST_ENTRY KCBListEntry;                     // 2 elements, 0x10 bytes (sizeof)  
/*0x030*/     struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                                           
/*0x038*/     struct _CM_TRANS* Transaction;                                                           
/*0x040*/     ULONG32      UoWState;                                                                   
/*0x044*/     enum _UoWActionType ActionType;                                                          
/*0x048*/     enum _HSTORAGE_TYPE StorageType;                                                         
/*0x04C*/     UINT8        _PADDING0_[0x4];                                                            
              union                                                // 8 elements, 0x10 bytes (sizeof)  
              {                                                                                        
/*0x050*/         struct _CM_KEY_CONTROL_BLOCK* ChildKCB;                                              
/*0x050*/         ULONG32      VolatileKeyCell;                                                        
                  struct                                           // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                    
/*0x050*/             ULONG32      OldValueCell;                                                       
/*0x054*/             ULONG32      NewValueCell;                                                       
/*0x058*/             UINT8        _PADDING1_[0x8];                                                    
                  };                                                                                   
/*0x050*/         ULONG32      UserFlags;                                                              
/*0x050*/         union _LARGE_INTEGER LastWriteTime;              // 4 elements, 0x8 bytes (sizeof)   
/*0x050*/         ULONG32      TxSecurityCell;                                                         
                  struct                                           // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                    
/*0x050*/             struct _CM_KEY_CONTROL_BLOCK* OldChildKCB;                                       
/*0x058*/             struct _CM_KEY_CONTROL_BLOCK* NewChildKCB;                                       
                  };                                                                                   
                  struct                                           // 2 elements, 0x10 bytes (sizeof)  
                  {                                                                                    
/*0x050*/             struct _CM_KEY_CONTROL_BLOCK* OtherChildKCB;                                     
/*0x058*/             ULONG32      ThisVolatileKeyCell;                                                
/*0x05C*/             UINT8        _PADDING2_[0x4];                                                    
                  };                                                                                   
              };                                                                                       
          }CM_KCB_UOW, *PCM_KCB_UOW;                                                                   
                                                                                                       
          typedef struct _CM_KEY_BODY                        // 10 elements, 0x58 bytes (sizeof) 
          {                                                                                      
/*0x000*/     ULONG32      Type;                                                                 
/*0x004*/     UINT8        _PADDING0_[0x4];                                                      
/*0x008*/     struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                                     
/*0x010*/     struct _CM_NOTIFY_BLOCK* NotifyBlock;                                              
/*0x018*/     VOID*        ProcessID;                                                            
/*0x020*/     struct _LIST_ENTRY KeyBodyList;                // 2 elements, 0x10 bytes (sizeof)  
              struct                                         // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                  
/*0x030*/         ULONG32      Flags : 16;                   // 0 BitPosition                    
/*0x030*/         ULONG32      HandleTags : 16;              // 16 BitPosition                   
              };                                                                                 
/*0x038*/     VOID*        KtmTrans;                                                             
/*0x040*/     struct _GUID* KtmUow;                                                              
/*0x048*/     struct _LIST_ENTRY ContextListHead;            // 2 elements, 0x10 bytes (sizeof)  
          }CM_KEY_BODY, *PCM_KEY_BODY;                                                           
                                                                                                 
          typedef struct _CM_KEY_HASH        // 4 elements, 0x20 bytes (sizeof) 
          {                                                                     
/*0x000*/     ULONG32      ConvKey;                                             
/*0x004*/     UINT8        _PADDING0_[0x4];                                     
/*0x008*/     struct _CM_KEY_HASH* NextHash;                                    
/*0x010*/     struct _HHIVE* KeyHive;                                           
/*0x018*/     ULONG32      KeyCell;                                             
/*0x01C*/     UINT8        _PADDING1_[0x4];                                     
          }CM_KEY_HASH, *PCM_KEY_HASH;                                          
                                                                                
          typedef struct _CM_KEY_CONTROL_BLOCK               // 48 elements, 0x128 bytes (sizeof) 
          {                                                                                       
/*0x000*/     ULONG32      RefCount;                                                              
              struct                                         // 7 elements, 0x4 bytes (sizeof)    
              {                                                                                   
/*0x004*/         ULONG32      ExtFlags : 16;                // 0 BitPosition                     
/*0x004*/         ULONG32      PrivateAlloc : 1;             // 16 BitPosition                    
/*0x004*/         ULONG32      Delete : 1;                   // 17 BitPosition                    
/*0x004*/         ULONG32      HiveUnloaded : 1;             // 18 BitPosition                    
/*0x004*/         ULONG32      Decommissioned : 1;           // 19 BitPosition                    
/*0x004*/         ULONG32      LockTablePresent : 1;         // 20 BitPosition                    
/*0x004*/         ULONG32      TotalLevels : 10;             // 21 BitPosition                    
              };                                                                                  
              struct                                         // 3 elements, 0x4 bytes (sizeof)    
              {                                                                                   
/*0x008*/         ULONG32      DelayedDeref : 1;             // 0 BitPosition                     
/*0x008*/         ULONG32      DelayedClose : 1;             // 1 BitPosition                     
/*0x008*/         ULONG32      Parking : 1;                  // 2 BitPosition                     
              };                                                                                  
              union                                          // 2 elements, 0x20 bytes (sizeof)   
              {                                                                                   
/*0x010*/         struct _CM_KEY_HASH KeyHash;               // 4 elements, 0x20 bytes (sizeof)   
                  struct                                     // 4 elements, 0x20 bytes (sizeof)   
                  {                                                                               
/*0x010*/             ULONG32      ConvKey;                                                       
/*0x014*/             UINT8        _PADDING0_[0x4];                                               
/*0x018*/             struct _CM_KEY_HASH* NextHash;                                              
/*0x020*/             struct _HHIVE* KeyHive;                                                     
/*0x028*/             ULONG32      KeyCell;                                                       
/*0x02C*/             UINT8        _PADDING1_[0x4];                                               
                  };                                                                              
              };                                                                                  
/*0x030*/     struct _EX_PUSH_LOCK KcbPushlock;              // 7 elements, 0x8 bytes (sizeof)    
              union                                          // 2 elements, 0x8 bytes (sizeof)    
              {                                                                                   
/*0x038*/         struct _KTHREAD* Owner;                                                         
/*0x038*/         LONG32       SharedCount;                                                       
              };                                                                                  
/*0x040*/     ULONG32      SlotHint;                                                              
/*0x044*/     UINT8        _PADDING2_[0x4];                                                       
/*0x048*/     struct _CM_KEY_CONTROL_BLOCK* ParentKcb;                                            
/*0x050*/     struct _CM_NAME_CONTROL_BLOCK* NameBlock;                                           
/*0x058*/     struct _CM_KEY_SECURITY_CACHE* CachedSecurity;                                      
/*0x060*/     struct _CACHED_CHILD_LIST ValueCache;          // 3 elements, 0x10 bytes (sizeof)   
              union                                          // 3 elements, 0x8 bytes (sizeof)    
              {                                                                                   
/*0x070*/         struct _CM_INDEX_HINT_BLOCK* IndexHint;                                         
/*0x070*/         ULONG32      HashKey;                                                           
/*0x070*/         ULONG32      SubKeyCount;                                                       
              };                                                                                  
              union                                          // 2 elements, 0x10 bytes (sizeof)   
              {                                                                                   
/*0x078*/         struct _LIST_ENTRY KeyBodyListHead;        // 2 elements, 0x10 bytes (sizeof)   
/*0x078*/         struct _LIST_ENTRY FreeListEntry;          // 2 elements, 0x10 bytes (sizeof)   
              };                                                                                  
/*0x088*/     struct _CM_KEY_BODY* KeyBodyArray[4];                                               
/*0x0A8*/     union _LARGE_INTEGER KcbLastWriteTime;         // 4 elements, 0x8 bytes (sizeof)    
/*0x0B0*/     UINT16       KcbMaxNameLen;                                                         
/*0x0B2*/     UINT16       KcbMaxValueNameLen;                                                    
/*0x0B4*/     ULONG32      KcbMaxValueDataLen;                                                    
              struct                                         // 4 elements, 0x4 bytes (sizeof)    
              {                                                                                   
/*0x0B8*/         ULONG32      KcbUserFlags : 4;             // 0 BitPosition                     
/*0x0B8*/         ULONG32      KcbVirtControlFlags : 4;      // 4 BitPosition                     
/*0x0B8*/         ULONG32      KcbDebug : 8;                 // 8 BitPosition                     
/*0x0B8*/         ULONG32      Flags : 16;                   // 16 BitPosition                    
              };                                                                                  
/*0x0C0*/     CHAR*        RealKeyName;                                                           
/*0x0C8*/     struct _LIST_ENTRY KCBUoWListHead;             // 2 elements, 0x10 bytes (sizeof)   
              union                                          // 2 elements, 0x10 bytes (sizeof)   
              {                                                                                   
/*0x0D8*/         struct _LIST_ENTRY DelayQueueEntry;        // 2 elements, 0x10 bytes (sizeof)   
/*0x0D8*/         UINT8*       Stolen;                                                            
              };                                                                                  
/*0x0E8*/     struct _CM_TRANS* TransKCBOwner;                                                    
/*0x0F0*/     struct _CM_INTENT_LOCK KCBLock;                // 2 elements, 0x10 bytes (sizeof)   
/*0x100*/     struct _CM_INTENT_LOCK KeyLock;                // 2 elements, 0x10 bytes (sizeof)   
/*0x110*/     struct _CHILD_LIST TransValueCache;            // 2 elements, 0x8 bytes (sizeof)    
/*0x118*/     struct _CM_TRANS* TransValueListOwner;                                              
/*0x120*/     struct _UNICODE_STRING* FullKCBName;                                                
          }CM_KEY_CONTROL_BLOCK, *PCM_KEY_CONTROL_BLOCK;                                          
                                                                                                  
          typedef struct _CM_KEY_HASH_TABLE_ENTRY // 3 elements, 0x18 bytes (sizeof) 
          {                                                                          
/*0x000*/     struct _EX_PUSH_LOCK Lock;          // 7 elements, 0x8 bytes (sizeof)  
/*0x008*/     struct _KTHREAD* Owner;                                                
/*0x010*/     struct _CM_KEY_HASH* Entry;                                            
          }CM_KEY_HASH_TABLE_ENTRY, *PCM_KEY_HASH_TABLE_ENTRY;                                   
                                                                                     
          typedef struct _CM_KEY_SECURITY_CACHE                // 6 elements, 0x38 bytes (sizeof) 
          {                                                                                       
/*0x000*/     ULONG32      Cell;                                                                  
/*0x004*/     ULONG32      ConvKey;                                                               
/*0x008*/     struct _LIST_ENTRY List;                         // 2 elements, 0x10 bytes (sizeof) 
/*0x018*/     ULONG32      DescriptorLength;                                                      
/*0x01C*/     ULONG32      RealRefCount;                                                          
/*0x020*/     struct _SECURITY_DESCRIPTOR_RELATIVE Descriptor; // 7 elements, 0x14 bytes (sizeof) 
/*0x034*/     UINT8        _PADDING0_[0x4];                                                       
          }CM_KEY_SECURITY_CACHE, *PCM_KEY_SECURITY_CACHE;                                        
                                                                                                  
          typedef struct _CM_KEY_SECURITY_CACHE_ENTRY        // 2 elements, 0x10 bytes (sizeof) 
          {                                                                                     
/*0x000*/     ULONG32      Cell;                                                                
/*0x004*/     UINT8        _PADDING0_[0x4];                                                     
/*0x008*/     struct _CM_KEY_SECURITY_CACHE* CachedSecurity;                                    
          }CM_KEY_SECURITY_CACHE_ENTRY, *PCM_KEY_SECURITY_CACHE_ENTRY;                                   
                                                                                                
          typedef struct _CM_NAME_HASH        // 4 elements, 0x18 bytes (sizeof) 
          {                                                                      
/*0x000*/     ULONG32      ConvKey;                                              
/*0x004*/     UINT8        _PADDING0_[0x4];                                      
/*0x008*/     struct _CM_NAME_HASH* NextHash;                                    
/*0x010*/     UINT16       NameLength;                                           
/*0x012*/     WCHAR        Name[1];                                              
/*0x014*/     UINT8        _PADDING1_[0x4];                                      
          }CM_NAME_HASH, *PCM_NAME_HASH;                                         
                                                                                 
          typedef struct _CM_NAME_CONTROL_BLOCK      // 7 elements, 0x20 bytes (sizeof) 
          {                                                                             
/*0x000*/     UINT8        Compressed;                                                  
/*0x001*/     UINT8        _PADDING0_[0x1];                                             
/*0x002*/     UINT16       RefCount;                                                    
/*0x004*/     UINT8        _PADDING1_[0x4];                                             
              union                                  // 2 elements, 0x18 bytes (sizeof) 
              {                                                                         
/*0x008*/         struct _CM_NAME_HASH NameHash;     // 4 elements, 0x18 bytes (sizeof) 
                  struct                             // 4 elements, 0x18 bytes (sizeof) 
                  {                                                                     
/*0x008*/             ULONG32      ConvKey;                                             
/*0x00C*/             UINT8        _PADDING2_[0x4];                                     
/*0x010*/             struct _CM_KEY_HASH* NextHash;                                    
/*0x018*/             UINT16       NameLength;                                          
/*0x01A*/             WCHAR        Name[1];                                             
/*0x01C*/             UINT8        _PADDING3_[0x4];                                     
                  };                                                                    
              };                                                                        
          }CM_NAME_CONTROL_BLOCK, *PCM_NAME_CONTROL_BLOCK;                                   
                                                                                        
          typedef struct _CM_NOTIFY_BLOCK                      // 8 elements, 0x58 bytes (sizeof) 
          {                                                                                       
/*0x000*/     struct _LIST_ENTRY HiveList;                     // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     struct _LIST_ENTRY PostList;                     // 2 elements, 0x10 bytes (sizeof) 
/*0x020*/     struct _CM_KEY_CONTROL_BLOCK* KeyControlBlock;                                      
/*0x028*/     struct _CM_KEY_BODY* KeyBody;                                                       
              struct                                           // 3 elements, 0x4 bytes (sizeof)  
              {                                                                                   
/*0x030*/         ULONG32      Filter : 30;                    // 0 BitPosition                   
/*0x030*/         ULONG32      WatchTree : 1;                  // 30 BitPosition                  
/*0x030*/         ULONG32      NotifyPending : 1;              // 31 BitPosition                  
              };                                                                                  
/*0x038*/     struct _SECURITY_SUBJECT_CONTEXT SubjectContext; // 4 elements, 0x20 bytes (sizeof) 
          }CM_NOTIFY_BLOCK, *PCM_NOTIFY_BLOCK;                                                    
                                                                                                  
          typedef struct _CM_RESOURCE_LIST                 // 2 elements, 0x28 bytes (sizeof) 
          {                                                                                   
/*0x000*/     ULONG32      Count;                                                             
/*0x004*/     struct _CM_FULL_RESOURCE_DESCRIPTOR List[1];                                    
          }CM_RESOURCE_LIST, *PCM_RESOURCE_LIST;                                              
                                                                                              
          typedef struct _CM_RM                       // 17 elements, 0x88 bytes (sizeof) 
          {                                                                               
/*0x000*/     struct _LIST_ENTRY RmListEntry;         // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     struct _LIST_ENTRY TransactionListHead; // 2 elements, 0x10 bytes (sizeof)  
/*0x020*/     VOID*        TmHandle;                                                      
/*0x028*/     VOID*        Tm;                                                            
/*0x030*/     VOID*        RmHandle;                                                      
/*0x038*/     VOID*        KtmRm;                                                         
/*0x040*/     ULONG32      RefCount;                                                      
/*0x044*/     ULONG32      ContainerNum;                                                  
/*0x048*/     UINT64       ContainerSize;                                                 
/*0x050*/     struct _CMHIVE* CmHive;                                                     
/*0x058*/     VOID*        LogFileObject;                                                 
/*0x060*/     VOID*        MarshallingContext;                                            
/*0x068*/     ULONG32      RmFlags;                                                       
/*0x06C*/     LONG32       LogStartStatus1;                                               
/*0x070*/     LONG32       LogStartStatus2;                                               
/*0x074*/     UINT8        _PADDING0_[0x4];                                               
/*0x078*/     UINT64       BaseLsn;                                                       
/*0x080*/     struct _ERESOURCE* RmLock;                                                  
          }CM_RM, *PCM_RM;                                                                
                                                                                          
          typedef struct _CM_TRANS                      // 12 elements, 0xA8 bytes (sizeof) 
          {                                                                                 
/*0x000*/     struct _LIST_ENTRY TransactionListEntry;  // 2 elements, 0x10 bytes (sizeof)  
/*0x010*/     struct _LIST_ENTRY KCBUoWListHead;        // 2 elements, 0x10 bytes (sizeof)  
/*0x020*/     struct _LIST_ENTRY LazyCommitListEntry;   // 2 elements, 0x10 bytes (sizeof)  
/*0x030*/     VOID*        KtmTrans;                                                        
/*0x038*/     struct _CM_RM* CmRm;                                                          
/*0x040*/     struct _KENLISTMENT* KtmEnlistmentObject;                                     
/*0x048*/     VOID*        KtmEnlistmentHandle;                                             
/*0x050*/     struct _GUID KtmUow;                      // 4 elements, 0x10 bytes (sizeof)  
/*0x060*/     UINT64       StartLsn;                                                        
/*0x068*/     ULONG32      TransState;                                                      
/*0x06C*/     ULONG32      HiveCount;                                                       
/*0x070*/     struct _CMHIVE* HiveArray[7];                                                 
          }CM_TRANS, *PCM_TRANS;                                                            
                                                                                            
          typedef struct _CM_VIEW_OF_FILE          // 9 elements, 0x58 bytes (sizeof) 
          {                                                                           
/*0x000*/     struct _LIST_ENTRY MappedViewLinks;  // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     struct _LIST_ENTRY PinnedViewLinks;  // 2 elements, 0x10 bytes (sizeof) 
/*0x020*/     struct _LIST_ENTRY FlushedViewLinks; // 2 elements, 0x10 bytes (sizeof) 
/*0x030*/     struct _CMHIVE* CmHive;                                                 
/*0x038*/     VOID*        Bcb;                                                       
/*0x040*/     VOID*        ViewAddress;                                               
/*0x048*/     ULONG32      FileOffset;                                                
/*0x04C*/     ULONG32      Size;                                                      
/*0x050*/     ULONG32      UseCount;                                                  
/*0x054*/     UINT8        _PADDING0_[0x4];                                           
          }CM_VIEW_OF_FILE, *PCM_VIEW_OF_FILE;                                        
                                                                                      
          typedef struct _CM_WORKITEM                                                                                                                                                   // 4 elements, 0x28 bytes (sizeof) 
          {                                                                                                                                                                                                                
/*0x000*/     struct _LIST_ENTRY ListEntry;                                                                                                                                             // 2 elements, 0x10 bytes (sizeof) 
/*0x010*/     ULONG32      Private;                                                                                                                                                                                        
/*0x014*/     UINT8        _PADDING0_[0x4];                                                                                                                                                                                
/*0x018*/     FUNCT_00A3_0728_Free_IdleHandler_InterfaceReference_InterfaceDereference_DeleteProcedure_WorkerRoutine_Callback_ReleaseFromLazyWrite_ReleaseFromReadAhead* WorkerRoutine;                                    
/*0x020*/     VOID*        Parameter;                                                                                                                                                                                      
          }CM_WORKITEM, *PCM_WORKITEM;                                                                                                                                                                                     
                                                                                                                                                                                                                           
          typedef struct _RTL_BITMAP        // 2 elements, 0x10 bytes (sizeof) 
          {                                                                    
/*0x000*/     ULONG32      SizeOfBitMap;                                       
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     ULONG32*     Buffer;                                             
          }RTL_BITMAP, *PRTL_BITMAP;                                           
                                                                               
          typedef struct _FREE_DISPLAY      // 2 elements, 0x18 bytes (sizeof) 
          {                                                                    
/*0x000*/     ULONG32      RealVectorSize;                                     
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     struct _RTL_BITMAP Display;   // 2 elements, 0x10 bytes (sizeof) 
          }FREE_DISPLAY, *PFREE_DISPLAY;                                       
                                                                               
          typedef struct _DUAL                      // 7 elements, 0x278 bytes (sizeof) 
          {                                                                             
/*0x000*/     ULONG32      Length;                                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                             
/*0x008*/     struct _HMAP_DIRECTORY* Map;                                              
/*0x010*/     struct _HMAP_TABLE* SmallDir;                                             
/*0x018*/     ULONG32      Guard;                                                       
/*0x01C*/     UINT8        _PADDING1_[0x4];                                             
/*0x020*/     struct _FREE_DISPLAY FreeDisplay[24];                                     
/*0x260*/     ULONG32      FreeSummary;                                                 
/*0x264*/     UINT8        _PADDING2_[0x4];                                             
/*0x268*/     struct _LIST_ENTRY FreeBins;          // 2 elements, 0x10 bytes (sizeof)  
          }DUAL, *PDUAL;                                                                
                                                                                        
          typedef struct _HHIVE                                       // 30 elements, 0x598 bytes (sizeof) 
          {                                                                                                
/*0x000*/     ULONG32      Signature;                                                                      
/*0x004*/     UINT8        _PADDING0_[0x4];                                                                
/*0x008*/     FUNCT_1420_141F_GetCellRoutine* GetCellRoutine;                                              
/*0x010*/     FUNCT_00A3_146E_ReleaseCellRoutine* ReleaseCellRoutine;                                      
/*0x018*/     FUNCT_00A6_1470_Allocate* Allocate;                                                          
/*0x020*/     FUNCT_00A3_1475_Free* Free;                                                                  
/*0x028*/     FUNCT_0065_1479_FileSetSize* FileSetSize;                                                    
/*0x030*/     FUNCT_0065_147F_FileWrite* FileWrite;                                                        
/*0x038*/     FUNCT_0065_148B_FileRead* FileRead;                                                          
/*0x040*/     FUNCT_0065_1492_FileFlush* FileFlush;                                                        
/*0x048*/     VOID*        HiveLoadFailure;                                                                
/*0x050*/     struct _HBASE_BLOCK* BaseBlock;                                                              
/*0x058*/     struct _RTL_BITMAP DirtyVector;                         // 2 elements, 0x10 bytes (sizeof)   
/*0x068*/     ULONG32      DirtyCount;                                                                     
/*0x06C*/     ULONG32      DirtyAlloc;                                                                     
/*0x070*/     ULONG32      BaseBlockAlloc;                                                                 
/*0x074*/     ULONG32      Cluster;                                                                        
/*0x078*/     UINT8        Flat;                                                                           
/*0x079*/     UINT8        ReadOnly;                                                                       
/*0x07A*/     UINT8        DirtyFlag;                                                                      
/*0x07B*/     UINT8        _PADDING1_[0x1];                                                                
/*0x07C*/     ULONG32      HvBinHeadersUse;                                                                
/*0x080*/     ULONG32      HvFreeCellsUse;                                                                 
/*0x084*/     ULONG32      HvUsedCellsUse;                                                                 
/*0x088*/     ULONG32      CmUsedCellsUse;                                                                 
/*0x08C*/     ULONG32      HiveFlags;                                                                      
/*0x090*/     ULONG32      CurrentLog;                                                                     
/*0x094*/     ULONG32      LogSize[2];                                                                     
/*0x09C*/     ULONG32      RefreshCount;                                                                   
/*0x0A0*/     ULONG32      StorageTypeCount;                                                               
/*0x0A4*/     ULONG32      Version;                                                                        
/*0x0A8*/     struct _DUAL Storage[2];                                                                     
          }HHIVE, *PHHIVE;                                                                                 
                                                                                                           
          typedef struct _EX_RUNDOWN_REF // 2 elements, 0x8 bytes (sizeof) 
          {                                                                
              union                      // 2 elements, 0x8 bytes (sizeof) 
              {                                                            
/*0x000*/         UINT64       Count;                                      
/*0x000*/         VOID*        Ptr;                                        
              };                                                           
          }EX_RUNDOWN_REF, *PEX_RUNDOWN_REF;                                  
                                                                           
          typedef struct _CMHIVE                                  // 60 elements, 0xBE0 bytes (sizeof) 
          {                                                                                            
/*0x000*/     struct _HHIVE Hive;                                 // 30 elements, 0x598 bytes (sizeof) 
/*0x598*/     VOID*        FileHandles[6];                                                             
/*0x5C8*/     struct _LIST_ENTRY NotifyList;                      // 2 elements, 0x10 bytes (sizeof)   
/*0x5D8*/     struct _LIST_ENTRY HiveList;                        // 2 elements, 0x10 bytes (sizeof)   
/*0x5E8*/     struct _LIST_ENTRY PreloadedHiveList;               // 2 elements, 0x10 bytes (sizeof)   
/*0x5F8*/     struct _EX_RUNDOWN_REF HiveRundown;                 // 2 elements, 0x8 bytes (sizeof)    
/*0x600*/     struct _LIST_ENTRY ParseCacheEntries;               // 2 elements, 0x10 bytes (sizeof)   
/*0x610*/     struct _CM_KEY_HASH_TABLE_ENTRY* KcbCacheTable;                                          
/*0x618*/     ULONG32      KcbCacheTableSize;                                                          
/*0x61C*/     ULONG32      Identity;                                                                   
/*0x620*/     struct _FAST_MUTEX* HiveLock;                                                            
/*0x628*/     struct _EX_PUSH_LOCK ViewLock;                      // 7 elements, 0x8 bytes (sizeof)    
/*0x630*/     struct _KTHREAD* ViewLockOwner;                                                          
/*0x638*/     ULONG32      ViewLockLast;                                                               
/*0x63C*/     ULONG32      ViewUnLockLast;                                                             
/*0x640*/     struct _FAST_MUTEX* WriterLock;                                                          
/*0x648*/     struct _ERESOURCE* FlusherLock;                                                          
/*0x650*/     struct _RTL_BITMAP FlushDirtyVector;                // 2 elements, 0x10 bytes (sizeof)   
/*0x660*/     struct _CMP_OFFSET_ARRAY* FlushOffsetArray;                                              
/*0x668*/     ULONG32      FlushOffsetArrayCount;                                                      
/*0x66C*/     ULONG32      FlushHiveTruncated;                                                         
/*0x670*/     struct _FAST_MUTEX* FlushLock2;                                                          
/*0x678*/     struct _EX_PUSH_LOCK SecurityLock;                  // 7 elements, 0x8 bytes (sizeof)    
/*0x680*/     struct _LIST_ENTRY MappedViewList;                  // 2 elements, 0x10 bytes (sizeof)   
/*0x690*/     struct _LIST_ENTRY PinnedViewList;                  // 2 elements, 0x10 bytes (sizeof)   
/*0x6A0*/     struct _LIST_ENTRY FlushedViewList;                 // 2 elements, 0x10 bytes (sizeof)   
/*0x6B0*/     UINT16       MappedViewCount;                                                            
/*0x6B2*/     UINT16       PinnedViewCount;                                                            
/*0x6B4*/     ULONG32      UseCount;                                                                   
/*0x6B8*/     ULONG32      ViewsPerHive;                                                               
/*0x6BC*/     UINT8        _PADDING0_[0x4];                                                            
/*0x6C0*/     struct _FILE_OBJECT* FileObject;                                                         
/*0x6C8*/     ULONG32      LastShrinkHiveSize;                                                         
/*0x6CC*/     UINT8        _PADDING1_[0x4];                                                            
/*0x6D0*/     union _LARGE_INTEGER ActualFileSize;                // 4 elements, 0x8 bytes (sizeof)    
/*0x6D8*/     struct _UNICODE_STRING FileFullPath;                // 3 elements, 0x10 bytes (sizeof)   
/*0x6E8*/     struct _UNICODE_STRING FileUserName;                // 3 elements, 0x10 bytes (sizeof)   
/*0x6F8*/     struct _UNICODE_STRING HiveRootPath;                // 3 elements, 0x10 bytes (sizeof)   
/*0x708*/     ULONG32      SecurityCount;                                                              
/*0x70C*/     ULONG32      SecurityCacheSize;                                                          
/*0x710*/     LONG32       SecurityHitHint;                                                            
/*0x714*/     UINT8        _PADDING2_[0x4];                                                            
/*0x718*/     struct _CM_KEY_SECURITY_CACHE_ENTRY* SecurityCache;                                      
/*0x720*/     struct _LIST_ENTRY SecurityHash[64];                                                     
/*0xB20*/     ULONG32      UnloadEventCount;                                                           
/*0xB24*/     UINT8        _PADDING3_[0x4];                                                            
/*0xB28*/     struct _KEVENT** UnloadEventArray;                                                       
/*0xB30*/     struct _CM_KEY_CONTROL_BLOCK* RootKcb;                                                   
/*0xB38*/     UINT8        Frozen;                                                                     
/*0xB39*/     UINT8        _PADDING4_[0x7];                                                            
/*0xB40*/     struct _CM_WORKITEM* UnloadWorkItem;                                                     
/*0xB48*/     struct _CM_WORKITEM UnloadWorkItemHolder;           // 4 elements, 0x28 bytes (sizeof)   
/*0xB70*/     UINT8        GrowOnlyMode;                                                               
/*0xB71*/     UINT8        _PADDING5_[0x3];                                                            
/*0xB74*/     ULONG32      GrowOffset;                                                                 
/*0xB78*/     struct _LIST_ENTRY KcbConvertListHead;              // 2 elements, 0x10 bytes (sizeof)   
/*0xB88*/     struct _LIST_ENTRY KnodeConvertListHead;            // 2 elements, 0x10 bytes (sizeof)   
/*0xB98*/     struct _CM_CELL_REMAP_BLOCK* CellRemapArray;                                             
/*0xBA0*/     ULONG32      Flags;                                                                      
/*0xBA4*/     UINT8        _PADDING6_[0x4];                                                            
/*0xBA8*/     struct _LIST_ENTRY TrustClassEntry;                 // 2 elements, 0x10 bytes (sizeof)   
/*0xBB8*/     ULONG32      FlushCount;                                                                 
/*0xBBC*/     UINT8        _PADDING7_[0x4];                                                            
/*0xBC0*/     struct _CM_RM* CmRm;                                                                     
/*0xBC8*/     ULONG32      CmRmInitFailPoint;                                                          
/*0xBCC*/     LONG32       CmRmInitFailStatus;                                                         
/*0xBD0*/     struct _KTHREAD* CreatorOwner;                                                           
/*0xBD8*/     struct _KTHREAD* RundownThread;                                                          
          }CMHIVE, *PCMHIVE;                                                                           
                                                                                                       
          typedef struct _CMP_OFFSET_ARRAY  // 3 elements, 0x18 bytes (sizeof) 
          {                                                                    
/*0x000*/     ULONG32      FileOffset;                                         
/*0x004*/     UINT8        _PADDING0_[0x4];                                    
/*0x008*/     VOID*        DataBuffer;                                         
/*0x010*/     ULONG32      DataLength;                                         
/*0x014*/     UINT8        _PADDING1_[0x4];                                    
          }CMP_OFFSET_ARRAY, *PCMP_OFFSET_ARRAY;                                   
                                                                               
          typedef struct _COMPRESSED_DATA_INFO         // 7 elements, 0xC bytes (sizeof) 
          {                                                                              
/*0x000*/     UINT16       CompressionFormatAndEngine;                                   
/*0x002*/     UINT8        CompressionUnitShift;                                         
/*0x003*/     UINT8        ChunkShift;                                                   
/*0x004*/     UINT8        ClusterShift;                                                 
/*0x005*/     UINT8        Reserved;                                                     
/*0x006*/     UINT16       NumberOfChunks;                                               
/*0x008*/     ULONG32      CompressedChunkSizes[1];                                      
          }COMPRESSED_DATA_INFO, *PCOMPRESSED_DATA_INFO;                                  
                                                                                         
          typedef struct _DEVICE_FLAGS     // 7 elements, 0x4 bytes (sizeof) 
          {                                                                  
/*0x000*/     ULONG32      Failed : 1;     // 0 BitPosition                  
/*0x000*/     ULONG32      ReadOnly : 1;   // 1 BitPosition                  
/*0x000*/     ULONG32      Removable : 1;  // 2 BitPosition                  
/*0x000*/     ULONG32      ConsoleIn : 1;  // 3 BitPosition                  
/*0x000*/     ULONG32      ConsoleOut : 1; // 4 BitPosition                  
/*0x000*/     ULONG32      Input : 1;      // 5 BitPosition                  
/*0x000*/     ULONG32      Output : 1;     // 6 BitPosition                  
          }DEVICE_FLAGS, *PDEVICE_FLAGS;                                     
                                                                             
          typedef struct _CONFIGURATION_COMPONENT   // 12 elements, 0x28 bytes (sizeof) 
          {                                                                             
/*0x000*/     enum _CONFIGURATION_CLASS Class;                                          
/*0x004*/     enum _CONFIGURATION_TYPE Type;                                            
/*0x008*/     struct _DEVICE_FLAGS Flags;           // 7 elements, 0x4 bytes (sizeof)   
/*0x00C*/     UINT16       Version;                                                     
/*0x00E*/     UINT16       Revision;                                                    
/*0x010*/     ULONG32      Key;                                                         
              union                                 // 2 elements, 0x4 bytes (sizeof)   
              {                                                                         
/*0x014*/         ULONG32      AffinityMask;                                            
                  struct                            // 2 elements, 0x4 bytes (sizeof)   
                  {                                                                     
/*0x014*/             UINT16       Group;                                               
/*0x016*/             UINT16       GroupIndex;                                          
                  };                                                                    
              };                                                                        
/*0x018*/     ULONG32      ConfigurationDataLength;                                     
/*0x01C*/     ULONG32      IdentifierLength;                                            
/*0x020*/     CHAR*        Identifier;                                                  
          }CONFIGURATION_COMPONENT, *PCONFIGURATION_COMPONENT;                                    
                                                                                        
          typedef struct _CONFIGURATION_COMPONENT_DATA        // 5 elements, 0x48 bytes (sizeof)  
          {                                                                                       
/*0x000*/     struct _CONFIGURATION_COMPONENT_DATA* Parent;                                       
/*0x008*/     struct _CONFIGURATION_COMPONENT_DATA* Child;                                        
/*0x010*/     struct _CONFIGURATION_COMPONENT_DATA* Sibling;                                      
/*0x018*/     struct _CONFIGURATION_COMPONENT ComponentEntry; // 12 elements, 0x28 bytes (sizeof) 
/*0x040*/     VOID*        ConfigurationData;                                                     
          }CONFIGURATION_COMPONENT_DATA, *PCONFIGURATION_COMPONENT_DATA;                                    
                                                                                                  
          typedef struct _M128A  // 2 elements, 0x10 bytes (sizeof) 
          {                                                         
/*0x000*/     UINT64       Low;                                     
/*0x008*/     INT64        High;                                    
          }M128A, *PM128A;                                          
                                                                    
          typedef struct _XSAVE_FORMAT         // 16 elements, 0x200 bytes (sizeof) 
          {                                                                         
/*0x000*/     UINT16       ControlWord;                                             
/*0x002*/     UINT16       StatusWord;                                              
/*0x004*/     UINT8        TagWord;                                                 
/*0x005*/     UINT8        Reserved1;                                               
/*0x006*/     UINT16       ErrorOpcode;                                             
/*0x008*/     ULONG32      ErrorOffset;                                             
/*0x00C*/     UINT16       ErrorSelector;                                           
/*0x00E*/     UINT16       Reserved2;                                               
/*0x010*/     ULONG32      DataOffset;                                              
/*0x014*/     UINT16       DataSelector;                                            
/*0x016*/     UINT16       Reserved3;                                               
/*0x018*/     ULONG32      MxCsr;                                                   
/*0x01C*/     ULONG32      MxCsr_Mask;                                              
/*0x020*/     struct _M128A FloatRegisters[8];                                      
/*0x0A0*/     struct _M128A XmmRegisters[16];                                       
/*0x1A0*/     UINT8        Reserved4[96];                                           
          }XSAVE_FORMAT, *PXSAVE_FORMAT;                                            
                                                                                    
          typedef struct _CONTEXT                    // 64 elements, 0x4D0 bytes (sizeof) 
          {                                                                               
/*0x000*/     UINT64       P1Home;                                                        
/*0x008*/     UINT64       P2Home;                                                        
/*0x010*/     UINT64       P3Home;                                                        
/*0x018*/     UINT64       P4Home;                                                        
/*0x020*/     UINT64       P5Home;                                                        
/*0x028*/     UINT64       P6Home;                                                        
/*0x030*/     ULONG32      ContextFlags;                                                  
/*0x034*/     ULONG32      MxCsr;                                                         
/*0x038*/     UINT16       SegCs;                                                         
/*0x03A*/     UINT16       SegDs;                                                         
/*0x03C*/     UINT16       SegEs;                                                         
/*0x03E*/     UINT16       SegFs;                                                         
/*0x040*/     UINT16       SegGs;                                                         
/*0x042*/     UINT16       SegSs;                                                         
/*0x044*/     ULONG32      EFlags;                                                        
/*0x048*/     UINT64       Dr0;                                                           
/*0x050*/     UINT64       Dr1;                                                           
/*0x058*/     UINT64       Dr2;                                                           
/*0x060*/     UINT64       Dr3;                                                           
/*0x068*/     UINT64       Dr6;                                                           
/*0x070*/     UINT64       Dr7;                                                           
/*0x078*/     UINT64       Rax;                                                           
/*0x080*/     UINT64       Rcx;                                                           
/*0x088*/     UINT64       Rdx;                                                           
/*0x090*/     UINT64       Rbx;                                                           
/*0x098*/     UINT64       Rsp;                                                           
/*0x0A0*/     UINT64       Rbp;                                                           
/*0x0A8*/     UINT64       Rsi;                                                           
/*0x0B0*/     UINT64       Rdi;                                                           
/*0x0B8*/     UINT64       R8;                                                            
/*0x0C0*/     UINT64       R9;                                                            
/*0x0C8*/     UINT64       R10;                                                           
/*0x0D0*/     UINT64       R11;                                                           
/*0x0D8*/     UINT64       R12;                                                           
/*0x0E0*/     UINT64       R13;                                                           
/*0x0E8*/     UINT64       R14;                                                           
/*0x0F0*/     UINT64       R15;                                                           
/*0x0F8*/     UINT64       Rip;                                                           
              union                                  // 2 elements, 0x200 bytes (sizeof)  
              {                                                                           
/*0x100*/         struct _XSAVE_FORMAT FltSave;      // 16 elements, 0x200 bytes (sizeof) 
                  struct                             // 18 elements, 0x200 bytes (sizeof) 
                  {                                                                       
/*0x100*/             struct _M128A Header[2];                                            
/*0x120*/             struct _M128A Legacy[8];                                            
/*0x1A0*/             struct _M128A Xmm0;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1B0*/             struct _M128A Xmm1;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1C0*/             struct _M128A Xmm2;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1D0*/             struct _M128A Xmm3;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1E0*/             struct _M128A Xmm4;            // 2 elements, 0x10 bytes (sizeof)   
/*0x1F0*/             struct _M128A Xmm5;            // 2 elements, 0x10 bytes (sizeof)   
/*0x200*/             struct _M128A Xmm6;            // 2 elements, 0x10 bytes (sizeof)   
/*0x210*/             struct _M128A Xmm7;            // 2 elements, 0x10 bytes (sizeof)   
/*0x220*/             struct _M128A Xmm8;            // 2 elements, 0x10 bytes (sizeof)   
/*0x230*/             struct _M128A Xmm9;            // 2 elements, 0x10 bytes (sizeof)   
/*0x240*/             struct _M128A Xmm10;           // 2 elements, 0x10 bytes (sizeof)   
/*0x250*/             struct _M128A Xmm11;           // 2 elements, 0x10 bytes (sizeof)   
/*0x260*/             struct _M128A Xmm12;           // 2 elements, 0x10 bytes (sizeof)   
/*0x270*/             struct _M128A Xmm13;           // 2 elements, 0x10 bytes (sizeof)   
/*0x280*/             struct _M128A Xmm14;           // 2 elements, 0x10 bytes (sizeof)   
/*0x290*/             struct _M128A Xmm15;           // 2 elements, 0x10 bytes (sizeof)   
/*0x2A0*/             UINT8        _PADDING0_[0x60];                                      
                  };                                                                      
              };                                                                          
/*0x300*/     struct _M128A VectorRegister[26];                                           
/*0x4A0*/     UINT64       VectorControl;                                                 
/*0x4A8*/     UINT64       DebugControl;                                                  
/*0x4B0*/     UINT64       LastBranchToRip;                                               
/*0x4B8*/     UINT64       LastBranchFromRip;                                             
/*0x4C0*/     UINT64       LastExceptionToRip;                                            
/*0x4C8*/     UINT64       LastExceptionFromRip;                                          
          }CONTEXT, *PCONTEXT;                                                            
                                                                                          
          typedef struct _CONTEXT32_UPDATE // 1 elements, 0x4 bytes (sizeof) 
          {                                                                  
/*0x000*/     ULONG32      NumberEntries;                                    
          }CONTEXT32_UPDATE, *PCONTEXT32_UPDATE;                                  
                                                                             
          typedef struct _MMSECTION_FLAGS               // 27 elements, 0x4 bytes (sizeof) 
          {                                                                                
/*0x000*/     UINT32       BeingDeleted : 1;            // 0 BitPosition                   
/*0x000*/     UINT32       BeingCreated : 1;            // 1 BitPosition                   
/*0x000*/     UINT32       BeingPurged : 1;             // 2 BitPosition                   
/*0x000*/     UINT32       NoModifiedWriting : 1;       // 3 BitPosition                   
/*0x000*/     UINT32       FailAllIo : 1;               // 4 BitPosition                   
/*0x000*/     UINT32       Image : 1;                   // 5 BitPosition                   
/*0x000*/     UINT32       Based : 1;                   // 6 BitPosition                   
/*0x000*/     UINT32       File : 1;                    // 7 BitPosition                   
/*0x000*/     UINT32       Networked : 1;               // 8 BitPosition                   
/*0x000*/     UINT32       Rom : 1;                     // 9 BitPosition                   
/*0x000*/     UINT32       PhysicalMemory : 1;          // 10 BitPosition                  
/*0x000*/     UINT32       CopyOnWrite : 1;             // 11 BitPosition                  
/*0x000*/     UINT32       Reserve : 1;                 // 12 BitPosition                  
/*0x000*/     UINT32       Commit : 1;                  // 13 BitPosition                  
/*0x000*/     UINT32       Accessed : 1;                // 14 BitPosition                  
/*0x000*/     UINT32       WasPurged : 1;               // 15 BitPosition                  
/*0x000*/     UINT32       UserReference : 1;           // 16 BitPosition                  
/*0x000*/     UINT32       GlobalMemory : 1;            // 17 BitPosition                  
/*0x000*/     UINT32       DeleteOnClose : 1;           // 18 BitPosition                  
/*0x000*/     UINT32       FilePointerNull : 1;         // 19 BitPosition                  
/*0x000*/     UINT32       GlobalOnlyPerSession : 1;    // 20 BitPosition                  
/*0x000*/     UINT32       SetMappedFileIoComplete : 1; // 21 BitPosition                  
/*0x000*/     UINT32       CollidedFlush : 1;           // 22 BitPosition                  
/*0x000*/     UINT32       NoChange : 1;                // 23 BitPosition                  
/*0x000*/     UINT32       Spare : 1;                   // 24 BitPosition                  
/*0x000*/     UINT32       UserWritable : 1;            // 25 BitPosition                  
/*0x000*/     UINT32       PreferredNode : 6;           // 26 BitPosition                  
          }MMSECTION_FLAGS, *PMMSECTION_FLAGS;                                             
                                                                                           
          typedef struct _EX_FAST_REF      // 3 elements, 0x8 bytes (sizeof) 
          {                                                                  
              union                        // 3 elements, 0x8 bytes (sizeof) 
              {                                                              
/*0x000*/         VOID*        Object;                                       
/*0x000*/         UINT64       RefCnt : 4; // 0 BitPosition                  
/*0x000*/         UINT64       Value;                                        
              };                                                             
          }EX_FAST_REF, *PEX_FAST_REF;                                       
                                                                             
          typedef struct _CONTROL_AREA                                      // 16 elements, 0x80 bytes (sizeof) 
          {                                                                                                     
/*0x000*/     struct _SEGMENT* Segment;                                                                         
/*0x008*/     struct _LIST_ENTRY DereferenceList;                           // 2 elements, 0x10 bytes (sizeof)  
/*0x018*/     UINT64       NumberOfSectionReferences;                                                           
/*0x020*/     UINT64       NumberOfPfnReferences;                                                               
/*0x028*/     UINT64       NumberOfMappedViews;                                                                 
/*0x030*/     UINT64       NumberOfUserReferences;                                                              
              union                                                         // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                 
/*0x038*/         ULONG32      LongFlags;                                                                       
/*0x038*/         struct _MMSECTION_FLAGS Flags;                            // 27 elements, 0x4 bytes (sizeof)  
              }u;                                                                                               
/*0x03C*/     ULONG32      FlushInProgressCount;                                                                
/*0x040*/     struct _EX_FAST_REF FilePointer;                              // 3 elements, 0x8 bytes (sizeof)   
/*0x048*/     LONG32       ControlAreaLock;                                                                     
              union                                                         // 2 elements, 0x4 bytes (sizeof)   
              {                                                                                                 
/*0x04C*/         ULONG32      ModifiedWriteCount;                                                              
/*0x04C*/         ULONG32      StartingFrame;                                                                   
              };                                                                                                
/*0x050*/     struct _MI_SECTION_CREATION_GATE* WaitingForDeletion;                                             
              union                                                         // 1 elements, 0x10 bytes (sizeof)  
              {                                                                                                 
                  struct                                                    // 9 elements, 0x10 bytes (sizeof)  
                  {                                                                                             
                      union                                                 // 2 elements, 0x4 bytes (sizeof)   
                      {                                                                                         
/*0x058*/                 ULONG32      NumberOfSystemCacheViews;                                                
/*0x058*/                 ULONG32      ImageRelocationStartBit;                                                 
                      };                                                                                        
                      union                                                 // 2 elements, 0x4 bytes (sizeof)   
                      {                                                                                         
/*0x05C*/                 LONG32       WritableUserReferences;                                                  
                          struct                                            // 4 elements, 0x4 bytes (sizeof)   
                          {                                                                                     
/*0x05C*/                     ULONG32      ImageRelocationSizeIn64k : 16;   // 0 BitPosition                    
/*0x05C*/                     ULONG32      Unused : 14;                     // 16 BitPosition                   
/*0x05C*/                     ULONG32      BitMap64 : 1;                    // 30 BitPosition                   
/*0x05C*/                     ULONG32      ImageActive : 1;                 // 31 BitPosition                   
                          };                                                                                    
                      };                                                                                        
                      union                                                 // 2 elements, 0x8 bytes (sizeof)   
                      {                                                                                         
/*0x060*/                 struct _MM_SUBSECTION_AVL_TABLE* SubsectionRoot;                                      
/*0x060*/                 struct _MI_IMAGE_SECURITY_REFERENCE* SeImageStub;                                     
                      };                                                                                        
                  }e2;                                                                                          
              }u2;                                                                                              
/*0x068*/     INT64        LockedPages;                                                                         
/*0x070*/     struct _LIST_ENTRY ViewList;                                  // 2 elements, 0x10 bytes (sizeof)  
          }CONTROL_AREA, *PCONTROL_AREA;                                                                        
                                                                                                                
          typedef struct _COUNTER_READING       // 4 elements, 0x18 bytes (sizeof) 
          {                                                                        
/*0x000*/     enum _HARDWARE_COUNTER_TYPE Type;                                    
